Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Binaries for macOS, Linux, and Windows (all on x86-64) are available for download for each release of fpm, as well as the latest (bleeding edge) release which mirrors the latest commit in the main branch of fpm.
de: Für macOS, Linux und Windows (alles auf x86-64) sind Binärdateien verfügbar, die für jede Version von fpm verfügbar sind, sowie die neueste (Bleeding Edge) Version, die aktuellste Version des fpm-Main-Branches speichert.
es: Binarios para MacOS, Linux y Windows (todos sobre x86-64) pueden ser descargados para cada versión de fpm, así como también para la versión más reciente (vanguardia) que refleja la última confirmación en la rama principal fpm.
fr: Des binaires pour macOS, Linux et Windows (tous pour x86-64) sont disponibles en téléchargement pour chaque version officielle de fpm, ainsi que la dernière mouture *(bleeding edge)* qui correspond au dernier commit dans la branche principale de fpm.
in: मैकओएस, लिनक्स और विंडोज (सभी एक्स 86-64 पर) के लिए बिनेरी एफपीएम की प्रत्येक रिलीज के लिए डाउनलोड के लिए उपलब्ध हैं, साथ ही नवीनतम (रक्तस्राव किनारे) रिलीज जो एफपीएम की मुख्य शाखा में नवीनतम प्रतिबद्धता को प्रतिबिंबित करता है।
ja: fpmの各リリースにおける，macOS，Linux，およびWindows向けのバイナリ（全てx86-64）をダウンロード可能です．また，fpmのmainブランチ内の最新コミットを反映した試作的な最新開発版もダウンロードできます．
nl: Voor macOS, Linux en Windows (alles op x86-64) zijn executables beschikbaar voor elke afzonderlijke versie van fpm, evenals de nieuwste (bleeding edge) versie, gebaseerd op de laatste commits in de hoofdtak.
pt: Binários para macOS, Linux e Windows (todos para a arquitetura x86-64) estão disponíveis para download em cada lançamento do fpm, bem como a versão mais recente (bleeding edge) que está a par com o último commit do ramo main.
zh_cn: macOS、Linux和Windows（全部为x86-64）平台的fpm各个版本都提供了二进制文件下载，包括最新的发布版，它是fpm主分支最新提交的镜像版本。

source: Navigate to [fpm releases](https://github.com/fortran-lang/fpm/releases) to see all available releases. The downloadable files are available at the bottom of each release section under *Assets*. Click on the appropriate link based on your OS. For example, to download a macOS fpm binary, click on the link that has *macos* in its name. After downloading, you will need to make your binary executable. On Linux and macOS, you can do this by typing
de: Gehe zu [fpm Releases](https://github.com/fortran-lang/fpm/releases) um alle verfügbaren Releases zu sehen. Die herunterladbaren Dateien sind unter *Assets* in jedem Release-Abschnitt verfügbar. Klick auf den entsprechenden Link, der dem gewünschten Betriebssystem entspricht. Zum Beispiel, um ein fpm-Binary für macOS herunterzuladen, klicke auf den Link, der *macos* in seinem Namen enthält. Nach dem Herunterladen muss das heruntergeladene Programm ausführbar gemacht werden. Auf Linux und macOS kann dies folgendermaßen erreicht werden
es: Navegue en [fpm release](https://github.com/fortran-lang/fpm/releases) para ver todas las versiones disponibles. Los archivos descargables están disponibles en la parte inferior de cada sección de lanzamiento en *Assets*. Haga clic en el enlace apropiado para su OS. Por ejemplo, para descargar un binario de fpm para macOS, haga clic en el enlace que tiene el nombre *macos*. Después de descargar el binario, necesitará convertirlo en ejecutable. En Linux y macOS, puede hacer esto escribiendo
fr: Allez dans [fpm releases](https://github.com/fortran-lang/fpm/releases) pour voir toutes les versions disponibles. Les fichiers téléchargeables sont disponibles au bas de chaque section en cliquant sur *Assets*. Cliquez sur le lien correspondant à votre système d'exploitation. Par exemple, pour télécharger un binaire pour macOS, cliquez sur le lien dont le nom contient *macos*. Après le téléchargement, vous devrez rendre votre binaire exécutable. Sous Linux et macOS, vous pouvez le faire en tapant
in: सभी उपलब्ध रिलीज़ देखने के लिए [fpm रिलीज़] (https://github.com/fortran-lang/fpm/releases) पर नेविगेट करें। डाउनलोड करने योग्य फाइलें *एसेट्स* के तहत प्रत्येक रिलीज़ अनुभाग के निचले भाग में उपलब्ध हैं। अपने ओएस के आधार पर उपयुक्त लिंक पर क्लिक करें। उदाहरण के लिए, मैकओएस एफपीएम बाइनरी डाउनलोड करने के लिए, उस लिंक पर क्लिक करें जिसके नाम में *macos* है। डाउनलोड करने के बाद, आपको अपने बाइनरी निष्पादन योग्य बनाने की आवश्यकता होगी। लिनक्स और मैकओएस पर, आप टाइप करके ऐसा कर सकते हैं
ja: [fpm releases](https://github.com/fortran-lang/fpm/releases)に移動すると，利用可能な全てのリリースを確認できます，ダウンロード可能なファイルは，各リリース項目の下部にある*Assets*に表示されます．利用しているOSに応じて，適切なリンクをクリックしてください．例えば，macOS向けのfpmバイナリをダウンロードするには，名前に*macos*が含まれているリンクをクリックします．ダウンロードした後，バイナリを実行可能にする必要があります．LinuxまたはmacOSでは，下記のコマンドを実行します．
nl: Ga naar [fpm Releases](https://github.com/fortran-lang/fpm/releases) om alle beschikbare releases te bekijken. De bestanden die te downloaden zijn staan onder *Assets* in elke release-sectie. Klik op de link voor het gewenste operating systeem. Bijvoorbeeld, om een fpm-executable voor macOS te downloaden, klik op de link genaamd *macos*. Na het downloaden moet het programma uitvoerbaar gemaakt worden. Op Linux en macOS doe je dat als volgt:
pt: Vá para [fpm releases](https://github.com/fortran-lang/fpm/releases) para ver todas as versões disponíveis. Os ficheiros a serem descarregados encontram-se ao final de cada secção de release sob *Assets*; Clique na ligação apropriada baseado no seu SO. Por exemplo, para descarregar o binário para o macoOS, clique na ligação que possui *macos* no nome. Após descarregado, precisará fazê-lo executável. No Linux e macOS, ode fazer isso digitando
zh_cn: 访问[fpm发行版（release）](https://github.com/fortran-lang/fpm/releases)以查看所有可用版本。可下载文件位于"Assets"下每个版本部分的底部。根据您的操作系统单击相应的链接。例如，要下载macOS的fpm二进制文件，请单击名称中包含*macos*的链接。下载后，您需要使二进制文件具有可执行权限。在Linux和macOS上，您可以通过键入

source: Optionally, place the binary in a directory that is globally accessible (*i.e.* in the ``PATH`` environment variable on Linux and macOS). You can also rename the binary to just *fpm* for easier use.
de: Optional, stelle das Binary in einem Verzeichnis, das global zugänglich ist (*z.B.* in der ``PATH``-Variable auf Linux und macOS). Um das Binary einfacher verwendbar zu machen kann es auch in *fpm* umbenannt werden.
es: Opcionalmente, coloque el binario en un directorio con acceso global (es decir, en la variable de ambiente ``PATH`` en Linux y macOS). También puede renombrar el binario como *fpm* para facilitar su uso.
fr: Éventuellement, placez le binaire dans un répertoire accessible globalement (c'est-à-dire dans la variable d'environnement ``PATH`` sous Linux et macOS). Vous pouvez également renommer le binaire en *fpm* pour simplifier son utilisation.
in: वैकल्पिक रूप से, बाइनरी को एक निर्देशिका में रखें जो विश्व स्तर पर सुलभ है (* यानी * लिनक्स और मैकओएस पर 'पाथ' पर्यावरण चर में)। आप आसान उपयोग के लिए बाइनरी का नाम बदलकर सिर्फ *fpm* भी कर सकते हैं।
ja: 任意の作業として，どこからでもアクセス可能なディレクトリ（つまり，LinuxとmacOSでは，``PATH``環境変数で指定されたディレクトリ）にバイナリを配置します．使いやすいように，名前を*fpm*のみに変更できます．
nl: Als alternatief kun je de executable in een directory zetten die in het pad is opgenomen (*d.w.z.* in de ``PATH`` environmentvariabele). Je kunt ook de executable hernoemen tot *fpm*, als dat makkelijker is.
pt: De forma opcional, coloque o binário em um diretório que é globalmente acessível (*Ex.* na variável de ambiente ``PATH``). Você também pode renomear o binário para apenas *fpm* para ser mais fácil de usar.
zh_cn: （可选）将二进制文件放在全局可访问的目录中（即在Linux和macOS上的环境变量``PATH``中）。您还可以将二进制文件重命名为*fpm*，以便于使用。

source: For Windows, both a self-contained binary and a Windows Installer for fpm are available.
de: Für Windows sind sowohl ein selbstverständliches Binary als auch ein Windows-Installer für fpm verfügbar.
es: Para Windows, un binario independiente y un instalador de fpm están disponibles.
fr: Pour Windows, sont disponibles à la fois un binaire autonome et un programme d'installation Windows pour fpm.
in: विंडोज के लिए, एफपीएम के लिए एक स्व-निहित बाइनरी और एक विंडोज इंस्टॉलर दोनों उपलब्ध हैं।
ja: Windowsでは，fpmのバイナリだけでなく，インストーラも利用できます．
nl: Voor Windows zijn zowel een zelfstandige executable als een Windows-Installer voor fpm beschikbaar.
pt: Para Windows, tanto um arquivo binário independente quanto um instalador para o fpm estão disponíveis.
zh_cn: 对于Windows，既有独立的二进制文件，也有适用于fpm的Windows安装程序。

source: Links that end with ``.sha256`` provide the cryptographic hashes that you can use to verify if the download of your binary was successful. To verify the integrity of the downloaded binary the checksum can be computed locally and compared with the one provided in the release
de: Links, die mit ``.sha256`` enden, stellen die kryptographische Hashes dar, um zu verifizieren, ob die Herunterladen des Binaries erfolgreich war. Um die Integrität des heruntergeladenen Binaries zu verifizieren kann die Prüfsumme lokal berechnet und mit der im Release angegebenen Prüfsumme verglichen werden
es: Los enlaces con la extensión ``.sha256`` brindan identificadores criptográficos que pueden ser usados para verficar si la descarga del binario fue correcta. Para verificar la integridad del binario descargado, la suma de verificación puede ser realizada localmente y comprobada con la se brinda en el lanzamiento
fr: Les liens qui se terminent par ``.sha256`` fournissent les hachages cryptographiques que vous pouvez utiliser pour vérifier si le téléchargement de votre binaire s'est bien passé. Pour vérifier l'intégrité du binaire téléchargé, la somme de contrôle peut être calculée localement et comparée à celle fournie en ligne
in: '.sha256' के साथ समाप्त होने वाले लिंक क्रिप्टोग्राफिक हैश प्रदान करते हैं जिनका उपयोग आप यह सत्यापित करने के लिए कर सकते हैं कि आपके बाइनरी का डाउनलोड सफल रहा या नहीं। डाउनलोड किए गए बाइनरी की अखंडता को सत्यापित करने के लिए चेकसम की गणना स्थानीय रूप से की जा सकती है और रिलीज में प्रदान किए गए एक के साथ तुलना की जा सकती है।
ja: 末尾が``.sha256``のリンクは暗号学的ハッシュを提供しており，バイナリのダウンロードが成功したかの検証に利用できます．ダウンロードしたバイナリの整合性を検証するために，チェックサムを計算し，fpm releasesで提供されているハッシュと比較してください．
nl: Links, die eindigen op ``.sha256``, geven de cryptographische hashes aan, om te verifiëren, of het downloaden van de executables is gelukt. Om de integriteit ervan te verifiëren kun je lokaal de checksum ervan berekenen en met de checksum uit de release vergelijken.
pt: Links que possuem a extensão ``.sha256`` fornece as hashes criptográficas que você pode usar para verificar se o download do seu binário foi um sucesso. Para verificar a integridade do seu download você pode realizar o checksum que pode ser computado localmente e comparado com o disponível no release
zh_cn: 以``.sha256``结尾的链接提供加密哈希，您可以使用这些哈希来验证二进制文件的下载是否成功。为了验证下载的二进制文件的完整性，可以在本地计算校验和，并与发行版中提供的校验和进行比较

source: If the checksums mismatch, the download was most likely incomplete and the binary non-functional. In this case, retry the download of the binary and confirm that the checksums match.
de: Wenn die Prüfsummen nicht übereinstimmen, war die Herunterladen des Binaries nicht erfolgreich. In diesem Fall kann es erneut versucht werden, die Binaries herunterzuladen und zu verifizieren, dass die Prüfsummen übereinstimmen.
es: Si las sumas de verificación no coinciden, es probable que la descarga esté incompleta y así, el binario no es funcional. En este caso, reinicie la descarga del binario y confirme que las sumas de verificación coinciden.
fr: Si les sommes de contrôle ne correspondent pas, le téléchargement était très probablement incomplet et le binaire non fonctionnel. Dans ce cas, réessayez de télécharger le binaire et vérifiez que les sommes de contrôle correspondent.
in: यदि चेकसम बेमेल है, तो डाउनलोड सबसे अधिक अपूर्ण था और बाइनरी गैर-कार्यात्मक था। इस मामले में, बाइनरी के डाउनलोड का पुन: प्रयास करें और पुष्टि करें कि चेकसम मेल खाते हैं।
ja: もしチェックサムが一致しないなら，ダウンロードが不完全の可能性が高く，バイナリは動作しないでしょう．バイナリのダウンロードを再試行し，チェックサムが一致することを確認してください．
nl: Wanneer de checksums niet met elkaar overeenstemmen is de download hoogstwaarschijnlijk onvolledig. Probeer het dan opnieuw en vergelijk de checksum opnieuw.
pt: se o checksum não confere, o download pode ter sido incompleto e o binário pode não funcionar. Nesse caso, tente baixar o binário novamente e confira se o checksum bate.
zh_cn: 如果校验和不匹配，则下载很可能不完整，二进制文件无法正常工作。在这种情况下，请重试下载二进制文件并确认校验和匹配。

source: {fab}`windows` MSYS2 package manager
de: {fab}`windows` MSYS2 Paketverwaltung
es: {fab}`windows` Administrador de paquetes MSYS2
fr: {fab}`windows` Gestionnaire de paquets MSYS2
in: {fab}`windows` MSYS2 पैकेज मैनेजर
ja: {fab}`windows` MSYS2パッケージ管理システムの利用
nl: {fab}`windows` Packagemanager van MSYS2
pt: {fab}`windows` Gerenciador de pacotes MSYS2
zh_cn: {fab}`windows` MSYS2包管理器

source: [![MSYS2 mingw package](https://repology.org/badge/version-for-repo/msys2_mingw/fpm-fortran-package-manager.svg)](https://packages.msys2.org/base/mingw-w64-fpm)
es: [![Paquete MSYS2 mingw](https://repology.org/badge/version-for-repo/msys2_mingw/fpm-fortran-package-manager.svg)](https://packages.msys2.org/base/mingw-w64-fpm)
fr: [![paquet MSYS2 mingw](https://repology.org/badge/version-for-repo/msys2_mingw/fpm-fortran-package-manager.svg)](https://packages.msys2.org/base/mingw-w64-fpm)
pt: [![pacote mingw MSYS2](https://repology.org/badge/version-for-repo/msys2_mingw/fpm-fortran-package-manager.svg)](https://packages.msys2.org/base/mingw-w64-fpm)

source: MSYS2 mingw package
es: Paquete MSYS2 mingw
fr: Paquet MSYS2 mingw
pt: pacote mingw MSYS2
zh_cn: MSYS2 mingw 包

source: The [MSYS2 project](https://www.msys2.org) provides a package manager and makes many common Unix tools available for Windows.
de: Das [MSYS2 Projekt](https://www.msys2.org) bietet ein Paketverwaltungs- System und macht viele allgemeine Unix-Tools für Windows verfügbar.
es: El [proyecto MSYS2](https://www.msys2.org>) brinda un administrador de paquetes y permite que muchas herramientas comunes en Unix estén disponibles para Windows.
fr: Le [projet MSYS2](https://www.msys2.org) fournit un gestionnaire de paquets qui rend de nombreux outils Unix courants disponibles pour Windows.
in: [MSYS2 प्रोजेक्ट](https://www.msys2.org) एक पैकेज मैनेजर प्रदान करता है और विंडोज के लिए कई सामान्य यूनिक्स टूल्स उपलब्ध कराता है।
ja: [MSYS2プロジェクト](https://www.msys2.org)はパッケージ管理システムを提供しており，Unixにおける共通したツールの多くをWindowsで利用できるようにします．
pt: O [projeto MSYS2](https://www.msys2.org) provê um gerenciador de pacotes e torna várias ferramentas comuns ao Unix disponíveis no Windows.
zh_cn: [MSYS2 项目](https://www.msys2.org)提供了一个包管理器，并使许多常见的 Unix 工具可用于 Windows。

source: To install download the ``msys2-x86_64-YYYYMMDD.exe`` installer from the MSYS2 webpage and run it. MSYS2 will create several new desktop shortcuts, like *MSYS terminal*, *MinGW64 terminal* and *UCRT64 terminal* (more information on MSYS2 terminals are available [here](https://www.msys2.org/docs/terminals/)).
de: Um fpm zu installieren, kann der ``msys2-x86_64-YYYYMMDD.exe``-Installer von der MSYS2-Webseite herunter und ausgeführt werden. MSYS2 wird einige neue Desktop-Verknüpfungen erstellen, wie *MSYS terminal*, *MinGW64 terminal* und *UCRT64 terminal* (mehr Informationen über MSYS2-Terminals sind [hier](https://www.msys2.org/docs/terminals/) verfügbar).
es: Para instalar, descargue el instalador ``msys2-x86_64-YYYYMMDD.exe`` desde la página web de MSYS2 y ejecutelo. MSYS2 creara múltiples atajos, como los terminales *MSYS*, *MinGW64* y *UCRT64* (mas informaciones sobre los terminales MSYS están disponibles [aquí](https://www.msys2.org/docs/terminals/)).
fr: Pour l'installer, téléchargez le programme d'installation ``msys2-x86_64-YYYYMMDD.exe`` depuis la page web de MSYS2 et exécutez-le. MSYS2 créera plusieurs nouveaux raccourcis sur votre bureau, comme *MSYS terminal*, *MinGW64 terminal* et *UCRT64 terminal* (plus d'informations sur les terminaux MSYS2 sont disponibles [ici](https://www.msys2.org/docs/terminals/)).
in: MSYS2 वेबपेज और इसे चलाएं। MSYS2 कई नए डेस्कटॉप शॉर्टकट बनाएगा, जैसे *MSYS Terminal*, *MinGW64 Terminal* और *UCRT64 Terminal* (MSYS2 टर्मिनलों के बारे में अधिक जानकारी [यहां](https://www.msys2.org/docs/terminals/) पर उपलब्ध है। ).
ja: インストールするには，MSYS2のウェブページからインストーラ``msys2-x86_64-YYYYMMDD.exe``をダウンロードし，それを実行します．MSYS2は，*MSYS terminal*, *MinGW64 terminal*, *UCRT64 terminal*などのいくつかの新しいデスクトップショートカットを作成します．（MSYS2の端末の詳細は，[こちら](https://www.msys2.org/docs/terminals/)を参照してください）
nl: Om fpm te installeren, kan het installatieprogramma ``msys2-x86_64-YYYYMMDD.exe`` van de website van MSYS2 gebruikt worden. MSYS2 maakt enkele nieuwe links aan op de desktop, zoals de *MSYS terminal*, *MinGW64 terminal* en *UCRT64 terminal* (voor meer informatie hierover zie [hier](https://www.msys2.org/docs/terminals/)).
pt: Para instalar baixe o arquivo instalador ``msys2-x86_64-AAAAMMDD.exe`` a partir do site do MSYS2 e execute-o. MSYS2 criará vários atalhos em sua Área de Trabalho, como o *MSYS terminal*, *MinGW64 terminal* e o *UCRT64 terminal* (mais informações sobre terminais do MSYS2 estão disponíveis [aqui](https://www.msys2.org/docs/terminals/)).
zh_cn: 要安装 ``msys2-x86_64-YYYYMMDD.exe``，请从 MSYS2 网页下载安装程序并运行它。MSYS2 将创建几个新的桌面快捷方式，如 *MSYS* 终端、*MinGW64* 终端和 *UCRT64* 终端（有关 MSYS2 终端的更多信息可在[此处](https://www.msys2.org/docs/terminals/)获得）。

source: The Fortran Package Manager is supported for the *UCRT64*, *MinGW64*, or *MinGW32* terminal.
de: Für die *UCRT64*, *MinGW64* oder *MinGW32*-Terminal wird fpm unterstützt.
es: El Administrador de paquetes de Fortran es soportado por los terminales *UCRT64*, *MinGW64* o *MinGW32*.
fr: Le gestionnaire de paquets Fortran est pris en charge par le terminal *UCRT64*, *MinGW64* ou *MinGW32*.
ja: Fortranパッケージマネージャは，*UCRT64*, *MinGW64*, *MinGW32* terminalで利用できます．
pt: O Gerenciador de Pacotes Fortran possui suporte aos terminais *UCRT64*, *MinGW64* e *MinGW32*.
zh_cn: *UCRT64*、*MinGW64*或*MinGW32*终端支持安装Fortran包管理器（fpm）。

source: Open a new terminal and update your installation with
de: Öffne ein neues Terminal und aktualisiere die Installation mit
es: Abra un nuevo terminal y actualize su instalación con
fr: Ouvrez un nouveau terminal et mettez à jour votre installation avec
in: एक नया टर्मिनल खोलें और अपनी स्थापना के साथ अद्यतन करें
ja: 新しい端末を開き，次のコマンドを用いて更新してください．
nl: Open een nieuwe terminal en werk de installation bij met:
pt: Abra um novo terminal e atualize sua instalação usando
zh_cn: 打开新终端并更新MSYS2系统

source: You might have to update MSYS2 and ``pacman`` first, restart the terminal and run the above command again to update the installed packages.
de: Eventuell muss MSYS2 und ``pacman`` zuerst aktualisiert, das Terminal neu startet und den obige Befehl erneut ausführt werden, um die installierten Pakete zu aktualisieren.
es: Es posible que primero tenga que actualizar MSYS2 y ``pacman``. Reinicie el terminal y ejecute nuevamente el comando anterior para actualizar los paquetes instalados.
fr: Vous devrez peut-être mettre à jour MSYS2 et ``pacman`` d'abord, puis redémarrer le terminal et exécuter à nouveau la commande ci-dessus pour mettre à jour les paquets installés.
in: आपको पहले MSYS2 और 'pacman' को अपडेट करना पड़ सकता है, टर्मिनल को पुनरारंभ करना होगा
ja: MSYS2および``pacman``を先に更新する必要があるかもしれません．その場合，端末を再起動し，上記のコマンドを再度実行して，インストールされたパッケージを更新します．
nl: Het kan nodig zijn om eerst MSYS2 en ``pacman`` bij te werken. Start dan een nieuwe terminal en voer de opdracht hierboven uit, om de geïnstalleerde packages bij te werken.
pt: Você pode precisar atualizar o MSYS2 e o ``pacman`` primeiro, reinicie o terminal e rode os comandos novamente para atualizar os pacotes instalados.
zh_cn: 你可能需要首先更新MSYS2和``pacman``，然后重新启动终端并再次运行上述命令以更新已安装的包。

source: If you are using the *MinGW64 terminal* you can install the required software with
de: Wird das *MinGW64 terminal* verwendet, kann die benötigten Software mit installiert werden
es: Si está usando el terminal *MinGW64*, usted puede instalar el programa requerido con
fr: Si vous utilisez le terminal *MinGW64*, vous pouvez installer le logiciel requis avec
in: यदि आप * MinGW64 टर्मिनल * का उपयोग कर रहे हैं तो आप आवश्यक सॉफ़्टवेयर स्थापित कर सकते हैं
ja: *MinGW64 terminal*を利用しているのであれば，必要なソフトウェアを次のコマンドでインストールできます．
nl: Als je de *MinGW64 terminal* gebruikt, kun je de vereiste software installeren met
pt: Se você está usando o *terminal MinGW64* você pode instalar os programas necessários usando
zh_cn: 如果你使用的是*MinGW64*终端，则可以使用

source: Both *git* and *gfortran* are not mandatory dependencies for running fpm. If you provide *git* and *gfortran* from outside they will get picked up as well.
de: Sowohl *git* als auch *gfortran* müssen nicht als Abhängigkeiten für die Funktionalität von fpm installiert werden. Wenn *git* und *gfortran* von außenhalb bereitstellt werden, werden diese automatisch gefunden.
es: *git* o *gfortran* no son dependencias obligatórias para ejecutar fpm. Estos pueden ser proporcionados externamente.
fr: *git* et *gfortran* ne sont ni l'un ni l'autre des dépendances obligatoires pour exécuter fpm. Si vous installez *git* et *gfortran* indépendamment, ils seront également pris en charge.
in: एफपीएम चलाने के लिए *git* और *gfortran* दोनों अनिवार्य निर्भरता नहीं हैं। यदि आप बाहर
ja: *git*と*gfortran*は，どちらもfpmを実行するために必要な依存ソフトウェアではありません．*git*と*gfortran*を外部から導入した場合，それらも見つけられます．
nl: Voor het draaien van fpm zijn *git* of *gfortran* niet noodzakelijk. Maar als deze software geïnstalleerd is, dan wordt het automatisch gebruikt.
pt: Tanto o *git* quanto o *gfortran* não são dependências obrigatórias para rodar o fpm. Ambos podem ser fornecidos externamente.
zh_cn: *git*和*gfortran*都不是运行fpm的必需依赖项。如果你从外面提供*git*和*gfortran*，它们也会被包括进来。

source: {fab}`apple` Homebrew package manager
de: {fab}`apple` Homebrew Paketverwaltung
es: {fab}`apple` Administrador de paquetes Homebrew
fr: {fab}`apple` Gestionnaire de paquets Homebrew
in: {fab}`apple` Homebrew पैकेज प्रबंधक
ja: {fab}`apple` Homebrewパッケージ管理システムの利用
nl: {fab}`apple` Homebrew packagemanagement
pt: {fab}`apple` Gerenciador de pacotes Homebrew
zh_cn: {fab}`apple` Homebrew包管理器

source: The Fortran Package Manager (fpm) is available for the [homebrew](https://brew.sh) package manager on MacOS via an additional tap. To install fpm via brew, include the new tap and install it using
de: Der Fortran-Paketmanager (fpm) ist für das [homebrew](https://brew.sh) Paketverwaltungs-System auf MacOS von einem zusätzlichen Tap verfügbar. Um fpm via brew zu installieren, füge die neue Tap hinzu und installiere es mit
es: El Administrador de paquetes de Fortran (fpm) está disponible para el Administrador de paquetes [homebrew](https://brew.sh) sobre MacOS mediante un Tap adicional. Para instalar fpm mediante brew, incluya el nuevo Tap e instalelo usando
fr: Le gestionnaire de paquets Fortran (fpm) est disponible pour le gestionnaire de paquets [homebrew](https://brew.sh) sur macOS via une source supplémentaire. Pour installer fpm via brew, incluez la nouvelle source et installez-le en utilisant
in: फोरट्रान पैकेज मैनेजर (एफ पी एम) के लिए उपलब्ध है [homebrew](https://brew.sh) एक अतिरिक्त टैप के माध्यम से MacOS पर पैकेज मैनेजर। एफपीएम को काढ़ा के माध्यम से स्थापित करने के लिए, नया टैप शामिल करें और इसका उपयोग करके स्थापित करें
ja: Fortranパッケージマネージャ（fpm）は，MacOSの[homebrew](https://brew.sh)パッケージマネージャから，追加のtapとして利用できるようになりました．brewからfpmをインストールするには，新しいtapをインクルードし，以下のコマンドを用いてインストールします．
nl: De Fortran-packagemanager (fpm) is voor de [homebrew](https://brew.sh) packagemanager op MacOS beschikaar via een andere tap. Om fpm via brew te installeren, voeg de nieuwe tap toe en installeer het met:
pt: O Gerenciador de Pacotes Fortran (fpm) está disponível para o gerenciador de pacotes [homebrew](https://brew.sh) no MacOS via um tap adicional. Para instalar o fpm pelo comando brew, inclua o novo tap e instale-o usando
zh_cn: Fortran 包管理器（fpm）在 MacOS 上的 [Homebrew 包管理器](https://brew.sh)中可以获取，只需额外的 ``tap`` 即可。要通过 brew 安装 fpm，使用
