Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Neither the module nor the package name shall contain the default separator sequence elsewhere.
fr: Ni le module ni le nom du paquet ne doivent contenir ailleurs la séquence de séparateur par défaut.
in: न तो मॉड्यूल और न ही पैकेज नाम में डिफ़ॉल्ट विभाजक अनुक्रम कहीं और होगा।
zh_cn: 模块和包的名称都不应该在其他地方包含默认的分隔符序列。

source: The default separator is a *double* underscore, single underscores are allowed anywhere except at the end of a package name.
fr: Le séparateur par défaut est un *double* trait de soulignement. Les traits de soulignement simples sont autorisés partout sauf à la fin d'un nom de paquet.
in: डिफ़ॉल्ट विभाजक एक *डबल* अंडरस्कोर है, पैकेज नाम के अंत को छोड़कर कहीं भी एकल अंडरस्कोर की अनुमति है।
zh_cn: 默认的分隔符是*双*下划线，单下划线可以在任何地方使用，除了在包名的末尾。

source: *Valid enforced module names*
fr: *Noms de modules appliqués valides*
in: *मान्य लागू मॉड्यूल नाम*
zh_cn: *有效的执行模块名称*

source: When the naming conventions are enforced, these are example modules in a package named `my_pkg` to illustrate the rules:
fr: Lorsque les conventions de nommage sont appliquées, voici des exemples de modules dans un paquet nommé `my_pkg` pour illustrer les règles :
in: जब नामकरण परंपराओं को लागू किया जाता है, तो ये नियमों को समझाने के लिए `my_pkg` नामक पैकेज में उदाहरण मॉड्यूल हैं:
zh_cn: 当命名规则被强制执行时，这些是在一个名为`my_pkg`的包中的例子模块，以说明规则：

source: *Invalid enforced module names*
fr: *Noms de modules appliqués non valides*
in: *अमान्य लागू मॉड्यूल नाम*
zh_cn: *无效的执行模块名称*

source: Considering the same package `my_pkg`, the following names will be invalid according to the naming rules:
fr: Considérant le même package `my_pkg`, les noms suivants seront invalides selon les règles de nommage :
in: समान पैकेज `my_pkg` को ध्यान में रखते हुए, निम्नलिखित नाम नामकरण नियमों के अनुसार अमान्य होंगे:
zh_cn: 考虑到同一个软件，`my_pkg`，根据命名规则，以下名称将是无效的：

source: Custom Module names
fr: Noms de modules personnalisés
zh_cn: 自定义模块名称

source: Optionally, one can specify a custom prefix for the package's modules. The custom prefix must be:
fr: En option, il est possible de spécifier un préfixe personnalisé pour les modules du paquet. Le préfixe personnalisé doit être :
in: वैकल्पिक रूप से, कोई पैकेज के मॉड्यूल के लिए एक कस्टम उपसर्ग निर्दिष्ट कर सकता है। कस्टम उपसर्ग होना चाहिए:
zh_cn: 可以选择为包的模块指定一个自定义前缀。该自定义前缀必须是：

source: A valid Fortran name;
fr: Un nom Fortran valide ;
in: मान्य फोरट्रान नाम;
zh_cn: 一个有效的Fortran名称；

source: Alphanumeric only characters (no spaces, symbols, dashes, underscores allowed).
fr: Contenant uniquement des caractères alphanumériques (pas d'espaces, de symboles, de tirets, de traits de soulignement).
in: अक्षरांकीय केवल वर्ण (कोई रिक्त स्थान, प्रतीक, डैश, अंडरस्कोर की अनुमति नहीं है)।
zh_cn: 只有字母数字字符（不允许有空格、符号、破折号、下划线）。

source: Different from the default option, a custom prefix needs to be validated by the registry, which keeps a list of unique custom prefixes to prevent name collisions.
fr: Contrairement à l'option par défaut, un préfixe personnalisé doit être validé par le registre, qui conserve une liste de préfixes personnalisés uniques afin d'éviter les collisions de noms.
in: डिफ़ॉल्ट विकल्प से अलग, एक कस्टम उपसर्ग को रजिस्ट्री द्वारा मान्य करने की आवश्यकता होती है, जो नाम टकराव को रोकने के लिए अद्वितीय कस्टम उपसर्गों की एक सूची रखता है।
zh_cn: 与默认选项不同的是，自定义前缀需要经过注册表的验证，注册表保留了一个唯一的自定义前缀列表，以防止名称碰撞。

source: Module names with the custom prefix are followed by a ``single underscore`` `_`, which makes this option more flexible and backward compatible with existing packages. When a custom module prefix is specified, the default one is still available. Considering for example a package named `date-time`, with chosen prefix `dt`, the following are all valid module names:
fr: Les noms de modules avec le préfixe personnalisé sont suivis d'un ``simple trait de soulignement`` ` _`, ce qui rend cette option plus flexible et rétrocompatible avec les paquets existants. Lorsqu'un préfixe de module personnalisé est spécifié, le préfixe par défaut reste disponible. Si l'on considère par exemple un paquet nommé `date-time`, avec le préfixe choisi `dt`, les noms de modules suivants sont tous valides :
in: कस्टम उपसर्ग के साथ मॉड्यूल नाम के बाद एक ``एकल अंडरस्कोर`` `_` होता है, जो इस विकल्प को मौजूदा पैकेज के साथ अधिक लचीला और पिछड़ा संगत बनाता है। जब एक कस्टम मॉड्यूल उपसर्ग निर्दिष्ट किया जाता है, तो डिफ़ॉल्ट अभी भी उपलब्ध होता है। उदाहरण के लिए चयनित उपसर्ग `dt` के साथ `दिनांक-समय` नामक एक पैकेज को ध्यान में रखते हुए, निम्नलिखित सभी मान्य मॉड्यूल नाम हैं:
zh_cn: 带有自定义前缀的模块名称后面有一个``单下划线`` `_`，这使得这个选项更加灵活，并向后兼容现有的软件包。当自定义模块前缀被指定时，默认的前缀仍然可用。例如，考虑到一个名为 `date-time`的包，并选择了前缀 `dt`，以下是所有有效的模块名称：

source: Package names
fr: Noms de paquets
in: पैकेज के नाम
pt: Nome dos pacotes
zh_cn: 包名称

source: All packages in FPM registries must have unique names, hence they must abide to the following rules
fr: Tous les paquets figurant dans les registres de FPM doivent avoir des noms uniques et doivent donc respecter les règles suivantes :
in: एफपीएम रजिस्ट्रियों में सभी पैकेजों के अद्वितीय नाम होने चाहिए, इसलिए उन्हें निम्नलिखित नियमों का पालन करना चाहिए|
zh_cn: FPM注册表中的所有软件包必须有唯一的名称，因此它们必须遵守以下规则

source: All package names shall be valid Fortran names;
fr: Tous les noms de paquets doivent être des noms valides en Fortran ;
in: सभी पैकेज नाम वैध फोरट्रान नाम होंगे;
zh_cn: 所有包的名称都应是有效的Fortran名称；

source: Dash characters (`-`) are also allowed, and are treated by fpm as underscores;
fr: Les tirets (`-`) sont également autorisés et sont traités par fpm comme des traits de soulignement (underscores) ;
in: डैश वर्ण (`-`) की भी अनुमति है, और fpm द्वारा अंडरस्कोर के रूप में व्यवहार किया जाता है;
zh_cn: 破折号字符（`-`）也是允许的，并被fpm当作下划线处理；

source: Package names may contain uppercase and lowercase characters, but their unique identification is made case insensitive;
fr: Les noms des paquets peuvent contenir des majuscules et des minuscules, mais leur identification unique ne tient pas compte de la casse ;
in: पैकेज के नाम में अपरकेस और लोअरकेस अक्षर हो सकते हैं, लेकिन उनकी विशिष्ट पहचान को केस असंवेदनशील बना दिया जाता है;
zh_cn: 包的名称可以包含大写和小写字符，但它们的唯一标识是不分大小写的；

source: No duplicate package names are allowed within the same namespace.
fr: Aucune duplication d'un nom de paquetage n'est autorisée à l'intérieur d'un même espace de noms.
in: एक ही नामस्थान में डुप्लीकेट पैकेज नामों की अनुमति नहीं है।
zh_cn: 在同一命名空间内不允许有重复的包名。

source: *Examples of valid package names:*
fr: *Exemples de noms de paquets valides :*
in: *वैध पैकेज नामों के उदाहरण:*"
pt: *Exemplos de nomes de pacote válidos:*
zh_cn: *有效软件包名称的例子：*

source: *Examples of invalid package names:*
fr: *Exemples de noms de paquets non valides :*
in: *अवैध पैकेज नामों के उदाहरण:*
pt: *Exemplos de nomes de pacote inválidos:*
zh_cn: *无效的软件包名称的例子：*

source: Manifest Settings
fr: Paramètres du manifeste
in: प्रकट सेटिंग्स
pt: Configurações do Manifesto
zh_cn: 清单设置

source: Key facts:
fr: Faits saillants :
in: महत्वपूर्ण तथ्यों:
pt: Pontos chave:
zh_cn: 关键事实：

source: FPM does not apply naming requirements by default. If you want them, enable them in `fpm.toml`
fr: Par défaut, FPM n'applique pas de règles de dénomination. Si vous le souhaitez, activez-les dans `fpm.toml`
in: एफपीएम डिफ़ॉल्ट रूप से नामकरण की आवश्यकताओं को लागू नहीं करता है। यदि आप उन्हें चाहते हैं, तो उन्हें `fpm.toml` में सक्षम करें
zh_cn: FPM默认不应用命名要求。如果你想要它们，请在`fpm.toml`中启用它们

source: FPM registries mandatorily require them. Ensure `fpm.toml` enables them.
fr: Les registres FPM les requièrent obligatoirement. Assurez-vous qu'ils sont activés dans `fpm.toml`.
in: एफपीएम रजिस्ट्रियों को अनिवार्य रूप से उनकी आवश्यकता होती है। सुनिश्चित करें कि `fpm.toml` उन्हें सक्षम करता है।
zh_cn: FPM注册处强制要求它们。确保`fpm.toml`启用它们。

source: Enable standard prefix with `module-naming=true`, custom prefix with `module-naming="prefixname"`.
fr: Activez le préfixe standard avec `module-naming=true`, le préfixe personnalisé avec `module-naming="prefixname"`.
in: `मॉड्यूल-नामकरण = सत्य` के साथ मानक उपसर्ग सक्षम करें, `मॉड्यूल-नामकरण = "उपसर्गनाम "` के साथ कस्टम उपसर्ग।
zh_cn: 用`module-naming=true`启用标准前缀，用`module-naming="prefixname"`启用自定义前缀。

source: Module naming requirements can be enabled in `fpm.toml` under the `build` section, using the boolean flag `module-naming`. By default, `module-naming = false`, so no registry name enforcing is checked during the build.
fr: Les exigences relatives à la dénomination des modules peuvent être activées dans `fpm.toml` dans la section `build`, à l'aide de l'indicateur booléen `module-naming`. Par défaut, `module-naming = false`, de sorte qu'aucune vérification des exigences de nommage du registre n'est effectuée pendant la construction.
in: बूलियन फ्लैग `मॉड्यूल-नेमिंग` का उपयोग करके मॉड्यूल नामकरण आवश्यकताओं को `बिल्ड` सेक्शन के तहत `fpm.toml` में सक्षम किया जा सकता है। डिफ़ॉल्ट रूप से, `मॉड्यूल-नामकरण = झूठा`, इसलिए निर्माण के दौरान कोई रजिस्ट्री नाम लागू करने की जाँच नहीं की जाती है।
zh_cn: 模块命名要求可以在`fpm.toml`中的`build`部分启用，使用布尔标志`module-naming`。默认情况下，`module-naming = false`，所以在构建过程中不会检查注册表的名称强制。

source: Guidelines
fr: Lignes directrices
in: दिशा-निर्देश
pt: Guias
zh_cn: 准则

source: These are non-mandatory styling suggestions to improve code readability and uniformity.
fr: Il s'agit de suggestions de style non obligatoires visant à améliorer la lisibilité et l'uniformité du code.
in: कोड पठनीयता और एकरूपता में सुधार के लिए ये गैर-अनिवार्य स्टाइलिंग सुझाव हैं।
zh_cn: 这些是非强制性的风格建议，以提高代码的可读性和统一性。

source: It's recommended that the public API of each package is contained in a top-level module, whose name is same as the package name. For example, assuming a package ``DateTime`` deals with time and date in Fortran, one could have several modules deal with parts of it:
fr: Il est recommandé que l'API publique de chaque paquet soit contenue dans un module de premier niveau, dont le nom est identique à celui du paquet. Par exemple, en supposant qu'un paquet ``DateTime`` s'occupe de l'heure et de la date en Fortran, on pourrait avoir plusieurs modules en traitant certains aspects :
in: यह अनुशंसा की जाती है कि प्रत्येक पैकेज का सार्वजनिक एपीआई एक शीर्ष-स्तरीय मॉड्यूल में समाहित हो, जिसका नाम पैकेज के नाम के समान हो। उदाहरण के लिए, एक पैकेज मानते हुए ``डेटटाइम`` फोरट्रान में समय और तारीख से संबंधित है, इसके कुछ हिस्सों के साथ कई मॉड्यूल डील हो सकते हैं:
zh_cn: 我们建议每个包的公共API都包含在一个顶级模块中，其名称与包的名称相同。例如，假设一个包``DateTime``在Fortran中处理时间和日期，我们可以有几个模块来处理它的一部分：

source: and a unique public API that's contained in the top-level module:
fr: et une API publique unique contenue dans le module de premier niveau :
in: और एक अद्वितीय सार्वजनिक एपीआई जो शीर्ष-स्तरीय मॉड्यूल में निहित है:
zh_cn: 和一个独特的公共API，它包含在顶层模块中：

source: References
fr: Manuel de référence
in: संदर्भ
pt: Referências
zh_cn: 引用

source: [2] [Style Guide for Python Code](https://peps.python.org/pep-0008/#package-and-module-names)
fr: [2] [Style Guide for Python Code (Guide stylistique pour les codes Python)](https://peps.python.org/pep-0008/#package-and-module-names)
in: [2] [पायथन कोड के लिए स्टाइल गाइड](https://peps.python.org/pep-0008/#package-

source: Package upload
fr: Téléversement d'un paquet
pt: Upload do pacote
zh_cn: 包上传

source: Packages can be uploaded to the [official registry](https://registry-frontend.vercel.app) using the `fpm publish` command. After a successful upload, users can search for the package and use it in their projects. But be aware that the upload is permanent. Once a package is uploaded, it cannot be deleted. If you want to make changes to a package, you will have to create a new version of the package and upload that.
fr: Les paquets peuvent être téléversés vers le [registre officiel](https://registry-frontend.vercel.app) à l'aide de la commande `fpm publish`. Après un téléversement réussi, les utilisateurs peuvent rechercher le paquet et l'utiliser dans leurs projets. Mais attention, une fois qu'un paquet est téléversé, il ne peut pas être supprimé. Si vous souhaitez apporter des modifications à un paquet, vous devrez créer une nouvelle version du paquet et l'envoyer.
zh_cn: 包可以使用`fpm publish`命令上传到[官方注册表](https://registry-frontend.vercel.app)。在成功上传后，用户可以搜索该软件包并在他们的项目中使用它。但要注意的是，上传是永久性的。一旦一个软件包被上传，它就不能被删除。如果你想对软件包进行修改，你将不得不创建一个新版本的软件包并上传。

source: **!!! Testing period – We are currently building and testing the registry. All uploaded packages will be deleted after the testing period (in June 2023) !!!**
fr: **!!! Période de test - Nous sommes actuellement en train de construire et de tester le registre. Tous les paquets téléversés seront supprimés après la période de test (en juin 2023) !!!**
zh_cn: **！！！测试期 - 我们目前正在建立和测试注册表。所有上传的包将在测试期结束后（2023年6月）被删除！！！**

source: Prerequisites
fr: Prérequis
pt: Pré-requisitos
zh_cn: 先决条件

source: Register
fr: Registre
pt: Registre
zh_cn: 注册

source: Before you can upload a package, you need to have an account on the official registry. You can create an account by visiting the [registry website](https://registry-frontend.vercel.app).
fr: Avant de pouvoir téléverser un paquet, vous devez disposer d'un compte sur le registre officiel. Vous pouvez créer un compte en visitant le [site web du registre](https://registry-frontend.vercel.app).
zh_cn: 在你上传包裹之前，你需要在官方登记处拥有一个账户。你可以通过访问[登记处网站](https://registry-frontend.vercel.app)创建一个账户。

source: A package must be uploaded to a given namespace. If you don't have a namespace yet, you need to create one on the website first.
fr: Un paquet doit être téléversé dans un espace de noms spécifique. Si vous n'avez pas encore d'espace de noms, vous devez d'abord en créer un sur le site web.
zh_cn: 一个软件包必须上传到一个指定的命名空间。如果你还没有一个命名空间，你需要先在网站上创建一个。

source: Token
fr: Jeton
zh_cn: 令牌

source: You need to generate a token for the namespace. You can do this on the website as well. The token is used to authenticate the upload. Do not share the token with anyone else. The token also expires after a certain amount of time. If you need to upload a package again, you will need to generate a new token.
fr: Vous devez générer un jeton pour l'espace de noms. Vous pouvez également le faire sur le site web. Le jeton est utilisé pour authentifier le téléversement. Ne partagez pas le jeton avec quelqu'un d'autre. Le jeton expire également après un certain temps. Si vous devez à nouveau téléverser un paquet, vous devrez générer un nouveau jeton.
zh_cn: 你需要为命名空间生成一个令牌。你也可以在网站上这样做。该令牌用于验证上传。不要与其他任何人分享该令牌。该令牌在一定时间后也会过期。如果你需要再次上传软件包，你将需要生成一个新的令牌。

source: A package must specify a valid [semver](https://semver.org/) version in its manifest.
fr: Un paquet doit spécifier une version [semver](https://semver.org/) valide dans son manifeste.
zh_cn: 一个软件包必须在其清单中指定一个有效的[semver](https://semver.org/)版本。

source: You can check the version of the package by running `fpm publish --show-package-version` before publishing.
fr: Vous pouvez vérifier la version du paquet en exécutant `fpm publish --show-package-version` avant de le publier.
zh_cn: 你可以在发布前通过运行`fpm publish --show-package-version`来检查软件包的版本。

source: License
fr: Licence du projet
pt: Licença
zh_cn: 许可证

source: A package must specify a valid [SPDX](https://spdx.org/licenses/) license in its manifest.
fr: Un paquet doit spécifier une licence [SPDX](https://spdx.org/licenses/) valide dans son manifeste.
zh_cn: 一个软件包必须在其清单中指定一个有效的[SPDX](https://spdx.org/licenses/)许可证。

source: Upload rights
fr: Droits de téléversement
pt: Direitos de Upload
zh_cn: 上传权限

source: A package can only be uploaded by package admins and maintainers. Package admins can grant admin and maintainer rights to other users.
fr: Un paquet ne peut être téléversé que par les administrateurs et les responsables du paquet. Les administrateurs de paquets peuvent accorder des droits d'administrateur et de mainteneur à d'autres utilisateurs.
zh_cn: 一个软件包只能由软件包管理员和维护者上传。软件包管理员可以授予其他用户管理员和维护者的权利。

source: Uploading
fr: Téléversement
pt: Realizando o Upload
zh_cn: 上传

source: fpm will create a tarball and upload the package to the registry when all the requirements are met. You can see all the data being sent to the registry without uploading by running `fpm publish --show-form-data`.
fr: fpm créera une archive tar et téléversera le paquet dans le registre lorsque toutes les conditions seront remplies. Vous pouvez voir toutes les données envoyées au registre sans téléverser en exécutant `fpm publish --show-form-data`.
pt: fpm irá criar um arquivo tar e fará o upload do pacote para o registro quando todos os requisitos forem satisfeitos. Você pode ver todos os dados que estão sendo enviados ao registro sem fazer nenhum upload usando o comando `fpm publish --show-form-data`.
zh_cn: fpm会创建一个tarball，并在满足所有要求后将包上传到注册表。你可以通过运行`fpm publish --show-form-data`看到所有被发送到注册表的数据，而不需要上传。

source: To publish a package, run `fpm publish --token <token>` using the token you generated on the website.
fr: Pour publier un paquet, exécutez `fpm publish --token <token>` en utilisant le jeton que vous avez généré sur le site web.
pt: Para publicar um pacote, use o comando `fpm publish --token <token>` usando o token que você gerou no site.
zh_cn: 要发布一个软件包，使用你在网站上生成的令牌运行`fpm publish --token <token>`。

source: Adding dependencies
de: Abhängigkeiten hinzufügen
es: Adicionando dependencias
fr: Ajouter des dépendances
in: निर्भरताएँ जोड़ना
ja: 依存関係の追加
nl: Afhankelijkheden toevoegen
pt: Adicionando dependências
zh_cn: 添加依赖项

source: This tutorial covers the usage of dependencies with fpm and how to reuse existing fpm projects.
de: Dieses Tutorial behandelt die Benutzung von Abhängigkeiten mit fpm und wie ein existierendes fpm-Projekt wiederverwenden werden kann.
es: Este tutorial cubre el uso de dependencias con fpm y cómo reutilizar proyectos fpm existentes.
fr: Ce tutoriel concerne l'utilisation des dépendances avec fpm et comment réutiliser des projets fpm existants.
in: यह ट्यूटोरियल fpm के साथ निर्भरताओं के उपयोग और मौजूदा fpm प्रोजेक्ट्स का पुन: उपयोग करने के बारे में बताता है।
ja: ここでは，fpmによる依存関係の利用方法と，既存のfpmプロジェクトを再利用する方法を取り扱います．
nl: Deze tutorial beschrijft het gebruik van afhankelijkheden met fpm en hoe een fpm-projekt hergebruikt kan worden.
pt: Este tutorial cobre o uso de dependências com o fpm e como reutilizar projetos fpm já existentes.
zh_cn: 本教程介绍如何用fpm处理依赖项及复用现有的fpm项目。

source: Using the standard library
de: Benutzung der Standardbibliothek
es: Usando la biblioteca estándar
fr: Utiliser la librairie standard
in: मानक पुस्तकालय का उपयोग करना
ja: 標準ライブラリの利用
nl: De standaardbibliotheek gebruiken
pt: Usando a biblioteca padrão
zh_cn: 使用Fortran标准库

source: We start with a new project with fpm, we want to build a command line application to read a file, find a certain pattern and replace it. Since we do not want to write the replace function ourselves, we will use the Fortran standard library ([stdlib](https://github.com/fortran-lang/stdlib)) as dependency. In the package manifest we define *stdlib* in the *dependencies* table:
de: Wir beginnen mit einem neuen Projekt mit fpm, wir möchten eine Kommandozeilenanwendung bauen, die eine Datei liest, einebestimmtes Suchmuster findet und ersetzt. Da wir nicht die Funktion zum Ersetzen selbst schreiben wollen, werden wir die Standardbibliothek ([stdlib](https://github.com/fortran-lang/stdlib)) als Abhängigkeit benutzen. Im Paketmanifest definieren wir *stdlib* in der *depedencies* Tabelle:
es: Iniciamos un nuevo proyecto con fpm, deseamos construir un programa de línea de comandos que lee un archivo, encuentre cierto patrón y lo reemplaze. Ya que no queremos escribir una función para reemplazar, usamos la biblioteca estándar de Fortran ([stdlib](https://github.com/fortran-lang/stdlib)) como dependencia. En el manifiesto del paquete definimos *stdlib* en la tabla de dependencias:
fr: Nous commençons un nouveau projet avec fpm où nous voulons construire une application en ligne de commandes pour lire un fichier, trouver un certain motif et le remplacer. Comme nous ne voulons pas écrire la fonction de remplacement nous-mêmes, nous allons utiliser la bibliothèque standard Fortran ([stdlib](https://github.com/fortran-lang/stdlib)) comme dépendance. Dans le manifeste du paquet, nous définissons *stdlib* dans la table *dependencies* :
in: हम fpm के साथ एक नई परियोजना के साथ शुरू करते हैं, हम एक फाइल को पढ़ने के लिए एक कमांड लाइन एप्लिकेशन बनाना चाहते हैं, एक निश्चित पैटर्न ढूंढते हैं और इसे बदलते हैं। चूँकि हम रिप्लेस फंक्शन को स्वयं नहीं लिखना चाहते हैं, हम एक निर्भरता के रूप में फोरट्रान मानक लाइब्रेरी ([stdlib](https://github.com/fortran-lang/stdlib)) का उपयोग करेंगे। पैकेज मेनिफेस्ट में हम *stdlib* को *निर्भरता* तालिका में परिभाषित करते हैं:
ja: fpmを用いて新規プロジェクトを開始し，ファイルを読み込んで特定のパターンを見つけ，それを置換するコマンドラインアプリケーションを構築することにします．置換する関数を書きたくないので，Fortran標準ライブラリ（[stdlib](https://github.com/fortran-lang/stdlib)）を依存関係として利用します．パッケージマニフェスト内の*dependencies*設定項目で，*stdlib*を定義します．
nl: We beginnen een nieuw projekt met fpm: een programma via command-lineopties een bestand inleest, een of ander patroon zoekt en dan vervangt. Omdat we de functie om tekst te vervangen niet zelf willen schrijven gebruiken we de standaardbibliotheek ([stdlib](https://github.com/fortran-lang/stdlib)) als afhankelijkheid. In het manifestbestand definiëren we *stdlib* in de tabel *dependencies*:
pt: Vamos começar com um novo projeto, queremos construir uma aplicação de linha de comando que lê um ficheiro, encontra um padrão e o substitui. Dado que não queremos escrever a função de substituição nós mesmos, vamos usar a Biblioteca Padrão do Fortran ([stdlib](https://github.com/fortran-lang/stdlib)) como dependência. No manifesto do pacote vamos definir *stdlib* na tabela de *dependencies*:
zh_cn: 我们从一个使用fpm的新项目开始。我们想构建一个命令行应用程序来读取文件，找到某个模式（pattern）并替换它。由于我们不想自己编写替换函数，我们将使用Fortran标准库（[stdlib](https://github.com/fortran-lang/stdlib)）作为*依赖项*。在包清单中，我们在依赖项表中定义*stdlib*：

source: Now we create a module with a procedure to perform the substitution. It requires three steps:
de: Zuerst müssen wir ein Modul mit einer Prozedur erstellen, das die Substitution durchführt. Diese benötigt drei Schritte:
es: Ahora creamos un módulo con un procedimiento para realizar la substitución. Esto requiere tres pasos:
fr: Créons maintenant un module avec une procédure pour effectuer la substitution. Cela nécessite trois étapes :
in: अब हम प्रतिस्थापन करने की प्रक्रिया के साथ एक मॉड्यूल बनाते हैं। इसके लिए तीन चरणों की आवश्यकता होती है:
ja: 差し替えを実行する手続をもつモジュールを作成します．これには，三つの段階が必要です．
nl: Nu maken we een module met een procedure, die de substitutie uitvoert. Dit vergt drie stappen:
pt: Agora, criaremos o modulo com um procedimento para realizar a substituição. Isso requer três passos:
zh_cn: 现在，我们创建一个模块，其中包含执行替换的过程。它需要三个步骤：

source: reading a whole line from one unit
de: eine ganze Zeile von einer Adresse lesen
es: leer una línea completa desde la unidad uno
fr: lire une ligne complète sur une unité Fortran
in: एक इकाई से पूरी पंक्ति पढ़ना
ja: 一つの装置から1行を読み込み
nl: een hele regel uit een bestand lezen
pt: ler a linha inteira de uma unidade
zh_cn: 从文件通道读取整行；

source: replace the pattern in the string
de: ein Muster in einem String ersetzen
es: reemplazar el patrón en la cadena de caracteres
fr: remplacer le motif dans la chaîne
in: पैटर्न को स्ट्रिंग में बदलें
ja: 文字列内の特定のパターンを置き換え
nl: een patroon in een string vervangen
pt: substituir o padrão na cadeia
zh_cn: 替换字符串中的模式；

source: write the new string to an output
de: einen neuen String in der Ausgabe schreiben
es: escribir la nueva cadena de caracteres en un archivo de salida
fr: écrire la nouvelle chaîne sur une sortie
in: आउटपुट में नया स्ट्रिंग लिखें
ja: 出力に新しい文字列を書き出し
nl: een nieuwe string naar het uitvoerbestand schrijven
pt: escrever a nova cadeia numa saída
zh_cn: 将新字符串写进输出通道
