Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Design documents
de: Design Dokumente
es: Documentos de diseño
fr: Documents de conception
in: डिजाइन दस्तावेज
ja: 設計文書
nl: Ontwerpdocumenten
pt: Documentos de design
zh_cn: 设计文档

source: This section contains the resources around the design of the Fortran Package Manager (fpm).
de: Dieser Abschnitt enthält die Ressourcen rund um den Aufbau des Fortran-Paketmanagers (fpm).
es: Esta sección contiene los recursos relacionados con el diseño del Administrador de paquetes de Fortran (fpm).
fr: Cette section contient les ressources relatives à la conception du Gestionnaire de paquets Fortran fpm.
in: इस अनुभाग में फोरट्रान पैकेज प्रबंधक (एफपीएम) के डिज़ाइन से संबंधित संसाधन शामिल हैं।
ja: ここには，Fortranパッケージマネージャ（fpm）の設計に関する情報が掲載されています．
nl: Dit onderdeel bevat informatie over de opzet van de Fortran-packagemanager (fpm)
pt: Esta seção contém recursos sobre a concepção do Gerenciador de Pacotes Fortran (fpm).
zh_cn: 本节包含有关Fortran包管理器（fpm）设计的资源。

source: Fortran Package Manager (fpm) is a package manager and build system for Fortran. Its key goal is to improve the user experience of Fortran programmers. It does so by making it easier to build your Fortran program or library, run the executables, tests, and examples, and distribute it as a dependency to other Fortran projects. Fpm's user interface is modeled after [Rust's Cargo](https://doc.rust-lang.org/cargo/). Its long term vision is to nurture and grow the ecosystem of modern Fortran applications and libraries.
de: Fortran Package Manager (fpm) ist ein Paketmanager und Buildsystem für Fortran, mit dem Hauptziel die Benutzererfahrung von Fortran-Programmier*innen zu verbessern. Dies wird durch das einfachere Erstellung von Fortran-Programmen oder Fortran-Bibliotheken, Ausführung von Anwendungen und Beispielen und die Verbreitung von Abhängigkeiten zu anderen Fortran-Projekten ermöglicht. Fpm's Benutzeroberfläche ist modelliert nach [Rust's Cargo](https://doc.rust-lang.org/cargo/). Die langfristige Vision ist es, die ein Ökosystem von modernen Fortran-Anwendungen und Bibliotheken zu entwickeln.
es: Fortran Package Manager (fpm) es un administrador de paquetes y sistema de construcción para Fortran. Su objetivo principal es mejorar la experiencia de usuario de los programadores de Fortran. Lo hace facilitando la construcción de su programa o biblioteca en Fortran, corriendo ejecutables, pruebas y ejemplos, y distribuyendo estos como una dependencia de otros proyectos en Fortran. La interfaz de usuario de fpm es modelada después [Rust's Cargo](https://doc.rust-lang.org/cargo/). Su objetivo a largo plazo es nutrir y hacer crecer el ecosistema de aplicaciones y bibliotecas en Fortran moderno.
fr: Le gestionnaire de paquets Fortran fpm *(Fortran Package Manager)* est à la fois un gestionnaire de paquets et un système de construction de projet. Son objectif principal est d'améliorer l'expérience utilisateur des programmeurs Fortran. Il facilite la construction de votre programme ou de votre bibliothèque Fortran, l'exécution des exécutables, des tests et des exemples, et la distribution en tant que dépendance à d'autres projets Fortran. L'interface utilisateur de fpm s'inspire de [Cargo](https://doc.rust-lang.org/cargo/), le gestionnaire de paquets de Rust. L'objectif à long terme est de favoriser et développer l'écosystème des applications et bibliothèques écrites en Fortran moderne.
in: फोरट्रान पैकेज मैनेजर (एफपीएम) फोरट्रान के लिए एक पैकेज प्रबंधक और बिल्ड सिस्टम है। इसका मुख्य लक्ष्य फोरट्रान प्रोग्रामर के उपयोगकर्ता अनुभव को बेहतर बनाना है। यह आपके फोरट्रान प्रोग्राम या लाइब्रेरी को बनाने, निष्पादन योग्य, परीक्षण और उदाहरण चलाने और इसे अन्य फोरट्रान परियोजनाओं के लिए निर्भरता के रूप में वितरित करना आसान बनाकर ऐसा करता है। एफपीएम का यूजर इंटरफेस [रस्ट कार्गो](https://doc.rust-lang.org/cargo/) पर आधारित है| इसकी दीर्घकालिक दृष्टि आधुनिक फोरट्रान अनुप्रयोगों और लाइब्रेरीयों के पारिस्थितिकी तंत्र का देखभाल और विकास करना है।
ja: Fortranパッケージマネージャ（fpm）は，Fortran用のパッケージ管理およびビルドシステムです．その主要な目標は，Fortranプログラマのユーザ体験を改善することです．Fortranプログラムおよびライブラリのビルド，実行ファイル・テスト・サンプルプログラムの実行，他のFortranプロジェクトの依存関係としての配布を容易にすることで，使用感の改善を実現します．Fpmのユーザインタフェースは，[RustのCargo](https://doc.rust-lang.org/cargo/)を参考にしています．Fpmの長期的な展望は，現代的なFortranのアプリケーションおよびライブラリのエコシステムを涵養し，成長させることです．
nl: Fortran Package Manager (fpm) is een packagemanager en buildsysteem voor Fortran, met als hoofddoel het gebruiksgemak voor programmeurs te verbeteren. Het maakt het makkelijker om een Fortran-programma of -bibliotheek te bouwen, de executables (testen en voorbeelden) te draaien en om de software te verspreiden en in andere projecten te gebruiken. De interface van fpm is gebaseerd op [Rust's Cargo](https://doc.rust-lang.org/cargo/). De lange-termijn doelen zijn om een vruchtbaar ecosysteem te ontwikkelen voor moderne Fortran-toepassingen en bibliotheken.
pt: Gerenciador de Pacotes Fortran (fpm) é um gerenciador de pacotes e sistema de compilação para o Fortran. Seu objetivo principal é melhorar a experiência de usuário aos programadores Fortran, tornando mais fácil compilar seus programas ou bibliotecas, rodar executáveis, testes e exemplos, além de facilitar a distribuição como dependência em outros projetos escritos em Fortran. A interface de usuário do fpm foi moldada no gerenciador do Rust, [Cargo](https://doc.rust-lang.org/cargo/). Sua visão a longo prazo é nutrir e desenvolver o ecossistema de aplicações e bibliotecas em Fortran moderno.
zh_cn: Fortran Package Manager（fpm）是Fortran的包管理器和构建系统。它的主要目标是改善Fortran程序员的用户体验。它通过使构建Fortran程序或函数库，运行可执行文件、测试和示例以及将其作为依赖项分发到其它Fortran项目变得更加容易来实现这一目标。fpm的用户界面以[Rust的Cargo](https://doc.rust-lang.org/cargo/)为蓝本，其长期愿景是培育和发展现代Fortran应用程序和库的生态系统。

source: The fpm logo
de: Das fpm Logo
es: Logotipo de fpm
fr: Le logo fpm
in: एफपीएम का प्रतीक चिन्ह
pt: O logotipo do fpm
zh_cn: fpm 徽标

source: The fpm logo was developed by the Fortran community in [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) and contributed by [@1984logo](https://github.com/1984logo).
de: Das fpm-Logo wurde von der Fortran-Gemeinschaft in [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) entwickelt und von [@1984logo](https://github.com/1984logo) beigesteuert.
es: El logotipo de fpm fué desarrollado por la comunidad de Fortran en [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) y aportado por [@1984logo](https://github.com/1984logo).
fr: Le logo fpm a été discuté par la communauté Fortran dans [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) et réalisé par [@1984logo](https://github.com/1984logo).
in: एफपीएम लोगो को [एफपीएम#380](https://github.com/fortran-lang/fpm/discussions/380) में फोर्ट्रान समुदाय द्वारा विकसित किया गया था और [@1984logo](https://github.com/1984logo)द्वारा योगदान दिया गया था|
pt: A logo do fpm foi desenvolvida pela comunidade Fortran na issue [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) com a ajuda de [@1984logo](https://github.com/1984logo).
zh_cn: fpm 徽标由 Fortran 社区在 [fpm#380](https://github.com/fortran-lang/fpm/discussions/380) 开发并由 [@1984logo](https://github.com/1984logo) 贡献。

source: The logo for the Fortran package manager (fpm) represents a gift box with a bow forming the letter F. For the monochromatic version the color of the Fortran logo {bdg-primary-line}`#734f96` is used. The color version additionally uses lighter and darker variants of the base color. While both variants are supposed to be visible on dark background, the logo can be produced in light color or as outline to be better visible when used on dark or black backgrounds.
de: Das Logo für den Fortran-Paketmanager (fpm) stellt eine Geschenkverpackung mit einer Schleife dar, die den Buchstaben F bildet. Für die einfarbige Version wird die Farbe des Fortran-Logos {bdg-primary-line}`#734f96` verwendet. Die Farbversion verwendet zusätzlich hellere und dunklere Varianten der Grundfarbe. Während beide Varianten auf dunklem Hintergrund sichtbar sein sollen, kann das Logo in heller Farbe oder als Umriss erzeugt werden, um auf dunklem oder schwarzem Hintergrund besser sichtbar zu sein.
es: El logotipo del Administrador de paquetes de Fortran (fpm) representa una caja de regalo con un lazo formando la letra F. Para la versión monocromática del logotipo de Fortran es usado el color {bdg-primary-line}`#734f96`.La versión en color utiliza además variantes más claras y más oscuras del color base. Si bien se supone que ambas variantes son visibles sobre un fondo oscuro, el logotipo se puede producir en color claro o como un contorno para que sea mejor visible cuando se usa sobre fondos oscuros o negros.
fr: Le logo du gestionnaire de paquets Fortran (fpm) représente une boîte de cadeau avec un nœud formant la lettre F. Pour la version monochromatique, la couleur du logo Fortran {bdg-primary-line}`#734f96` est utilisée. La version en couleur utilise en plus des variantes plus claires et plus foncées de la couleur de base. Bien que les deux variantes soient censées être visibles sur un fond sombre, le logo peut être produit en couleur claire ou en contour pour être mieux visible lorsqu'il est utilisé sur des fonds sombres ou noirs.
in: फोरट्रान पैकेज प्रबंधक (एफपीएम) के लिए लोगो एक उपहार बॉक्स का प्रतिनिधित्व करता है जिसमें एक धनुष F अक्षर बनाता है। मोनोक्रोमैटिक संस्करण के लिए Fortran लोगो {bdg-primary-line}'#734f96' के रंग का उपयोग किया जाता है। कलर वर्जन में बेस कलर के लाइटर और डार्क वेरिएंट का भी इस्तेमाल किया गया है। जबकि दोनों वेरिएंट को अंधेरे पृष्ठभूमि पर दिखाई देने वाला माना जाता है, लोगो को हल्के रंग में या गहरे या काले पृष्ठभूमि पर उपयोग किए जाने पर बेहतर दृश्यमान होने के लिए रूपरेखा के रूप में उत्पादित किया जा सकता है।
pt: A logo para o Gerenciador de Pacotes Fortran (fpm) representa uma caixa de presentes com seu laço formando a letra F. Para a versão monocromática da logo, a cor {bdg-primary-line}`#734f96` é usada. A versão colorida possui duas variantes da cor principal, uma mais escura e outra mais clara. Apesar de ambas as variantes serem visíveis em um fundo escuro, a logo pode ser produzida em cores claras ou como um contorno para ser mais legível quando usada em fundos escuros ou pretos.
zh_cn: Fortran 包管理器 (fpm) 的徽标代表一个带有蝴蝶结的礼品盒，形成字母 F。对于单色版本，使用 Fortran 徽标 {bdg-primary-line}`#734f96` 的颜色。颜色版本还使用基色的较浅和较深的变体。虽然这两种变体都应该在深色背景下可见，但徽标可以以浅色或轮廓制作，以便在深色或黑色背景上使用时更容易看到。

source: How-To guides
de: Anleitungen
es: Guías prácticas
fr: Guides pratiques
in: गाइड
ja: 利用方法
nl: Handleidingen: how-to
pt: Guias práticos
zh_cn: 操作指南

source: This section contains practical guides and recipes for solving specific problems with fpm.
de: Dieser Abschnitt enthält praktische Anleitungen und Rezepte für die Lösung spezifischer Probleme mit fpm.
es: Esta sección contiene guías prácticas y recetas para resolver problemas específicos con fpm.
fr: Cette section contient des guides pratiques et des recettes pour résoudre des problèmes spécifiques concernant fpm.
in: इस खंड में एफपीएम के साथ विशिष्ट समस्याओं को हल करने के लिए व्यावहारिक गाइड और नुस्खा शामिल हैं।
ja: ここには，fpmを用いて具体的な問題を解決する実践的な方法や秘訣が掲載されています．
nl: Dit onderdeel bevat enkele praktische handleidingen en recepten voor het oplossen van specifieke problemen met fpm
pt: Esta seção contém guias práticos e roteiros para resolver problemas específicos com o fpm.
zh_cn: 本节包含解决fpm特定问题的实用指南和步骤。

source: Installation
fr: Installer fpm
in: संस्थापन
pt: Instalação
zh_cn: 安装

source: Tutorial
fr: Tutoriels
in: शैक्षणिक
ja: 実践手引
zh_cn: 教程

source: How-To
de: Anleitungen
es: Cómo
fr: Guides pratiques
in: विधियाँ
ja: 利用方法
pt: Guias Práticos
zh_cn: 操作指南

source: Reference
de: Referenz
es: Referencia
fr: Manuel de référence
in: संदर्भ
ja: 参考資料
nl: Referentie
pt: Referência
zh_cn: 参考

source: Design
es: Diseño
fr: Comprendre fpm
in: डिज़ाइन
ja: 設計文書
nl: Ontwerp
zh_cn: 设计文档

source: Registry
de: Register
es: Registro
fr: Catalogue de paquets fpm
in: रजिस्ट्री
ja: レジストリ
pt: Registro
zh_cn: 注册

source: Fortran Package Manager
de: Fortran-Paketmanager (fpm)
es: Administrador de paquetes de Fortran
fr: Gestionnaire de paquets Fortran
in: फोरट्रान पैकेज प्रबंधक
ja: Fortranパッケージマネージャ
pt: Gerenciador de Pacotes Fortran
zh_cn: Fortran 包管理器

source: Package manager and build system for Fortran
de: Paketmanager und Build-System für Fortran
es: Administrador de paquetes y sistema de construcción para Fortran
fr: Gestionnaire de paquets et système de construction pour le langage Fortran
in: फोरट्रान के लिए एक पैकेज प्रबंधक और बिल्ड सिस्टम
ja: Fortranのパッケージ管理およびビルドシステム
nl: Packagemanager en buildsysteem voor Fortran
pt: Gerenciador de pacotes e sistema de compilação para o Fortran
zh_cn: Fortran 的包管理器与构建系统

source: Welcome to the documentation for the Fortran Package Manager (fpm).
de: Willkommen bei der Dokumentation des Fortran-Paketmanagers (fpm).
es: Bienvenido a la documentación del Administrador de paquetes de Fortran (fpm).
fr: Bienvenue dans la documentation du gestionnaire de paquets Fortran fpm.
in: फोरट्रान पैकेज प्रबंधक (एफपीएम) के प्रलेखन में आपका स्वागत है
ja: Fortarnパッケージマネージャ（fpm）の解説へようこそ．
nl: Welkom, hier vind je documentatie over de Fortran-packagemanager (fpm).
pt: Bem-vindo(a) a documentação do Gerenciador de Pacotes Fortran (fpm).
zh_cn: 欢迎浏览 Fortran 包管理器（Fortran Package Manager）的文档。

source: These pages are currently under construction. Please help us improve them by contributing content or reporting issues.
de: Diese Seiten befinden sich derzeit im Aufbau. Beiträge und Rückmeldungen sind immer willkommen.
es: Estas páginas están actualmente en construcción. Por favor ayúdanos a mejorarla contribuyendo con contenido o reportando fallas.
fr: Ces pages sont en travaux. Aidez-nous à les améliorer en contribuant au contenu ou en rapportant des problèmes.
in: ये पृष्ठ अभी निर्माणाधीन हैं। कृपया सामग्री का योगदान देकर या मुद्दों की रिपोर्ट करके उन्हें बेहतर बनाने में हमारी मदद करें।
ja: これらの解説は現在執筆中です．内容の提供，問題の報告など，改善にご協力をお願いします．
nl: Deze pagina's zijn nog werk-in-uitvoering. Als je wilt helpen met de documentatie of het rapporteren van problemen, graag!
pt: Estas páginas se encontram atualmente em construção. Por favor nos ajude a melhorá-las contribuindo com conteúdo ou reportando problemas.
zh_cn: 此页面目前正在建设中，请帮助我们贡献内容或者反馈议题。

source: {octicon}`download` Install
fr: {octicon}`download` Installer
in: {ऑक्टिकॉन} `डाउनलोड` इंस्टॉल करें
pt: {octicon}`download` Instale
zh_cn: {octicon}`download` 安装

source: Instructions on how to install fpm across Windows, Linux, macOS and more.
es: Instrucciones para la instalación de fpm en Windows, Linux, MacOs y otros.
fr: Instructions pour l'installation de fpm sous Windows, Linux, macOS et autres.
in: विंडोज, लिनक्स, मैकओएस और अधिक में एफपीएम स्थापित करने के तरीके पर निर्देश।
pt: Instruções de como instalar o fpm no Windows, Linux, macOS e outros.
zh_cn: 关于如何在Windows、Linux、macOS和其他系统中安装fpm的说明。

source: Install fpm
fr: Installer fpm
in: इंस्टॉल एफपीएम
pt: Instale o fpm
zh_cn: 安装fpm

source: {octicon}`mortar-board` Tutorials
es: {octicon}`mortar-board` Tutoriales
fr: {octicon}`mortar-board` Tutoriels
in: {ऑक्टिकॉन} `मोर्टार-बोर्ड` अनुशिक्षण
ja: {octicon}`mortar-board` 実践手引
pt: {octicon}`mortar-board` Tutoriais
zh_cn: {octicon}`mortar-board` 教程

source: Learn about using fpm for Fortran development, creating projects and managing dependencies.
de: Lerne über die Verwendung von fpm zur Fortran-Entwicklung, die Erstellung von Projekten und die Verwaltung von Abhängigkeiten.
es: Aprenda a usar fpm para el desarrollo, creación de proyectos y administración de dependencias en Fortran.
fr: Apprenez à utiliser fpm pour développer en Fortran, créer des projets et gérer leurs dépendances.
in: फोरट्रान विकास के लिए एफपीएम का उपयोग करने, प्रोजेक्ट बनाने और निर्भरताओं को प्रबंधित करने के बारे में जानें।
ja: fpmを用いたFortran開発，プロジェクト作成，依存関係管理の学習
nl: Hoe gebruik je fpm voor het ontwikkelen van Fortran programma's, hoe zet je een project op en hoe zorg je voor alle afhankelijkheden?
pt: Aprenda como usar o fpm para o desenvolvimento Fortran, criar projetos e gerenciar dependências.
zh_cn: 学习如何使用 fpm 进行 Fortran 开发、创建项目和管理依赖项。

source: Browse tutorials
de: Tutorials durchstöbern
es: Explorar tutoriales
fr: Parcourir les tutoriels
in: अनुशिक्षण की खोज करें
pt: Explorar tutoriais
zh_cn: 浏览教程

source: {octicon}`book` How-To Guides
de: {octicon}`book` How-To Rezepte
es: {octicon}`book` Guías prácticas
fr: {octicon}`mortar-board` Guides pratiques
ja: {octicon}`book` 利用方法
nl: {octicon}`book` How-To Recepten
pt: {octicon}`book` Guias Práticos
zh_cn: {octicon}`book` 操作指南

source: Practical guides and recipes to solve specific problems with fpm
de: Praktische Anleitungen und Rezepte für die Lösung spezifischer Probleme mit fpm
es: Guías prácticas y recetas para resolver problemas específicos con fpm
fr: Guides pratiques et recettes pour résoudre des problèmes spécifiques avec fpm
in: एफपीएम के साथ विशिष्ट समस्याओं को हल करने के लिए व्यावहारिक गाइड और नुस्खा
ja: fpmを用いて具体的な問題を解決するための実践的な利用方法と秘訣
nl: Praktische handleiding en recepten om specifieke problemen met fpm op te lossen mit fpm
pt: Guias práticos e roteiros para resolver problemas específicos com o fpm
zh_cn: 使用 fpm 解决特定问题的实用指南和方案。

source: Browse recipes
de: Anleitungen durchstöbern
es: Explorar recetas
fr: Parcourir les recettes
in: नुश्खें की खोज करें
pt: Explorar roteiros
zh_cn: 浏览指南

source: {octicon}`gear` References
de: {octicon}`gear` Referenzen
es: {octicon}`gear` Referencias
fr: {octicon}`gear` Manuel de référence
in: {ऑक्टिकॉन} 'गियर' संदर्भ
ja: {octicon}`gear` 参考資料
nl: {octicon}`gear` Referenties
pt: {octicon}`gear` Referências
zh_cn: {octicon}`gear` 参考

source: Specifications of fpm components and implementation references
de: Spezifikationen der fpm Komponenten und Referenzen für die Implementierung
es: Especificación de componentes de fpm y referencias de implementación
fr: Spécifications de fpm et manuel de référence
in: एफपीएम घटकों और कार्यान्वयन संदर्भों के विनिर्देश
ja: fpmの仕様と実装情報
nl: Specificatie van fpm componenten en referenties voor de implementatie
pt: Especificações de componentes do fpm e referência de implementação
zh_cn: fpm 组件的规范和实现参考。

source: Browse references
de: Referenzen durchstöbern
es: Explorar referencias
fr: Parcourir les références
in: संदर्भों की खोज करें
pt: Explorar referências
zh_cn: 浏览参考

source: {fa}`cubes` Registry
de: {fa}`cubes` Register
es: {fa}`cubes` Registro
fr: {fa}`cubes` Catalogue de paquets fpm
in: {एफए} `क्यूब्स` रजिस्ट्री
ja: {fa}`cubes` レジストリ
nl: {fa}`cubes` Catalogus van pakketten voor fpm
pt: {fa}`cubes` Registro
zh_cn: {fa}`cubes` 注册表

source: There are already many packages available for use with fpm, providing an easily accessible and rich ecosystem of general purpose and high-performance code. For a full list of packages checkout the [fpm registry](registry/index). New packages can be submitted to the registry [here](https://github.com/fortran-lang/fpm-registry).
de: Es sind bereits viele Pakete für die Verwendung mit fpm verfügbar, die ein leicht zugängliches und reichhaltiges Ökosystem von Allzweck- und Hochleistungscode bieten. Eine vollständige Liste der Pakete befindet sich in der [fpm registry](registry/index). Neue Pakete können der Registry [hier](https://github.com/fortran-lang/fpm-registry) vorgelegt werden.
es: Ya hay muchos paquetes disponibles para usar con fpm, que proporcionan un ecosistema rico y fácilmente accesible de código de propósito general y alto desempeño. Para obtener una lista completa de los paquetes, consulte el [registro de fpm](https://fortran-lang.org/packages/fpm). Nuevos paquetes pueden ser enviados [Aquí](https://github.com/fortran-lang/fpm-registry).
fr: De nombreux paquets fpm sont déjà disponibles, fournissant un écosystème riche et facilement accessible de codes à usage général et pour le calcul haute performance. Pour une liste complète des paquets, consultez le [catalogue de paquets fpm](https://fortran-lang.org/packages/fpm). De nouveaux paquets peuvent être soumis [ici](https://github.com/fortran-lang/fpm-registry).
in: एफपीएम के साथ उपयोग के लिए पहले से ही कई पैकेज उपलब्ध हैं, जो सामान्य उद्देश्य और उच्च-प्रदर्शन कोड का एक आसानी से सुलभ और समृद्ध पारिस्थितिकी तंत्र प्रदान करते हैं। पैकेज की पूरी सूची के लिए [एफपीएम रजिस्ट्री](रजिस्ट्री/इंडेक्स) चेकआउट करें। रजिस्ट्री में [यहाँ](https://github.com/fortran-lang/fpm-registry) नए पैकेज सबमिट किए जा सकते हैं|
pt: Já existem muitos pacotes disponíveis para o uso junto ao fpm, proporcionando um fácil acesso a um rico ecossistema de propósito geral e códigos de alto desempenho. Para a lista de pacotes dê uma olhada no [registro fpm](https://fortran-lang.org/packages/fpm). Novos pacotes podem ser submetidos ao registro [aqui](https://github.com/fortran-lang/fpm-registry).
zh_cn: 已经有许多软件包可通过 fpm 使用，它们提供了易于获取且丰富的通用和高性能代码生态系统。有关软件包的完整列表，请查看[fpm注册表](https://fortran-lang.org/packages/fpm)。点击[此处](https://github.com/fortran-lang/fpm-registry)提交新软件包到注册表。

source: {fa}`newspaper` News
de: {fa}`newspaper` Aktuelles
es: {fa}`newspaper` Noticias
fr: {fa}`newspaper` Actualités
in: {fa}'समाचार पत्र' समाचार
ja: {fa}`newspaper` 新着情報
nl: {fa}`newspaper` Nieuws
pt: {fa}`newspaper` Notícias
zh_cn: {fa}`newspaper` 新闻

source: Recent events around the Fortran Package Manager, such as new releases, conference talks, and new packages will be announced here.
de: Neueste Ereignisse rund um den Fortran-Paketmanager, wie neue Releases, Konferenz Vorträge und neue Pakete werden hier angekündigt.
es: Eventos recientes sobre el Administrador de paquetes de Fortran, lanzamientos, conferencias y nuevos paquetes serán anunciados aquí.
fr: Vous trouverez ici les événements récents concernant le gestionnaire de paquets Fortran fpm, tels que des nouvelles, des conférences, et des annonces de nouveaux paquets.
in: Fortran पैकेज प्रबंधक के आसपास हाल की घटनाएं, जैसे कि नई रिलीज़, सम्मेलन वार्ता और नए पैकेज यहां घोषित किए जाएंगे।
ja: ここでは，新規リリース，学会発表，新しいパッケージなど，Fortranパッケージマネージャに関する最近の出来事を告知します．
nl: Recente gebeurtenissen betreffende de Fortran-packagemanager: aankondiging van nieuwe releases, bijdragen aan conferenties en nieuwe pakketten
pt: Eventos recentes sobre o Gerenciador de Pacotes Fortran, como novos lançamentos, palestras e novos pacotes serão anunciados aqui.
zh_cn: 近期围绕Fortran软件包管理器的活动，比如新版本发布、会议讨论和新软件包，将在这里宣布。

source: Installing fpm
de: Installation von fpm
es: Instalación de fpm
fr: Installer fpm
in: FPM स्थापित करना
ja: fpmのインストール
nl: Installeren van fpm
pt: Instalação do fpm
zh_cn: 安装fpm

source: This how-to guide covers the installation of the Fortran Package Manager (fpm) on various platforms.
de: Diese Anleitung erklärt die Installation vom Fortran-Paketmanager (fpm) auf verschiedenen Plattformen.
es: Esta guía práctica cubre la instalación del Administrador de paquetes de Fortran (fpm) en diversas plataformas.
fr: Ce guide pratique concerne l'installation du gestionnaire de paquets Fortran fpm sur diverses plates-formes.
in: यह कैसे-कैसे गाइड विभिन्न प्लेटफार्मों पर Fortran पैकेज मैनेजर (fpm) की स्थापना को कवर करता है।
ja: この利用方法では，様々なプラットフォームへのFortranパッケージマネージャ（fpm）のインストール方法を取り扱います．
nl: Deze handleiding beschrijft de installatie van de Fortran-packagemanager (fpm) op de diverse platforms.
pt: Este guia cobre a instalação do Gerenciador de Pacotes Fortran (fpm) em várias plataformas.
zh_cn: 本操作指南涵盖了在各种平台上安装Fortran包管理器（fpm）的过程。

source: {fab}`apple` {fab}`linux` {fab}`windows` Download binaries
de: {fab}`apple` {fab}`linux` {fab}`windows` Program herunterladen
es: {fab}`apple` {fab}`linux` {fab}`windows` Descargar binarios
fr: {fab}`apple` {fab}`linux` {fab}`windows` Télécharger les fichiers binaires
in: {fab}'apple' {fab}'linux' {fab}'windows' डाउनलोड बिनरी
ja: {fab}`apple` {fab}`linux` {fab}`windows` バイナリのダウンロード
nl: {fab}`apple` {fab}`linux` {fab}`windows` Download de programma's
pt: {fab}`apple` {fab}`linux` {fab}`windows` Baixar executáveis
zh_cn: {fab}`apple` {fab}`linux` {fab}`windows` 下载二进制文件
