Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: issue templates added to guide reporting of bugs, package issues, feature requests and specification proposals ([#558](https://github.com/fortran-lang/fpm/pull/558))
es: Se agregaron plantillas de problemas para guiar el informe de errores, problemas de paquetes, solicitudes de funciones y propuestas de especificaciones ([#558](https://github.com/fortran-lang/fpm/pull/558))
fr: ajout de modèles pour guider le signalement des bogues et des problèmes de paquets, les demandes de fonctionnalités et les propositions de spécifications ([#558](https://github.com/fortran-lang/fpm/pull/558))
in: समस्या टेम्प्लेट बग्स, पैकेज मुद्दों, फीचर की रिपोर्टिंग गाइड करने के लिए जोड़ा गयाअनुरोध और विनिर्देश प्रस्ताव ([#558](https://github.com/fortran-lang/fpm/pull/558))
nl: templates voor het beschrijven van fouten, problemen met pakketten, verzoeken om nieuwe functies en voorstellen voor specificaties ([#558](https://github.com/fortran-lang/fpm/pull/558))
pt: modelos de issue adicionados para guiar o relato de falhas, problemas com pacotes, requisição de recursos e propostas de especificação ([#558](https://github.com/fortran-lang/fpm/pull/558))
zh_cn: 添加问题模板以指导报告错误、包问题、功能请求和规范建议 ([#558](https://github.com/fortran-lang/fpm/pull/558))

source: default branch renamed to *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))
es: rama predeterminada renombrada a *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))
fr: branche par défaut renommée *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))
in: डिफ़ॉल्ट शाखा का नाम बदलकर *मुख्य* ([#565](https://github.com/fortran-lang/fpm/pull/565))
nl: hoofdtak hernoemd tot *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))
pt: ramo principal renomeado para *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))
zh_cn: 默认分支重命名为 *main* ([#565](https://github.com/fortran-lang/fpm/pull/565))

source: update documentation on distributions supporting fpm, like spack and MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))
es: actualizar la documentación sobre distribuciones compatibles con fpm, como spack y MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))
fr: mise à jour de la documentation pour les distributions supportant fpm, comme spack et MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))
in: एफपीएम का समर्थन करने वाले वितरणों पर अद्यतन दस्तावेज, जैसे स्पैक और एमएसवाईएस 2([#562](https://github.com/fortran-lang/fpm/pull/562))
nl: documentatie bijgewerkt voor de distributiesystemen die fpm ondersteunen, zoals spack en MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))
pt: atualiza a documentação sobre distribuições que possuem suporte ao fpm, como spack e o MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))
zh_cn: 更新支持 fpm 的发行版的文档，例如 spack 和 MSYS2 ([#562](https://github.com/fortran-lang/fpm/pull/562))

source: new workflow to automatically generate single source fpm versions ([#563](https://github.com/fortran-lang/fpm/pull/563))
es: nuevo flujo de trabajo para generar automáticamente versiones de fpm de fuente única ([#563](https://github.com/fortran-lang/fpm/pull/563))
fr: nouveau flux de travail pour générer automatiquement les versions de fpm en fichier unique ([#563](https://github.com/fortran-lang/fpm/pull/563))
in: एकल स्रोत एफपीएम संस्करण स्वचालित रूप से उत्पन्न करने के लिए नया कार्यप्रवाह([#563](https://github.com/fortran-lang/fpm/pull/563))
nl: nieuwe workflow voor automatisch genereren van de single-source versies van fpm ([#563](https://github.com/fortran-lang/fpm/pull/563))
pt: novo workflow para automaticamente gerar as versões de código-fonte único do fpm ([#563](https://github.com/fortran-lang/fpm/pull/563))
zh_cn: 自动生成单源文件 fpm 版本的新工作流程 ([#563](https://github.com/fortran-lang/fpm/pull/563))

source: continuous delivery of current fpm git source implemented ([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))
es: entrega continua de la fuente actual de fpm git implementada ([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))
fr: livraison continue des sources git du fpm courant ([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))
in: वर्तमान एफपीएम गिट स्रोत की निरंतर डिलीवरी लागू([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))
pt: entrega contínua do código-fonte disponível atualmente no git ([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))
zh_cn: 实现了当前 fpm git 源的持续交付 ([#569](https://github.com/fortran-lang/fpm/pull/569), [#564](https://github.com/fortran-lang/fpm/pull/564))

source: update of bootstrapping instructions ([#587](https://github.com/fortran-lang/fpm/pull/587))
es: actualización de las instrucciones de arranque ([#587](https://github.com/fortran-lang/fpm/pull/587))
fr: mise à jour des instructions d'amorçage ([#587](https://github.com/fortran-lang/fpm/pull/587))
in: बूटस्ट्रैपिंग निर्देशों का अद्यतन ([#587](https://github.com/fortran-lang/fpm/pull/587))
nl: instructie voor initiële bouw (bootstrap) bijgewerkt ([#587](https://github.com/fortran-lang/fpm/pull/587))
pt: atualização de versão nas instruções de como compilar o fpm sem usar o fpm ([#587](https://github.com/fortran-lang/fpm/pull/587))
zh_cn: 更新引导指令 ([#587](https://github.com/fortran-lang/fpm/pull/587))

source: update README.md compiler, archiver, & link flags ([#598](https://github.com/fortran-lang/fpm/pull/598))
es: actualizar el compilador README.md, el archivador & las banderas de enlace ([#598](https://github.com/fortran-lang/fpm/pull/598))
fr: mise à jour du README.md avec les drapeaux pour le compilateur, l'archiveur et l'éditeur de liens ([#598](https://github.com/fortran-lang/fpm/pull/598))
in: README.md कंपाइलर, आर्काइवर और लिंक फ्लैग को अपडेट करें ([#598](https://github.com/fortran-lang/fpm/pull/598))
nl: bestand README.md bjigewerkt met de opties voor de compiler, archiver en linker ([#598](https://github.com/fortran-lang/fpm/pull/598))
pt: atualização do arquivo README.md compiladores, archiver e link flags ([#598](https://github.com/fortran-lang/fpm/pull/598))
zh_cn: 更新 README.md 编译器、归档器和链接标志 ([#598](https://github.com/fortran-lang/fpm/pull/598))

source: Feedback
es: Retroalimentación
fr: Annonces
in: प्रतिक्रिया
nl: Aankondigingen
pt: Retorno
zh_cn: 反馈

source: [Discourse thread](https://fortran-lang.discourse.group/t/2314)
es: [Hilo de discurso](https://fortran-lang.discourse.group/t/2314)
fr: [Message sur le Discourse](https://fortran-lang.discourse.group/t/2314)
in: [प्रवचन सूत्र](https://fortran-lang.discourse.group/t/2314)
nl: [Discussie op Discourse](https://fortran-lang.discourse.group/t/2314)
pt: [Discussão no Discourse](https://fortran-lang.discourse.group/t/2314)
zh_cn: [论坛主题帖](https://fortran-lang.discourse.group/t/2314)

source: [Twitter post](https://twitter.com/fortranlang/status/1462506491752161286)
es: [Publicación de Twitter](https://twitter.com/fortranlang/status/1462506491752161286)
fr: [Message Twitter](https://twitter.com/fortranlang/status/1462506491752161286)
in: [ट्विटर पोस्ट](https://twitter.com/fortranlang/status/1462506491752161286)
pt: [Post no Twitter](https://twitter.com/fortranlang/status/1462506491752161286)
zh_cn: [推特帖子](https://twitter.com/fortranlang/status/1462506491752161286)

source: Fpm version 0.6.0 released
es: Fpm version 0.6.0 lanzada
fr: Fpm 0.6.0 est sorti
in: एफपीएम संस्करण 0.6.0 जारी
pt: Lançada a versão 0.6.0 do fpm
zh_cn: Fpm 0.6.0 版本发布

source: This release introduces a better visualization for the build output, compiler output is only shown on error to keep the standard output clean for successful builds. Furthermore, fpm can now detect unused modules and avoids compiling modules that are not needed for an application, which improves the compilation speed with large dependencies like stdlib. When creating a new project with fpm the author information are now taken from the git configuration to avoid using placeholders in the manifest. Several more bug fixes and plenty of improvements went into this version as well.
es: Esta versión presenta una mejor visualización para la salida de compilación, la salida del compilador solo se muestra en caso de error para mantener limpia la salida estándar para compilaciones exitosas. Además, fpm ahora puede detectar módulos no utilizados y evita compilar módulos que no son necesarios para una aplicación, lo que mejora la velocidad de compilación con grandes dependencias como stdlib. Al crear un nuevo proyecto con fpm, la información del autor ahora se toma de la configuración de git para evitar el uso de marcadores de posición en el manifiesto. También se incluyeron varias correcciones de errores y muchas mejoras en esta versión.
fr: Cette version améliore la présentation des messages de fpm, la sortie du compilateur n'est affichée qu'en cas d'erreur afin de garder la sortie standard propre pour les compilations réussies. De plus, fpm peut maintenant détecter les modules inutilisés et évite de compiler les modules qui ne sont pas nécessaires à une application, ce qui améliore la vitesse de compilation des projets ayant des dépendances importantes comme stdlib. Lors de la création d'un nouveau projet avec fpm, les informations relatives à l'auteur sont désormais extraites de la configuration de git afin d'éviter l'utilisation de chaînes vides dans le manifeste. Plusieurs autres corrections de bogues et de nombreuses améliorations ont également été apportées à cette version.
in: यह रिलीज़ बिल्ड आउटपुट के लिए एक बेहतर विज़ुअलाइज़ेशन का परिचय देती है, कंपाइलर आउटपुट केवल सफल बिल्ड के लिए मानक आउटपुट को साफ रखने के लिए त्रुटि पर दिखाया जाता है। इसके अलावा, एफपीएम अब अप्रयुक्त मॉड्यूल का पता लगा सकता है और उन मॉड्यूल को संकलित करने से बचता है जो एक एप्लिकेशन के लिए आवश्यक नहीं हैं, जो स्टैडलिब जैसी बड़ी निर्भरताओं के साथ संकलन गति में सुधार करता है। एफपीएम के साथ एक नई परियोजना बनाते समय लेखक की जानकारी अब मैनिफेस्ट में प्लेसहोल्डर्स का उपयोग करने से बचने के लिए गिट कॉन्फ़िगरेशन से ली जाती है। कई और बग फिक्स और बहुत सारे सुधार इस संस्करण में भी गए।
pt: Esta versão introduz uma visualização melhor para a saída da compilação, que só é mostrada quando há erros, de modo a manter a saída limpa para compilações de sucesso. Além disso, fpm agora pode detectar módulos não usados e evitar a compilação daqueles que não são necessários para a aplicação, o que melhora a velocidade em dependências grandes como a stdlib. Ao criar um novo projeto com o fpm, as informações de autoria são tiradas da configuração do git o que evita o uso de valores padrão no manifesto. Várias outras correções e melhorias foram também introduzidas nesta versão.
zh_cn: 此版本为构建输出引入了更好的可视化，编译器输出仅在错误时显示，以保持成功构建时标准输出的干净。此外，fpm 现在可以检测未使用的模块并避免编译使用程序不需要的模块，从而提高了 stdlib 等具有大型依赖项目的编译速度。使用 fpm 创建新项目时，作者信息现在从 git 配置中获取，以避免在清单中使用占位符。此版本还进行了更多错误修复和大量改进。

source: Find the full release notes [here](https://github.com/fortran-lang/fpm/releases/tag/v0.6.0).
es: Encuentre las notas completas de lanzamiento [Aquí](https://github.com/fortran-lang/fpm/releases/tag/v0.6.0).
fr: Accédez aux notes de version complètes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.6.0).
in: पूर्ण रिलीज़ नोट्स [यहां] प्राप्त करें (https://github.com/fortran-लैंग/एफपीएम/रिलीज़/टैग/v0.6.0)।
pt: Encontre as notas de lançamento completas [aqui](https://github.com/fortran-lang/fpm/releases/tag/v0.6.0).
zh_cn: 在 [此处](https://github.com/fortran-lang/fpm/releases/tag/v0.6.0) 找到完整的发行说明。

source: Many thanks to Pedro Costa ([@p-costa](https://github.com/p-costa)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Laurence Kedward ([@lkedward](https://github.com/lkedward)), Wileam Y. Phan ([@wyphan](https://github.com/wyphan)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)), Simon Rowe ([@wiremoons](https://github.com/wiremoons)), Andre Smit ([@freevryheid](https://github.com/freevryheid)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), [@st-maxwell](https://github.com/st-maxwell), and [@noisegul](https://github.com/noisegul) for contributing patches to this release.
es: Muchas gracias a Pedro Costa ([@p-costa](https://github.com/p-costa)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Laurence Kedward ([@lkedward](https://github.com/lkedward)), Wileam Y. Phan ([@wyphan](https://github.com/wyphan)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)), Simon Rowe ([@wiremoons](https://github.com/wiremoons)), Andre Smit ([@freevryheid](https://github.com/freevryheid)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), [@st-maxwell](https://github.com/st-maxwell), y [@noisegul](https://github.com/noisegul) por aportar parches a esta versión.
fr: Merci à Pedro Costa ([@p-costa](https://github.com/p-costa)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Laurence Kedward ([@lkedward](https://github.com/lkedward)), Wileam Y. Phan ([@wyphan](https://github.com/wyphan)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)), Simon Rowe ([@wiremoons](https://github.com/wiremoons)), Andre Smit ([@freevryheid](https://github.com/freevryheid)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), [@st-maxwell](https://github.com/st-maxwell), et [@noisegul](https://github.com/noisegul) pour avoir contribué aux correctifs de cette version.
in: पेड्रो कोस्टा ([@p-costa](https://github.com/p-costa)) को बहुत धन्यवाद, सेबस्टियन एहलर्ट [[@awvwgk](https://github.com/awvwgk)), लॉरेंस केडवर्ड ([@lkedward](https://github.com/lkedward)), विलेम वाई. फान ([@wyphan](https://github.com/wyphan)), आरतीव रैना ([@arteevraina](https://github.com/arteevraina)), साइमन रोवे ([@wiremoons](https://github.com/wiremoons)), आंद्रे स्मिट ([@freevryheid](https://github.com/freevryheid)), जॉन अर्बन ([@urbanjost](https://github.com/urbanjost)), ज़ूओ झिहुआ ([@zoziha](https://github.com/zoziha)), [@st-maxwell](https://github.com/st-मैक्सवेल), और [@noisegul](https://github.com/noisegul) योगदान के लिए इस रिलीज के लिए पैच।
pt: Agradecimentos a Pedro Costa ([@p-costa](https://github.com/p-costa)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Laurence Kedward ([@lkedward](https://github.com/lkedward)), Wileam Y. Phan ([@wyphan](https://github.com/wyphan)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)), Simon Rowe ([@wiremoons](https://github.com/wiremoons)), Andre Smit ([@freevryheid](https://github.com/freevryheid)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), [@st-maxwell](https://github.com/st-maxwell) e [@noisegul](https://github.com/noisegul) por contribuírem no lançamento desta versão.
zh_cn: 非常感谢 Pedro Costa ([@p-costa](https://github.com/p-costa))、Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk))、Laurence Kedward ( [@lkedward](https://github.com/lkedward))、Wileam Y. Phan ([@wyphan](https://github.com/wyphan))、Arteev Raina ([@arteevraina](https:///github.com/arteevraina))、Simon Rowe ([@wiremoons](https://github.com/wiremoons))、Andre Smit ([@freevryheid](https://github.com/freevryheid))、John Urban([@urbanjost](https://github.com/urbanjost))、左志华([@zoziha](https://github.com/zoziha))、[@st-maxwell](https://github.com/st-maxwell) 和 [@noisegul](https://github.com/noisegul) 为本版本提供补丁。

source: Changelog
es: Registro de cambios
fr: Modifications
in: चेंजलॉग
pt: Registro de mudanças
zh_cn: 变更日志

source: Better extraction of the Fortran compiler from the MPI wrapper ([#634](https://github.com/fortran-lang/fpm/pull/634))
es: Mejor extracción del compilador Fortran del contenedor MPI ([#634](https://github.com/fortran-lang/fpm/pull/634))
fr: Meilleure extraction du compilateur Fortran du wrapper MPI ([#634](https://github.com/fortran-lang/fpm/pull/634))
in: एमपीआई रैपर से फोरट्रान कंपाइलर का बेहतर निष्कर्षण([#634](https://github.com/fortran-lang/fpm/pull/634))
pt: melhor extração do compilador Fortran a partir do wrapper MPI ([#634](https://github.com/fortran-lang/fpm/pull/634))
zh_cn: 从 MPI 包装器中更好地提取 Fortran 编译器 ([#634](https://github.com/fortran-lang/fpm/pull/634))

source: Update module output directory command for flang-new/f18 ([#645](https://github.com/fortran-lang/fpm/pull/645))
es: Actualice el comando del directorio de salida del módulo para flang-new/f18 ([#645](https://github.com/fortran-lang/fpm/pull/645))
fr: Met à jour l'option concernant le sous-répertoire des modules pour flang-new/f18 ([#645](https://github.com/fortran-lang/fpm/pull/645))
in: flang-new/f18 के लिए मॉड्यूल आउटपुट डायरेक्टरी कमांड अपडेट करें([#645](https://github.com/fortran-lang/fpm/pull/645))
pt: Atualiza o comando do diretório de saída do módulo para o flang-new/f18 ([#645](https://github.com/fortran-lang/fpm/pull/645))
zh_cn: 更新 flang-new/f18 的module输出路径命令 ([#645](https://github.com/fortran-lang/fpm/pull/645))

source: Respect user provided main-files ([#646](https://github.com/fortran-lang/fpm/pull/646))
es: Respetar los archivos principales proporcionados por el usuario ([#646](https://github.com/fortran-lang/fpm/pull/646))
fr: Respecte les fichiers principaux indiqués par l'utilisateur ([#646](https://github.com/fortran-lang/fpm/pull/646))
in: सम्मान उपयोगकर्ता प्रदान की गई मुख्य फाइलें ([#646](https://github.com/fortran-लैंग/एफपीएम/पुल/646))
pt: Respeitar o nome dos ficheiros principais definido pelo usuário ([#646](https://github.com/fortran-lang/fpm/pull/646))
zh_cn: 尊重用户提供的主源文件（[#646](https://github.com/fortran-lang/fpm/pull/646)）

source: just allow . on new subcommand instead of changing canonical path ([#630](https://github.com/fortran-lang/fpm/pull/630))
es: solo permite en el nuevo subcomando en lugar de cambiar la ruta canónica ([#630](https://github.com/fortran-lang/fpm/pull/630))
fr: autorise simplement . pour fpm new au lieu de changer le chemin canonique ([#630](https://github.com/fortran-lang/fpm/pull/630))
in: बस अनुमति दें। कैनोनिकल पथ बदलने के बजाय नए उपकमांड पर ([#630](https://github.com/fortran-lang/fpm/pull/630))
pt: permite o uso de . nos subcomandos de fpm new em vez de ter que mudar o caminho ([#630](https://github.com/fortran-lang/fpm/pull/630))
zh_cn: 在 `new` 子命令允许 `.`，而不是更改规范路径 ([#630](https://github.com/fortran-lang/fpm/pull/630))

source: get user name and email using git config if available else use defaults ([#652](https://github.com/fortran-lang/fpm/pull/652))
es: obtenga el nombre de usuario y el correo electrónico usando git config si está disponible; de lo contrario, use los valores predeterminados ([#652](https://github.com/fortran-lang/fpm/pull/652))
fr: récupérer le nom d'utilisateur et l'email en utilisant la configuration git si disponible sinon utiliser les valeurs par défaut ([#652](https://github.com/fortran-lang/fpm/pull/652))
in: उपलब्ध होने पर git कॉन्फ़िग का उपयोग करके उपयोगकर्ता नाम और ईमेल प्राप्त करें ([#652](https://github.com/fortran-lang/fpm/pull/652))
pt: obtém o nome de usuário e email usando git config se disponível, caso contrário use o valores padrão ([#652](https://github.com/fortran-lang/fpm/pull/652))
zh_cn: 如果可用，使用 git config 获取用户名和电子邮件，否则使用默认值 ([#652](https://github.com/fortran-lang/fpm/pull/652))

source: Ignore hidden source files ([#654](https://github.com/fortran-lang/fpm/pull/654))
es: Ignorar archivos fuente ocultos ([#654](https://github.com/fortran-lang/fpm/pull/654))
fr: Ignorer les fichiers sources cachés ([#654](https://github.com/fortran-lang/fpm/pull/654))
in: छिपी हुई स्रोत फ़ाइलों को अनदेखा करें ([#654](https://github.com/fortran-lang/fpm/pull/654))
pt: Ignorar ficheiros ocultos ([#654](https://github.com/fortran-lang/fpm/pull/654))
zh_cn: 忽略隐藏的源文件 ([#654](https://github.com/fortran-lang/fpm/pull/654))

source: Cleanup the backend output ([#622](https://github.com/fortran-lang/fpm/pull/622))
es: Limpiar la salida del backend ([#622](https://github.com/fortran-lang/fpm/pull/622))
fr: Nettoyage de la sortie du backend ([#622](https://github.com/fortran-lang/fpm/pull/622))
in: बैकएंड आउटपुट को साफ करें ([#622](https://github.com/fortran-lang/fpm/pull/622))
pt: Limpa a saída de texto dos programas usados no backend ([#622](https://github.com/fortran-lang/fpm/pull/622))
zh_cn: 清理后端输出 ([#622](https://github.com/fortran-lang/fpm/pull/622))

source: Add note about relocation of manifest reference ([#648](https://github.com/fortran-lang/fpm/pull/648))
es: Agregar nota sobre la reubicación de la referencia del manifiesto ([#648](https://github.com/fortran-lang/fpm/pull/648))
fr: Ajout d'un commentaire sur le déplacement de la documentation du manifeste ([#648](https://github.com/fortran-lang/fpm/pull/648))
in: मेनिफेस्ट संदर्भ के स्थानांतरण के बारे में नोट जोड़ें ([#648](https://github.com/fortran-lang/fpm/pull/648))
pt: Adiciona uma nota a respeito da mudança de local do manual de referência do manifesto ([#648](https://github.com/fortran-lang/fpm/pull/648))
zh_cn: 添加有关清单引用重定位的注释（[#648](https://github.com/fortran-lang/fpm/pull/648)）

source: Fix for backtrace error when file not found in: `src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))
es: Corrección del error de rastreo cuando el archivo no se encuentra en: `src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))
fr: Correction d'une erreur de backtrace lorsqu'un fichier n'est pas trouvé par `src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))
in: फ़ाइल नहीं मिलने पर बैकट्रेस त्रुटि के लिए ठीक करें: `src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))
pt: Correção de erro quando o ficheiro não é encontrado em: `src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))
zh_cn: 修复在以下位置找不到文件时的回溯错误：`src/fpm_source_parsing.f90` ([#675](https://github.com/fortran-lang/fpm/pull/675))

source: Fix issue with backend pretty output ([#677](https://github.com/fortran-lang/fpm/pull/677))
es: Solucione el problema con la salida bonita del backend ([#677](https://github.com/fortran-lang/fpm/pull/677))
fr: Corrige un problème concernant l'affichage normal du backend ([#677](https://github.com/fortran-lang/fpm/pull/677))
in: बैकएंड सुंदर आउटपुट के साथ समस्या ठीक करें ([#677](https://github.com/fortran-lang/fpm/pull/677))
pt: Conserta problema com a saída embelezada do backend ([#677](https://github.com/fortran-lang/fpm/pull/677))
zh_cn: 修复后端漂亮输出的问题 ([#677](https://github.com/fortran-lang/fpm/pull/677))

source: fix: remove remove unnecessary space in fpm new cmd ([#684](https://github.com/fortran-lang/fpm/pull/684))
es: corrección: eliminar espacio innecesario en fpm nuevo cmd ([#684](https://github.com/fortran-lang/fpm/pull/684))
fr: correction : suppression des espaces inutiles dans la commande fpm new ([#684](https://github.com/fortran-lang/fpm/pull/684))
in: ठीक करें: fpm नए cmd में अनावश्यक स्थान हटाएं ([#684](https://github.com/fortran-lang/fpm/pull/684))
pt: correção: remove espaço desnecessário no comando fpm new ([#684](https://github.com/fortran-lang/fpm/pull/684))
zh_cn: 修复：删除 fpm new 命令中不必要的空格 ([#684](https://github.com/fortran-lang/fpm/pull/684))

source: Small fix for `fpm_model` ([#688](https://github.com/fortran-lang/fpm/pull/688))
es: Corrección mínima para `fpm_model` ([#688](https://github.com/fortran-lang/fpm/pull/688))
fr: Petit correctif pour `fpm_model` ([#688](https://github.com/fortran-lang/fpm/pull/688))
in: `Fpm_model` के लिए छोटा सुधार ([#688](https://github.com/fortran-lang/fpm/pull/688))
pt: Pequena correção para o `fpm_model` ([#688](https://github.com/fortran-lang/fpm/pull/688))
zh_cn: `fpm_model` 的小修复 ([#688](https://github.com/fortran-lang/fpm/pull/688))
