Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: add clean command ([#655](https://github.com/fortran-lang/fpm/pull/665))
es: agregar comando de limpieza ([#655](https://github.com/fortran-lang/fpm/pull/665))
fr: ajoute la commande clean ([#655](https://github.com/fortran-lang/fpm/pull/665))
in: क्लीन कमांड जोड़ें ([#655](https://github.com/fortran-lang/fpm/pull/665))
pt: adicionado comando clean ([#655](https://github.com/fortran-lang/fpm/pull/665))
zh_cn: 添加 `clean` 清理命令 ([#655](https://github.com/fortran-lang/fpm/pull/665))

source: Fix for non-portable GFortran `-J` flag in install script ([#692](https://github.com/fortran-lang/fpm/pull/692))
es: Corrección para el indicador GFortran `-J` no portátil en el script de instalación ([#692](https://github.com/fortran-lang/fpm/pull/692))
fr: Corrige l'option non portable GFortran `-J` dans le script d'installation ([#692](https://github.com/fortran-lang/fpm/pull/692))
in: स्थापित स्क्रिप्ट में गैर-पोर्टेबल GFortran '-J' ध्वज के लिए फिक्स करें ([#692] (https://github.com/fortran-lang/fpm/pull/692))
pt: Corrige flag `-J` não-portátil para o compilador GFortran no script de instalação ([#692](https://github.com/fortran-lang/fpm/pull/692))
zh_cn: 修复安装脚本中不可移植的 GFortran `-J` 选项 ([#692](https://github.com/fortran-lang/fpm/pull/692))

source: Fix show-model option ([#693](https://github.com/fortran-lang/fpm/pull/693))
es: Corregir la opción show-model ([#693](https://github.com/fortran-lang/fpm/pull/693))
fr: Corrige l'option show-model ([#693](https://github.com/fortran-lang/fpm/pull/693))
in: फिक्स शो-मॉडल विकल्प ([#693](https://github.com/fortran-lang/fpm/pull/693))
pt: Correção da opção show-model ([#693](https://github.com/fortran-lang/fpm/pull/693))
zh_cn: 修复 show-model 选项 ([#693](https://github.com/fortran-lang/fpm/pull/693))

source: Tree shaking for modules ([#676](https://github.com/fortran-lang/fpm/pull/676))
es: Optimización para módulos ([#676](https://github.com/fortran-lang/fpm/pull/676))
fr: Suppression du code mort dans les modules ([#676](https://github.com/fortran-lang/fpm/pull/676))
in: मॉड्यूल के लिए पेड़ हिलाना ([#676] (https://github.com/fortran-lang/fpm/pull/676))
pt: Otimização da árvore para módulos ([#676](https://github.com/fortran-lang/fpm/pull/676))
zh_cn: 模块的Tree shaking ([#676](https://github.com/fortran-lang/fpm/pull/676))

source: Fix submodule shaking ([#704](https://github.com/fortran-lang/fpm/pull/704))
es: Corregir submódulo optimizado ([#704](https://github.com/fortran-lang/fpm/pull/704))
fr: Corrige l'élimination du code mort dans les sous-modules ([#704](https://github.com/fortran-lang/fpm/pull/704))
in: सबमॉड्यूल झटकों को ठीक करें ([#704](https://github.com/fortran-lang/fpm/pull/704))
pt: Correção da otimização submódulos ([#704](https://github.com/fortran-lang/fpm/pull/704))
zh_cn: 修复子模块抖动 ([#704](https://github.com/fortran-lang/fpm/pull/704))

source: fix: remove extra space from help-test cmd ([#686](https://github.com/fortran-lang/fpm/pull/686))
es: Corrección: elimine espacios adcionales desde help-test cmd ([#686](https://github.com/fortran-lang/fpm/pull/686))
fr: correction : suppression de l'espace supplémentaire dans help-test ([#686](https://github.com/fortran-lang/fpm/pull/686))
in: फिक्स: हेल्प-टेस्ट सीएमडी से अतिरिक्त स्थान निकालें ([#686](https://github.com/fortran-lang/fpm/pull/686))
pt: correção: remove espaço extra dos testes do comando de ajuda ([#686](https://github.com/fortran-lang/fpm/pull/686))
zh_cn: 修复：从 help-test命令中删除多余的空格（[#686](https://github.com/fortran-lang/fpm/pull/686)）

source: Fix: to pipe up-to-date message to stderr ([#706](https://github.com/fortran-lang/fpm/pull/706))
es: Corrección: canalizar el mensaje actualizado a stderr ([#706](https://github.com/fortran-lang/fpm/pull/706))
fr: Correction pour envoyer le message 'Project is up to date' vers stderr ([#706](https://github.com/fortran-lang/fpm/pull/706))
in: फिक्स: स्टैडरर के लिए अप-टू-डेट संदेश पाइप करने के लिए ([#706](https://github.com/fortran-lang/fpm/pull/706))
pt: Correção: Usar a unidade stderr para a mensagem de que o projeto está atualizado ([#706](https://github.com/fortran-lang/fpm/pull/706))
zh_cn: 修复：将最新消息通过管道传输到 stderr ([#706](https://github.com/fortran-lang/fpm/pull/706))

source: Avoid infinite loop if command "fpm-" is in path ([#713](https://github.com/fortran-lang/fpm/pull/713))
es: Evite el bucle infinito si el comando "fpm-" está en la ruta ([#713](https://github.com/fortran-lang/fpm/pull/713))
fr: Évite une boucle infinie si une commande renommée "fpm-" est utilisée ([#713](https://github.com/fortran-lang/fpm/pull/713))
in: अनंत लूप से बचें यदि कमांड "fpm-" पथ में है ([#713](https://github.com/fortran-lang/fpm/pull/713))
pt: Evita laço infinito se o comando "fpm-" está no PATH ([#713](https://github.com/fortran-lang/fpm/pull/713))
zh_cn: 避免在路径下运行 `fpm-` 命令出现的无限循环 ([#713](https://github.com/fortran-lang/fpm/pull/713))

source: Fix --show-model, init `c_source%parent_modules` ([#712](https://github.com/fortran-lang/fpm/pull/712))
es: Corrección --show-model, init `c_source%parent_modules` ([#712](https://github.com/fortran-lang/fpm/pull/712))
fr: Corrige --show-model, init `c_source%parent_modules` ([#712](https://github.com/fortran-lang/fpm/pull/712))
in: फिक्स --शो-मॉडल, इनिट 'c_source%parent_modules' ([#712](https://github.com/fortran-lang/fpm/pull/712))
pt: Corrige --show-model, inicializa `c_source%parent_modules` ([#712](https://github.com/fortran-lang/fpm/pull/712))
zh_cn: 修复 --show-model, 初始化 `c_source%parent_modules` ([#712](https://github.com/fortran-lang/fpm/pull/712))

source: Add OMP critical for `make_archive` ([#708](https://github.com/fortran-lang/fpm/pull/708))
es: Adicionar OMP crítico para `make_archive` ([#708](https://github.com/fortran-lang/fpm/pull/708))
fr: Ajoute une section OMP critical dans `make_archive` ([#708](https://github.com/fortran-lang/fpm/pull/708))
in: 'make_archive' के लिए OMP क्रिटिकल जोड़ें ([#708](https://github.com/fortran-lang/fpm/pull/708))
pt: Adiciona uma seção OMP critical para o `make_archive` ([#708](https://github.com/fortran-lang/fpm/pull/708))
zh_cn: 对 `make_archive` 添加 OMP critical ([#708](https://github.com/fortran-lang/fpm/pull/708))

source: Fpm version 0.7.0 released
es: Lanzamiento de la versión 0.7.0 de fpm
fr: Fpm 0.7.0 est sorti
in: Fpm संस्करण 0.7.0 जारी
pt: Lançada a versão 0.7.0 do fpm
zh_cn: Fpm 0.7.0 版本发布

source: This release introduces preprocessor support in the `fpm.toml` manifest, allowing for preprocessor macros, file suffixes and directories where the preprocessor should run. This feature was implemented as part of Arteev Raina's Google Summer of Code 2022 project. Furthermore, fpm has now the ability to compile C++ source files in addition to Fortran and C. Finally, the ability to define compiler profiles in the `fpm.toml` manifest has been added, although the profile settings are not currently used in the build process.
es: Esta versión introduce soporte de preprocesador en el manifiesto `fpm.toml`, lo que permite macros de preprocesador, sufijos de archivo y directorios donde se debe ejecutar el preprocesador. Esta función se implementó como parte del proyecto Google Summer of Code 2022 de Arteev Raina. Además, fpm ahora tiene la capacidad de compilar archivos fuente de C++, de Fortran y C. Finalmente, se adicionó la capacidad de definir perfiles de compilador en el manifiesto `fpm.toml`, aunque la configuración del perfil no se usa actualmente en el proceso de compilación.
fr: Cette version introduit la prise en charge des préprocesseurs dans le manifeste `fpm.toml`, ce qui permet de définir des macros de préprocesseurs, des suffixes de fichiers et des répertoires où le préprocesseur doit s'exécuter. Cette fonctionnalité a été implémentée dans le cadre du projet Google Summer of Code 2022 d'Arteev Raina. De plus, fpm a maintenant la capacité de compiler des fichiers sources C++ en plus de Fortran et C. Enfin, la possibilité de définir des profils de compilateur dans le manifeste `fpm.toml` a été ajoutée, bien que les paramètres du profil ne soient pas actuellement utilisés dans le processus de construction.
in: यह रिलीज़ 'fpm.toml' मैनिफेस्ट में प्रीप्रोसेसर समर्थन का परिचय देती है, जिससे प्रीप्रोसेसर मैक्रोज़, फ़ाइल प्रत्यय और निर्देशिकाओं की अनुमति मिलती है जहां प्रीप्रोसेसर को चलना चाहिए। इस फीचर को आर्टीव रैना के गूगल समर ऑफ कोड 2022 प्रोजेक्ट के हिस्से के रूप में लागू किया गया था। इसके अलावा, एफपीएम में अब फोरट्रान और सी के अलावा सी ++ स्रोत फ़ाइलों को संकलित करने की क्षमता है। अंत में, 'fpm.toml' मैनिफेस्ट में कंपाइलर प्रोफाइल को परिभाषित करने की क्षमता जोड़ी गई है, हालांकि प्रोफ़ाइल सेटिंग्स वर्तमान में बिल्ड प्रक्रिया में उपयोग नहीं की जाती हैं।
pt: Este lançamento introduz o suporte à preprocessadores no manifesto `fpm.toml`, permitindo definir macros, sufixos de arquivo e diretórios sob os quais o preprocessador deve ser executado. Este recurso foi implementado como parte por Arteev Raina no projeto Google Summer of Code 2022. Além disso, fpm agora é possível compilar códigos em C++, em adição as linguagens já suportadas Fortran e C. Por fim, a habilidade de definir perfis de compilação no manifesto `fpm.toml` foi adicionada, no entanto, as configurações ainda não são usadas no processo de compilação.
zh_cn: 此版本在 `fpm.toml` 清单中引入了预处理器支持，允许预处理器宏、文件后缀和应该运行预处理器的目录。此功能是 Arteev Raina 的 Google Summer of Code 2022 项目的一部分。此外，除了 Fortran 和 C 之外，fpm 现在还能够编译 C++ 源文件。最后，添加了在 `fpm.toml` 清单中定义编译器配置文件的能力，尽管配置文件设置当前未在构建过程中使用。

source: Find the full release notes [here](https://github.com/fortran-lang/fpm/releases/tag/v0.7.0).
es: Encuentre las notas completas de lanzamiento [Aquí](https://github.com/fortran-lang/fpm/releases/tag/v0.7.0).
fr: Accédez aux notes de version complètes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.7.0).
in: पूर्ण रिलीज़ नोट्स [यहां] (https://github.com/fortran-lang/fpm/releases/tag/v0.7.0) खोजें।
pt: Encontre as notas de lançamento completas [aqui](https://github.com/fortran-lang/fpm/releases/tag/v0.7.0).
zh_cn: 在 [此处](https://github.com/fortran-lang/fpm/releases/tag/v0.7.0) 找到完整的发行说明。

source: Many thanks to Lewis McMillan ([@lewisfish](https://github.com/lewisfish)), Damian Rouson ([@rouson](https://github.com/rouson)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Laurence Kedward ([@LKedward](https://github.com/LKedward)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), Jakub Jelínek ([@kubajj](https://github.com/kubajj)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)) for contributing patches to this release.
es: Muchas gracias a Lewis McMillan ([@lewisfish](https://github.com/lewisfish)), Damian Rouson ([@rouson](https://github.com/rouson)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Laurence Kedward ([@LKedward](https://github.com/LKedward)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk )), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), Jakub Jelínek ([@kubajj](https://github.com/kubajj)), Arteev Raina ([@arteevraina] (https://github.com/arteevraina)) por aportar parches a esta versión.
fr: Merci à Lewis McMillan ([@lewisfish](https://github.com/lewisfish)), Damian Rouson ([@rouson](https://github.com/rouson)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Laurence Kedward ([@LKedward](https://github.com/LKedward)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), Jakub Jelínek ([@kubajj](https://github.com/kubajj)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)) pour avoir contribué aux correctifs de cette version.
in: लुईस मैकमिलन ([@lewisfish](https://github.com/lewisfish)), डेमियन राउसन ([@rouson](https://github.com/rouson)), गियानिस निकिटेस ([@gnikit](https://github.com/gnikit)), लॉरेंस केडवर्ड ([@LKedward](https://github.com/LKedward)), सेबस्टियन एहलर्ट ([@awvwgk](https://github.com/awvwgk)), जुओ झिहुआ ([@zoziha](https://github.com/zoziha)), जैकब जेलिनेक ([@kubajj https://github.com/arteevraina](@arteevraina https://github.com/kubajj)) के लिए बहुत धन्यवाद। इस रिलीज में पैच का योगदान।
pt: Muito obrigado a Lewis McMillan ([@lewisfish](https://github.com/lewisfish)), Damian Rouson ([@rouson](https://github.com/rouson)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Laurence Kedward ([@LKedward](https://github.com/LKedward)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)), Jakub Jelínek ([@kubajj](https://github.com/kubajj)), Arteev Raina ([@arteevraina](https://github.com/arteevraina)) por contribuir com correções para este lançamento.
zh_cn: 非常感谢 Lewis McMillan ([@lewisfish](https://github.com/lewisfish))、Damian Rouson ([@rouson](https://github.com/rouson))、Giannis Nikiteas ([@gnikit](https://github.com/gnikit))、Laurence Kedward ([@LKedward](https://github.com/LKedward))、Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk) ))、左志华 ([@zoziha](https://github.com/zoziha))、Jakub Jelínek ([@kubajj](https://github.com/kubajj))、Arteev Raina ([@arteevraina](https://github.com/arteevraina)）为这个版本贡献补丁。

source: feat: added basic preprocess table configuration by in <https://github.com/fortran-lang/fpm/pull/715>
fr: fonctionnalité : ajout de la configuration de base des tables de prétraitement (<https://github.com/fortran-lang/fpm/pull/715>)
in: करतब: <https://github.com/fortran-lang/fpm/pull/715> में बुनियादी प्रीप्रोसेस टेबल कॉन्फ़िगरेशन जोड़ा गया
pt: feat: adicionado configuração básica de preprocessamento em <https://github.com/fortran-lang/fpm/pull/715>
zh_cn: 特性：在 <https://github.com/fortran-lang/fpm/pull/715> 中，添加了基本的预处理表配置

source: Add homebrew installation instructions to README.md by in <https://github.com/fortran-lang/fpm/pull/718>
fr: Ajoute les instructions d'installation homebrew au README.md (<https://github.com/fortran-lang/fpm/pull/718>)
in: <https://github.com/fortran-lang/fpm/pull/718> में README.md करने के लिए होमब्रू इंस्टॉलेशन निर्देश जोड़ें"
pt: Adiciona instruções de instalação pelo homebrew no README.md no <https://github.com/fortran-lang/fpm/pull/718>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/718> 中，将 homebrew 安装说明添加到 README.md

source: Some cleanups and minor fixes by in <https://github.com/fortran-lang/fpm/pull/701>
fr: Quelques nettoyages et corrections mineures (<https://github.com/fortran-lang/fpm/pull/701>)
in: <https://github.com/fortran-lang/fpm/pull/701> में कुछ सफाई और मामूली सुधार
pt: Pequenas correções e refatoração em <https://github.com/fortran-lang/fpm/pull/701>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/701> 中，一些清理和小修复

source: feat: ability to read macros from manifest by in <https://github.com/fortran-lang/fpm/pull/720>
fr: fonctionnalité : possibilité de lire les macros du manifeste (<https://github.com/fortran-lang/fpm/pull/720>)
in: करतब: मैक्रोज़ को <https://github.com/fortran-lang/fpm/pull/720> में प्रकट से पढ़ने की क्षमता
pt: feat: opção de ler macros diretamente do manifesto pelo <https://github.com/fortran-lang/fpm/pull/720>
zh_cn: 特性：在 <https://github.com/fortran-lang/fpm/pull/720> 中，能够从清单中读取宏

source: Support for dependency path relative to the fpm.toml it’s written in by in <https://github.com/fortran-lang/fpm/pull/719>
fr: Prise en charge pour les dépendances d'un chemin relatif au fpm.toml : <https://github.com/fortran-lang/fpm/pull/719>
in: fpm.toml के सापेक्ष निर्भरता पथ के लिए समर्थन यह <https://github.com/fortran-lang/fpm/pull/719> में लिखा गया है
pt: Suporte a caminho relativo ao fpm.toml para dependências no <https://github.com/fortran-lang/fpm/pull/719>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/719> 中，支持相对于它所在的 fpm.toml 的依赖路径

source: feat: added support for C++ files compilation by in <https://github.com/fortran-lang/fpm/pull/733>
fr: fonctionnalité : ajout du support pour la compilation des fichiers C++ (<https://github.com/fortran-lang/fpm/pull/733>)
in: करतब: <https://github.com/fortran-lang/fpm/pull/733> में C++ फ़ाइलों के संकलन के लिए अतिरिक्त समर्थन
pt: feat: adicionado suporte a compilação de código em C++ no <https://github.com/fortran-lang/fpm/pull/733>
zh_cn: 特性：在 <https://github.com/fortran-lang/fpm/pull/733> 中，添加了对 C++ 文件编译的支持

source: Fix executables linking by in <https://github.com/fortran-lang/fpm/pull/743>
fr: Corrige la liaison des exécutables (<https://github.com/fortran-lang/fpm/pull/743>)
in: <https://github.com/fortran-lang/fpm/pull/743> में लिंक करने वाली निष्पादन योग्य वस्तुओं को ठीक करें
pt: Correção no vínculo de bibliotecas em executáveis no <https://github.com/fortran-lang/fpm/pull/743>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/743> 中，修复可执行文件的链接

source: Change git directory using work-tree / git-dir by in <https://github.com/fortran-lang/fpm/pull/747>
fr: Change le répertoire git en utilisant work-tree / git-dir (<https://github.com/fortran-lang/fpm/pull/747>)
in: कार्य-वृक्ष/गिट-डाइर का उपयोग करके गिट निर्देशिका को <https://github.com/fortran-lang/fpm/pull/747> में बदलें
pt: Mudar o diretório git usando work-tree / git-dir no <https://github.com/fortran-lang/fpm/pull/747>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/747> 中，使用 work-tree / git-dir 更改 git 目录

source: Fix #734: First resolve dependencies, then resolve programs by in <https://github.com/fortran-lang/fpm/pull/737>
fr: Correction #734 : résoudre d'abord les dépendances, puis les programmes (<https://github.com/fortran-lang/fpm/pull/737>)
in: # 734 को ठीक करें: पहले निर्भरताओं को हल करें, फिर <https://github.com/fortran-lang/fpm/pull/737> में प्रोग्राम हल करें
pt: Fix #734: Primeiro resolve as dependências, depois resolve os programas no <https://github.com/fortran-lang/fpm/pull/737>
zh_cn: 修复 #734：在 <https://github.com/fortran-lang/fpm/pull/737> 中，首先处理依赖关系，然后处理主程序

source: docs(README): improve Homebrew references by in <https://github.com/fortran-lang/fpm/pull/745>
fr: docs(README) : améliore les références Homebrew (<https://github.com/fortran-lang/fpm/pull/745>)
in: डॉक्स (README): होमब्रू संदर्भों में सुधार <https://github.com/fortran-lang/fpm/pull/745>
pt: docs(README): melhora as referencias do Homebrew no <https://github.com/fortran-lang/fpm/pull/745>
zh_cn: docs(README)：在 <https://github.com/fortran-lang/fpm/pull/745> 中，改进 Homebrew 参考

source: Minor fix for `fpm new` by in <https://github.com/fortran-lang/fpm/pull/739>
fr: Correction mineure pour `fpm new` (<https://github.com/fortran-lang/fpm/pull/739>)
in: <https://github.com/fortran-lang/fpm/pull/739> में 'एफपीएम न्यू' के लिए मामूली फिक्स
pt: Pequena correção no `fpm new` em <https://github.com/fortran-lang/fpm/pull/739>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/739> 中，对 `fpm new` 的小修复

source: docs: updated example packages README with new packages that were added by in <https://github.com/fortran-lang/fpm/pull/740>
fr: documentation : mise à jour du README des paquets d'exemples avec les nouveaux paquets (<https://github.com/fortran-lang/fpm/pull/740>)
in: दस्तावेज़: अद्यतन किए गए उदाहरण पैकेज README नए पैकेज के साथ जो <https://github.com/fortran-lang/fpm/pull/740> में जोड़े गए थे
pt: docs: atualizado os pacotes de exemplo do README com os novos pacotes adicionados em <https://github.com/fortran-lang/fpm/pull/740>
zh_cn: 文档：在 <https://github.com/fortran-lang/fpm/pull/740> 中，添加的新包更新了示例包 README

source: Enable profiles in toml by in <https://github.com/fortran-lang/fpm/pull/653>
fr: Activer les profils dans toml (<https://github.com/fortran-lang/fpm/pull/653>)
in: <https://github.com/fortran-lang/fpm/pull/653> में toml में प्रोफ़ाइल सक्षम करें
pt: Habilita controle de perfis no toml em <https://github.com/fortran-lang/fpm/pull/653>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/653> 中，对 toml 启用配置文件

source: Updated URL to manifest file in help section by in <https://github.com/fortran-lang/fpm/pull/755>
fr: Mise à jour de l'URL du fichier manifeste dans la section aide (<https://github.com/fortran-lang/fpm/pull/755>)
in: <https://github.com/fortran-lang/fpm/pull/755> में सहायता अनुभाग में फ़ाइल प्रकट करने के लिए अद्यतन URL
pt: Atualiza a URL para o ficheiro manifesto na seção de ajuda em <https://github.com/fortran-lang/fpm/pull/755>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/755> 中，更新了帮助部分中清单文件的 URL

source: Fix compilation with NAG by in <https://github.com/fortran-lang/fpm/pull/753>
fr: Corrige la compilation avec NAG (<https://github.com/fortran-lang/fpm/pull/753>)
in: एनएजी के साथ संकलन को <https://github.com/fortran-lang/fpm/pull/753> में ठीक करें
pt: Corrige a compilação com o NAG em <https://github.com/fortran-lang/fpm/pull/753>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/753> 中，使用 NAG 修复编译

source: Fixes #756: add judgement of macros allocation status by in <https://github.com/fortran-lang/fpm/pull/762>
fr: Corrige #756 : ajout du jugement de l'état d'allocation des macros (<https://github.com/fortran-lang/fpm/pull/762>)
in: # 756 को ठीक करें: मैक्रोज़ आवंटन स्थिति का निर्णय <https://github.com/fortran-lang/fpm/pull/762> में जोड़ें
pt: Fixes #756: corrige segfault no array macros em <https://github.com/fortran-lang/fpm/pull/762>
zh_cn: 修复 #756：在 <https://github.com/fortran-lang/fpm/pull/762> 中，添加对宏分配状态的判断

source: In the default case of command line subcommands, stop `fpm` running in time by in <https://github.com/fortran-lang/fpm/pull/728>
fr: Dans le cas par défaut des sous-commandes de la ligne de commande, arrête `fpm` en cours d'exécution à temps (<https://github.com/fortran-lang/fpm/pull/728>)
in: कमांड लाइन उपसमितियों के डिफ़ॉल्ट मामले में, 'fpm' को समय पर चलना बंद कर दें<https://github.com/fortran-lang/fpm/pull/728>
pt: No caso padrão dos subcomandos, evita que o `fpm` execute comandos além do necessário <https://github.com/fortran-lang/fpm/pull/728>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/728> 中，命令行子命令默认情况下，及时停止 `fpm` 运行

source: Disallow C-style escaping for IBM XL compiler by in <https://github.com/fortran-lang/fpm/pull/764>
fr: Désactiver l'échappement de style C pour le compilateur IBM XL (<https://github.com/fortran-lang/fpm/pull/764>)
in: आईबीएम एक्सएल कंपाइलर के लिए सी-स्टाइल एस्केपिंग को <https://github.com/fortran-lang/fpm/pull/764> में अस्वीकार करें
pt: Desabilita o código de escape em estilo C para o compilador IBM XL em <https://github.com/fortran-lang/fpm/pull/764>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/764> 中，禁止 IBM XL 编译器的 C 样式转义

source: bug: C preprocessor does not propagate directives to executables by in <https://github.com/fortran-lang/fpm/pull/775>
fr: bogue : Le préprocesseur C ne propage pas les directives aux exécutables (<https://github.com/fortran-lang/fpm/pull/775>)
in: बग: सी प्रीप्रोसेसर <https://github.com/fortran-lang/fpm/pull/775> में निष्पादन योग्य उपकरणों के निर्देशों का प्रचार नहीं करता है
pt: bug: preprocessador do C não propaga suas diretivas para o executáveis em <https://github.com/fortran-lang/fpm/pull/775>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/775> 中，修复错误：C 预处理器不会将指令传播到可执行文件

source: bug: macros don't propage to C executables by in <https://github.com/fortran-lang/fpm/pull/779>
fr: bogue : les macros ne se propagent pas aux exécutables C (<https://github.com/fortran-lang/fpm/pull/779>)
in: बग: मैक्रोज़ <https://github.com/fortran-lang/fpm/pull/779> में सी निष्पादन योग्य को प्रोपेज नहीं करते हैं
pt: bug: macros não propagam para os executáveis em C no <https://github.com/fortran-lang/fpm/pull/779>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/779> 中，修复错误：宏不会传播到 C 可执行文件
