Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Further, you can instruct the preprocessor to run on source files in specific directories:
de: Außerdem können Sie den Präprozessor anweisen, mit Quelldateien in bestimmten Verzeichnissen zu arbeiten:
es: Además, puede indicar al preprocesador que se ejecute en archivos de origen en directorios específicos:
fr: En outre, vous pouvez demander au préprocesseur de s'exécuter sur des fichiers sources situés dans des répertoires spécifiques :
in: इसके अलावा, आप प्रीप्रोसेसर को विशिष्ट निर्देशिकाओं में स्रोत फ़ाइलों पर चलने का निर्देश दे सकते हैं:
pt: Além disso, você pode instruir o pré-processador para processar código-fonte a partir de diretórios específicos:
zh_cn: 此外，你可以指示预处理器在特定目录中的源文件上运行：

source: Preprocessor macros can be defined like this:
de: Präprozessor-Makros können wie folgt definiert werden:
es: Las macros del preprocesador se pueden definir así:
fr: Les macros du préprocesseur peuvent être définies comme suit :
in: प्रीप्रोसेसर मैक्रोज़ को इस तरह परिभाषित किया जा सकता है:
pt: As macros do pré-processador podem ser definidas como:
zh_cn: 预处理器宏可以这样定义：

source: We can also use dotted keys to define our preprocessor settings.
de: Wir können auch gepunktete Schlüssel verwenden, um unsere Präprozessoreinstellungen zu definieren.
es: También podemos usar teclas de puntos para definir la configuración de nuestro preprocesador.
fr: Nous pouvons également utiliser des sous-champs pour définir les paramètres de notre préprocesseur.
in: हम अपनी प्रीप्रोसेसर सेटिंग्स को परिभाषित करने के लिए बिंदीदार कुंजियों का भी उपयोग कर सकते हैं।
pt: Também é possível definir as configurações do nosso pré-processador acessando as chaves usando o ponto.
zh_cn: 我们还可以使用虚线键来定义我们的预处理器设置。

source: We can also define valued macros in preprocess table.
de: Wir können in der Präprozessortabelle auch Makros mit Werten definieren.
es: También podemos definir macros valiosas en la tabla de preprocesamiento.
fr: Nous pouvons également définir des macros numérotés dans la table de prétraitement.
in: हम प्रीप्रोसेस टेबल में मूल्यवान मैक्रोज़ को भी परिभाषित कर सकते हैं।
pt: Também é possível definir macros com seus valores em uma tabela de pré-processamento.
zh_cn: 我们还可以在预处理表中定义有值的宏。

source: We can also reuse values like version number from manifest as a value for a macro.
de: Wir können auch die Wiederverwendung von Werten wie der Versionsnummer von Manifest als Wert für einen Makro auswerten.
es: También podemos reutilizar valores como el número de versión del manifiesto como valor para una macro.
fr: Nous pouvons même réutiliser des valeurs comme le numéro de version défini dans le manifeste comme valeur pour une macro.
in: हम मैनिफेस्ट से संस्करण संख्या जैसे मानों को मैक्रो के मान के रूप में पुन: उपयोग कर सकते हैं।
pt: Além disso, é possível reutilizar valores como o número de versão a partir do manifesto como um valor para a sua macro.
zh_cn: 我们还可以重用清单中的版本号等值作为宏的值。

source: Additional free data field
de: Zusätzliches freies Datenfeld
es: Campo de datos libre adicional
fr: Champ de données libres supplémentaire
in: अतिरिक्त निःशुल्क डेटा फ़ील्ड
ja: 設定の追加欄
nl: Veld voor aanvullende gegevens
pt: Campo de dados adicionais
zh_cn: 其它可用数据字段

source: Third-party tools can store their configuration inside the *extra* section. This section will never be evaluated by fpm itself, the only constraint imposed is that it has to be valid TOML.
de: Externe Tools können ihre Konfiguration in den *extra*-Abschnitten speichern. Dieser Abschnitt wird von fpm nie evaluiert, es wird nur eine Einschränkung gesetzt, dass gültiges TOML benutzt wird.
es: Las herramientas de terceros pueden almacenar su configuración dentro de la sección *extra*. Esta sección nunca será evaluada por el propio fpm, la única restricción impuesta es que tiene que ser un TOML válido.
fr: Les outils tiers peuvent stocker leur configuration dans la section *extra*. Cette section ne sera jamais traitée par fpm lui-mêmeL La seule contrainte est qu'elle doit être écrite en TOML valide.
in: तृतीय-पक्ष टूल अपने कॉन्फ़िगरेशन को *अतिरिक्त* अनुभाग में संग्रहीत कर सकते हैं. इस खंड का कभी भी एफपीएम द्वारा मूल्यांकन नहीं किया जाएगा, एकमात्र बाधा यह है कि इसे वैध टीओएमएल होना चाहिए।
ja: *extra*設定項目内に，第三者製ツールの設定を記述できます．この設定項目は，fpmによって評価はされません．正当なTOML形式であることが唯一の制約です．
nl: Externe tools kunnen configuratiegegevens in de sectie *extra* opslaan. Deze sectie wordt door fpm nooit geëvalueerd. De enige voorwaarde is dat het voldoet aan het TOML-format.
pt: Ferramentas de terceiros podem guardar suas configurações dentro da seção *extra*. Esta seção nunca será processada pelo fpm, portanto a única coisa imposta é que ela seja escrita em TOML.
zh_cn: 第三方工具可以将其配置存储在额外（*extra*）部分中。此部分永远不会由fpm本身进行评估，施加的唯一约束是它必须是有效的TOML。

source: Since the format of this section is free, only recommendations are provided here for adding data to the *extra* section.
de: Da das Format dieses Abschnitts frei ist, werden hier nur Empfehlungen für das Hinzufügen von Daten zum *extra*-Abschnitt angegeben.
es: Dado que el formato de esta sección es libre, aquí solo se proporcionan recomendaciones para agregar datos a la sección *extra*.
fr: Le format de cette section étant libre, seules des recommandations sont fournies ici pour ajouter des données à la section *extra*.
in: चूंकि इस खंड का प्रारूप नि:शुल्क है, यहां केवल *अतिरिक्त* खंड में डेटा जोड़ने के लिए सिफारिशें दी गई हैं।
ja: この項目の書式は自由なので，ここでは*extra*に追加するデータの推奨事項のみを示します．
nl: Aangezien het format van deze sectie verder vrij is, worden hier enkele aanbevelingen gegeven.
pt: Já que o formato da seção *extra* é livre, apenas sugestões para adicionar dados a ela serão dadas aqui.
zh_cn: 由于此部分的格式是自由的，因此此处仅提供了将数据添加到额外（*extra*）部分的建议。

source: Only use subtables, never add configuration data to the top level of the *extra* section. Reasoning: different tools can avoid collisions of key names by placing their data in separate subtables.
de: Verwenden Sie nur Untertabellen, niemals Daten in den *extra*-Abschnitt auf der obersten Ebene hinzufügen. Grund: verschiedene Tools können Kollisionen von Schlüsselnamen vermeiden, indem ihre Daten in separate Untertabellen gespeichert werden.
es: Use unicamente subtablas, nunca adicione datos de configuración al nivel superior de la sección *extra*. Razonamiento: diversas herramientas pueden evitar colisiones de nombres clave poniendo sus datos en subtablas separadas.
fr: N'utilisez que des sous-tables, n'ajoutez jamais de données de configuration au niveau supérieur de la section *extra*. Raison : différents outils peuvent ainsi éviter les collisions de noms de champs en plaçant leurs données dans des sous-tables séparées.
in: केवल उप-तालिकाओं का उपयोग करें, *अतिरिक्त* अनुभाग के शीर्ष स्तर पर कॉन्फ़िगरेशन डेटा कभी न जोड़ें. तर्क: विभिन्न उपकरण अपने डेटा को अलग-अलग उप-तालिकाओं में रखकर प्रमुख नामों के टकराव से बच सकते हैं।
ja: サブテーブルのみを使用し，*extra*に設定を追加してはならない．根拠：異なるツールが参照するデータを個々のサブテーブルに配置することで，名前の衝突を避けることができる．
nl: Gebruik alleen deeltabellen, nooit configuratiegegevens op het hoogste niveau binnen de sectie *extra*. De reden: veschillende tools kunnen dan conflicten met de sleutelwoorden vermijden, doordat ze verschillende deeltabellen gebruiken.
pt: Use apenas sub-tabelas, nunca adicione configurações no nível superior da seção *extra*. Motivo: diferentes ferramentas podem evitar colisões de nome colocando seus dados em tabelas separadas.
zh_cn: 仅使用子表，切勿将配置数据添加到额外（*extra*）部分的顶层。推理：不同的工具可以通过将其数据放在单独的子表中来避免键名的冲突。

source: Use the concrete name of the tool rather than a generic name for the subtable. Reasoning: different formatter or linter tools might use conflicting keywords in a *format* or *lint* subtable. Also, users can tell from the table name which tool is preferred to use with the project.
de: Verwenden Sie den konkreten Namen des Tools statt eines generischen Namens für die Untertabelle. Grund: verschiedene Formatter- oder Linter-Tools können in einer *format*- oder *lint*-Untertabelle widersprüchliche Schlüsselwörter verwenden. Benutzer*innen können auch von dem Tabellennamen auf die Tool-Vorgabe des Projekts hinweisen.
es: Use el nombre concreto de la herramienta mas que el nombre genérico para la subtabla. Razonamiento: diversas herramientas de formatación, o herramientas Linter, pueden usar palabras clave en conflicto en una subtable *format* o *lint*. Además, los usuarios pueden saber desde el nombre de la tabla la herramienta que prefieren usar con el proyecto.
fr: Utilisez le nom concret de l'outil plutôt qu'un nom générique pour la sous-table. Raison : différents outils de formatage ou d'analyse de code peuvent utiliser des mots-clés en conflit dans une sous-table *format* ou *lint*. En outre, les utilisateurs peuvent savoir, d'après le nom de la table, quel outil il est préférable d'utiliser pour le projet.
in: उप-तालिका के लिए एक सामान्य नाम के बजाय उपकरण के ठोस नाम का उपयोग करें। तर्क: विभिन्न स्वरूपक या लिंटर उपकरण *स्वरूप* या *लिंट* उप-तालिका में परस्पर विरोधी कीवर्ड का उपयोग कर सकते हैं. इसके अलावा, उपयोगकर्ता तालिका नाम से बता सकते हैं कि परियोजना के साथ किस उपकरण का उपयोग करना पसंद किया जाता है।
ja: サブテーブルには，一般的な名前ではなく，ツールの具体的な名前を用いる．根拠：異なるフォーマッタやリンタが，*format*あるいは*lint*サブテーブル内で相反するキーワードを使用する可能性がある．また，どのツールをプロジェクトで利用するのが適切かを，ユーザがテーブルの名前から判断できる．
nl: Gebruik steeds de concrete naam van het tool in plaats van een generieke naam voor de deeltabellen. De reden: verschillende formatterings- of opschoon-tools kunnen in een deeltabel *format*- of *lint* conflicterende sleutelwoorden gebruiken. Gebruikers kunnen ook met de tabelnaam kiezen voor de juiste tool voor het project.
pt: Use um nome concreto para a ferramenta em vez de um nome genérico para a sub-tabela. Motivo: um formatador diferente ou ferramentas de linter podem usar palavras-chave conflitantes em um tabela chamada *format* ou *lint*. Além disso, usuários podem ficar sabendo a partir do nome da tabela qual ferramenta que prefere para usar no projeto.
zh_cn: 使用工具的具体名称，而不是子表的通用名称。推理：不同的格式化程序或linter工具可能会在格式（*format*）或*lint*子表中使用冲突的关键词。此外，用户还可以从表名中判断哪个工具更适合用于项目。

source: Fpm plugins should use a subtable with their plugin name in the *extra.fpm* section to store their data. Reasoning: following this convention provides the user of fpm plugins with one section to configure their used plugins.
de: Fpm-Plugins sollten eine Untertabelle in den *extra.fpm*-Abschnitten mit ihrem Plugin-Namen speichern. Grund: diese Verwendung ermöglicht der Benutzer*in von fpm-Plugins eine einzige Sektion zur Konfiguration ihrer benutzten Plugins.
es: Los complementos del fpm deben contener una subtabla con el nombre del complemento en la sección *extra.fpm* para almacenar sus datos. Razonamiento: esta convención brinda al usuario complementos de fpm con una sección para configurar sus complementos usados.
fr: Les greffons fpm doivent utiliser une sous-table avec leur nom de greffon dans la section *extra.fpm* pour stocker leurs données. Raison : en suivant cette convention, l'utilisateur de greffons fpm dispose d'une section pour configurer les greffons qu'il utilise.
in: Fpm प्लगइन्स को अपने डेटा को स्टोर करने के लिए *extra.fpm* सेक्शन में अपने प्लगइन नाम के साथ एक सबटेबल का उपयोग करना चाहिए। तर्क: इस परिपाटी के बाद fpm प्लगइन्स के उपयोगकर्ता को उनके उपयोग किए गए प्लगइन्स को कॉन्फ़िगर करने के लिए एक सेक्शन प्रदान करता है।
ja: fpmのプラグインは，*extra.fpm*項目内でプラグイン名を持つサブテーブルを使用してデータを格納する．根拠：この規約に従うことで，利用するプラグインの設定が書かれた単一の設定項目をユーザに提供できる．
nl: Fpm-plugins moeten een deeltabel met de pluginnaam in de sectie *extra.fpm* opslaan. Reden: met deze conventie kan de gebruiker van fpm-plugins met een enkele sectie de te gebruiken plugins configureren.
pt: Os plugins fpm devem usar uma tabela com o nome do plugin sob a seção *extra.fpm* para armazenar seus dados. Motivo: seguir esta convenção fornece ao seus usuários uma seção para configuração dos seus plugins.
zh_cn: fpm插件应在*extra.fpm*部分中使用带有其插件名称的子表来存储其数据。推理：遵循此约定为fpm插件的用户提供一个部分来配置其使用的插件。

source: Use the fpm preferred style for keywords which is lowercase with dashes. Reasoning: while there is no style check in this section, a consistent style in the whole manifest will make it easier for the user to understand the whole package manifest.
de: Verwenden Sie den fpm-vorherigen Stil für Schlüsselwörter, der Konkatenation mit Bindestrichen in Kleinbuchstaben darstellt. Grund: während keine Überprüfung in diesem Abschnitt stattfindet, macht ein konsistenter Stil im gesamten Manifest es einfacher für die Benutzer*in das gesamte Paket-Manifest zu verstehen.
es: Use el estilo preferido de fpm para palabras clave que están en minúsculas con guiones. Razonamiento: si bien no existe verificación de estilo en esta sección, un estilo consistente en todo el manifiesto facilitará al usuario entender la totalidad del manifiesto del paquete.
fr: Utilisez le style standard de fpm pour les mots-clés, c'est-à-dire en minuscules avec des tirets. Raison : bien qu'il n'y ait pas de contrôle de style dans cette section, un style cohérent dans l'ensemble du manifeste facilitera la compréhension du manifeste du paquet par l'utilisateur.
in: उन खोजशब्दों के लिए fpm पसंदीदा शैली का उपयोग करें जो डैश के साथ लोअरकेस हैं। तर्क: जबकि इस खंड में कोई शैली जांच नहीं है, पूरे मेनिफ़ेस्ट में एक सुसंगत शैली उपयोगकर्ता के लिए पूरे पैकेज मेनिफ़ेस्ट को समझना आसान बना देगी।
ja: キーワードの記述には，小文字とダッシュで構成されるfpmのスタイルを使用する．根拠：この設定項目の書式はチェックされないが，マニフェスト全体で一貫した書式を維持することにより，ユーザがパッケージマニフェスト全体を理解しやすくなる．
nl: Gebruik bij voorkeur de fpm-stijl voor sleutelwoorden, kleine letters en streepjes om onderdelen te scheiden. Reden: er vindt weliswaar geen controle plaats in deze sectie, maar een consistente stijl in het hele manifestbestand maakt het gemakkelijker voor de gebruiker om de inhoud te begrijpen.
pt: Use o estilo preferido no fpm para as palavras-chave, que é caixa baixa com traços. Motivo: mesmo que não seja feita uma checagem de estilo desta seção, um estilo consistente em todo o seu manifesto fará com que seja mais fácil para o usuário entendê-lo como um todo.
zh_cn: 对关键词使用fpm首选样式，该样式是小写和短划线。推理：虽然本节中没有样式检查，但整个清单中的一致样式将使用户更容易理解整个包清单。

source: Feedback for the recommendations above is very much welcome. If you have a tool that uses the *extra* section in the package manifest, feel free to post it in at the [fpm discussion board](https://github.com/fortran-lang/fpm/discussions).
de: Rückmeldungen und Vorschläge für die oben genannten Empfehlungen ist sehr herzlich willkommen. Wir freuen uns über Rückmeldungen im [fpm-Diskussionsforum](https://github.com/fortran-lang/fpm/discussions) von Tools, die den *extra*-Abschnitt im Paket-Manifest verwenden.
es: Comentarios sobre las recomendaciones anteriores son bienvenidos. Si tiene una herramienta que usa la sección *extra* en el manifiesto del paquete, sientase libre de publicarlo en [fpm discussion board](https://github.com/fortran-lang/fpm/discussions).
fr: Les commentaires sur les recommandations ci-dessus sont les bienvenus. Si vous avez un outil qui utilise la section *extra* dans le manifeste du paquet, n'hésitez pas à le poster dans la [section discussion de fpm](https://github.com/fortran-lang/fpm/discussions).
in: ऊपर की सिफारिशों के लिए प्रतिक्रिया बहुत स्वागत योग्य है। अगर आपके पास पैकेज मेनिफ़ेस्ट में *extra* सेक्शन का इस्तेमाल करने वाला टूल है, तो बेझिझक इसे [fpm डिस्कशन बोर्ड](https://github.com/fortran-lang/fpm/discussions) पर पोस्ट करें।
ja: 上記推奨事項に対する反応を歓迎します．もしあなたがパッケージマニフェストの*extra*設定項目を使用するツールをお持ちの場合は，[fpmディスカッション掲示板](https://github.com/fortran-lang/fpm/discussions)にその情報を投稿してください．
nl: Terugmeldungen en suggesties voor de genoemde aanbevelingen zijn van harte welkom. Dit geldt zeker voor tools die via de sectie *extra* in het manifestbestand geconfigureerd kunnen worden. Meld dit in het [fpm discussieforum](https://github.com/fortran-lang/fpm/discussions).
pt: Comentários sobre as recomendações acima são mais que bem-vindos. Se você possui uma ferramenta que usa a seção *extra* do manifesto, sinta-se à vontade para postar no [mural de discussões do fpm](https://github.com/fortran-lang/fpm/discussions).
zh_cn: 非常欢迎对上述建议的反馈。如果你有使用包清单中额外（*extra*）部分的工具，请随时将其发布在[fpm讨论板](https://github.com/fortran-lang/fpm/discussions)上。

source: Module name requirements
fr: Exigences relatives au nom du module
in: मॉड्यूल नाम आवश्यकताएँ
zh_cn: 模块名称要求

source: Module naming requirements only apply to packages which are uploaded to a fpm registry; by default, no naming rules are enforced for local fpm projects.
fr: Les exigences en matière de dénomination des modules ne s'appliquent qu'aux paquets téléversés dans un registre fpm ; par défaut, aucune règle de dénomination n'est appliquée aux projets fpm locaux.
in: मॉड्यूल नामकरण आवश्यकताएँ केवल उन पैकेजों पर लागू होती हैं जो fpm रजिस्ट्री पर अपलोड किए जाते हैं; डिफ़ॉल्ट रूप से, स्थानीय एफपीएम परियोजनाओं के लिए कोई नामकरण नियम लागू नहीं किया जाता है।
zh_cn: 模块命名要求只适用于上传到fpm注册表的软件包；默认情况下，本地fpm项目不执行命名规则。

source: TL;DR Always prefix all your module names with a standardized package prefix.
fr: TL;DR Préfixez toujours tous les noms de vos modules avec un préfixe de paquet standardisé.
in: टीएल; डीआर हमेशा अपने सभी मॉड्यूल नामों को मानकीकृत पैकेज उपसर्ग के साथ उपसर्ग करें।
zh_cn: 如题，始终用一个标准化的包前缀来命名你的所有模块。

source: A default prefix (package name + double underscore: `my_package__*`) is always reserved by the registry
fr: Un préfixe par défaut (nom du paquet + double trait de soulignement : `my_package__*`) est toujours réservé par le registre.
in: एक डिफ़ॉल्ट उपसर्ग (पैकेज का नाम + डबल अंडरस्कोर: `my_package__*`) हमेशा रजिस्ट्री द्वारा आरक्षित होता है
zh_cn: 一个默认的前缀（包名+双下划线：`my_package__*`）总是由注册表保留

source: A custom prefix (no-symbols + single underscore: `mypkg_*`) can be specified, but it is subject to not being reserved in the registry yet.
fr: Un préfixe personnalisé (pas de symboles + un seul trait de soulignement : `mypkg_*`) peut être spécifié, mais il est susceptible de ne pas être encore réservé dans le registre.
in: एक कस्टम उपसर्ग (नो-सिंबल + सिंगल अंडरस्कोर: `mypkg_*`) निर्दिष्ट किया जा सकता है, लेकिन यह अभी तक रजिस्ट्री में आरक्षित नहीं होने के अधीन है।
zh_cn: 可以指定一个自定义的前缀（无符号+单下划线：`mypkg_*`），但它受制于还没有在注册表中被保留。

source: Set default (`module-naming=true`) or custom (`module-naming="mypfx"`) prefix in `fpm.toml` `[build]`.
fr: Définir le préfixe par défaut (`module-naming=true`) ou personnalisé (`module-naming="mypfx"`) dans `fpm.toml` `[build]`.
in: `fpm.toml` `[build]` में डिफॉल्ट (`मॉड्यूल-नेमिंग=ट्रू`) या कस्टम (`मॉड्यूल-नेमिंग="mypfx"`) उपसर्ग सेट करें।
zh_cn: 在`fpm.toml`的`[build]`中设置默认（`module-naming=true`）或自定义（`module-naming="mypfx"`）前缀。

source: The Fortran language does not support namespaces. This means that all public names (modules, but also global subroutines and functions) must be unique in the build space. Any build that contains duplicate names will fail because it is impossible to resolve a name to a unique object. For this reason, fpm by default requires all packages to comply with simple naming conventions that apply to both the package name and its modules.
fr: Le langage Fortran ne prend pas en charge les espaces de noms. Cela signifie que tous les noms publics (modules, mais aussi sous-routines et fonctions globales) doivent être uniques dans l'espace de construction. Toute construction contenant des noms dupliqués échouera car il est impossible de résoudre un nom en un objet unique. C'est pourquoi fpm exige par défaut que tous les paquets respectent des conventions de nommage simples qui s'appliquent à la fois au nom du paquet et à ses modules.
in: फोरट्रान भाषा नामस्थानों का समर्थन नहीं करती है। इसका मतलब यह है कि बिल्ड स्पेस में सभी सार्वजनिक नाम (मॉड्यूल, लेकिन वैश्विक सबरूटीन्स और फ़ंक्शंस) अद्वितीय होने चाहिए। डुप्लिकेट नाम वाली कोई भी बिल्ड विफल हो जाएगी क्योंकि नाम को किसी अद्वितीय ऑब्जेक्ट में हल करना असंभव है। इस कारण से, डिफ़ॉल्ट रूप से एफपीएम को सभी पैकेजों को सरल नामकरण परंपराओं का पालन करने की आवश्यकता होती है जो पैकेज नाम और उसके मॉड्यूल दोनों पर लागू होते हैं।
zh_cn: Fortran语言不支持命名空间。这意味着所有公共名称（模块，但也包括全局子程序和函数）在构建空间中必须是唯一的。任何包含重复名字的构建都会失败，因为不可能将一个名字解析为一个唯一的对象。出于这个原因，fpm默认要求所有的包都要遵守简单的命名规则，这些规则同时适用于包名和它的模块。

source: Fortran names: general rules
fr: Noms Fortran : règles générales
in: फोरट्रान नाम: सामान्य नियम
zh_cn: Fortran名称：一般规则

source: As of Fortran 2003 onward, valid Fortran names need to comply with the following rules:
fr: Depuis Fortran 2003, les noms Fortran valides doivent respecter les règles suivantes :
in: फोरट्रान 2003 के बाद से, मान्य फोरट्रान नामों को निम्नलिखित नियमों का पालन करने की आवश्यकता है:
zh_cn: 从Fortran 2003开始，有效的Fortran名称需要遵守以下规则：

source: Up to 63 characters long;
fr: Jusqu’à 63 caractères ;
in: 63 वर्णों तक लंबा;
pt: Até 63 caracteres;
zh_cn: 最长为63个字符；

source: Letters are case insensitive;
fr: Insensibles à la casse ;
in: पत्र केस संवेदी होते हैं;
pt: Letras não são sensíveis a caixa alta ou baixa;
zh_cn: 字母是不分大小写的；

source: Must begin with a letter;
fr: Doit commencer par une lettre ;
in: एक पत्र से शुरू होना चाहिए;
zh_cn: 必须以字母作为开头；

source: Only alphanumeric characters (letters, numbers) and underscores `_` are allowed.
fr: Seuls les caractères alphanumériques (lettres, chiffres) et les traits de soulignement `_` sont autorisés.
in: केवल अल्फ़ान्यूमेरिक वर्ण (अक्षर, संख्या) और अंडरस्कोर `_` की अनुमति है।
zh_cn: 只允许使用字母数字字符（字母、数字）和下划线`_`。

source: *Examples of invalid Fortran names:*
fr: *Exemples de noms Fortran non valides :*
in: *अमान्य फोरट्रान नामों के उदाहरण:*
pt: *Exemplos de nomes inválidos em Fortran:*
zh_cn: *无效的Fortran名称的例子：*

source: *Examples of valid Fortran names:*
fr: * Exemples de noms Fortran valides :*
in: *मान्य फोरट्रान नामों के उदाहरण:*
pt: *Exemplos de nomes válidos em Fortran:*
zh_cn: *有效的Fortran名称的例子：*

source: fpm registry names: rules for packages and modules
fr: Noms de registre fpm : règles pour les paquets et les modules
in: fpm रजिस्ट्री नाम: संकुल और मॉड्यूल के लिए नियम
zh_cn: fpm注册表名称：软件包和模块的规则

source: To reduce the chance of name collisions, any Fortran module name in a package must begin with a unique prefix. Two options are offered.
fr: Pour réduire le risque de collisions de noms, tout nom de module Fortran dans un paquet doit commencer par un préfixe unique. Deux options sont proposées.
in: नाम टकराव की संभावना को कम करने के लिए, पैकेज में किसी भी फोरट्रान मॉड्यूल का नाम एक अद्वितीय उपसर्ग के साथ शुरू होना चाहिए। दो विकल्प पेश किए गए हैं।
zh_cn: 为了减少名称冲突的机会，包中的任何Fortran模块名称必须以唯一的前缀开始。提供了两个选项。

source: Default Module names
fr: Noms de modules par défaut
in: डिफ़ॉल्ट मॉड्यूल नाम
zh_cn: 默认模块名称

source: The default option is always valid for all packages, as it is uniquely bound to the package name. It features a fortrannized package name, followed by a double underscore, with these rules:
fr: L'option par défaut est toujours valable pour tous les paquets, car elle est liée de manière unique au nom du paquet. Elle comporte un nom de paquet fortranisé, suivi d'un double trait de soulignement, avec les règles suivantes :
in: डिफ़ॉल्ट विकल्प हमेशा सभी पैकेजों के लिए मान्य होता है, क्योंकि यह विशिष्ट रूप से पैकेज के नाम से जुड़ा होता है। इसमें इन नियमों के साथ एक डबल अंडरस्कोर के बाद एक फोरट्रानाइज्ड पैकेज नाम दिया गया है:
zh_cn: 默认选项对所有软件包都是有效的，因为它与软件包名称唯一绑定。它的特点是一个transannized软件包名称，后面是一个双下划线，有这些规则：

source: Must begin with their package name;
fr: Doit commencer par le nom du paquet ;
in: उनके पैकेज के नाम से शुरू होना चाहिए;
zh_cn: 必须以其包装名称开头；

source: The ``default separator`` `__` between the package name chunk and what follows must be used;
fr: Le ``séparateur par défaut `` `__` entre le bloc de nom de package et ce qui suit doit être utilisé ;
in: ``डिफ़ॉल्ट विभाजक`` `__` पैकेज नाम चंक और उसके बाद के बीच का उपयोग किया जाना चाहिए;
zh_cn: 必须在软件包名称块和后面的内容之间使用``默认的分隔符`` `__`；
