Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Binary distributions are available for MacOS 11 (Catalina) and 12 (Big Sur) for x86\_64 architectures. For other platforms fpm will be built locally from source automatically.
de: Komilierte Distributionen sind für MacOS 11 (Catalina) und 12 (Big Sur) für x86\_64-Architekturen verfügbar. Für andere Plattformen wird fpm automatisch vom Quellcode erstellt.
es: Distribuciones binárias están disponibles for MacOS 11 (Catalina) y 12 (Big Sur) para arquitecturas x86\_64. Para otras plataformas fpm será construido local y automáticamente desde la fuente.
fr: Des distributions binaires sont disponibles pour macOS 11 (Catalina) et 12 (Big Sur) pour les architectures x86\_64. Pour les autres plates-formes, fpm sera automatiquement construit localement à partir des sources.
in: x86\_64 आर्किटेक्चर के लिए MacOS 11 (कैटालिना) और 12 (बिग सुर) के लिए बाइनरी डिस्ट्रीब्यूशन उपलब्ध हैं। अन्य प्लेटफॉर्म के लिए fpm स्वचालित रूप से स्रोत से स्थानीय रूप से बनाया जाएगा।
ja: x86\_64アーキテクチャのMacOS 11 (Catalina)と12 (Big Sur)ではバイナリが利用できます．他のプラットフォームでは，fpmは自動的にソースからビルドされます．
nl: Binaire distributies zijn voor MacOS 11 (Catalina) en 12 (Big Sur) met x86\_64-architecturen beschikbaar. Voor andere platforms wordt fpm automatisch uit de broncode gebouwd.
pt: Distribuição de binários estão disponíveis para MacOS 11 (Catalina) e 12 (Big Sur) para arquiteturas x86_64. Para outras plataformas fpm pode ser compilado localmente direto do código-fonte de forma automática.
zh_cn: 二进制发行版适用于MacOS 11（Catalina）和12（Big Sur），适用于x86\_64架构。对于其它平台，fpm将自动从源代码本地构建。

source: Fpm should be available and functional after those steps.
de: Nach diesen Schritten sollte fpm verfügbar und funktionsfähig sein.
es: Fpm deberia estar disponibles y funcional después de esos pasos.
fr: Fpm devrait être disponible et fonctionnel une fois ces étapes terminées.
in: उन चरणों के बाद एफपीएम उपलब्ध और कार्यात्मक होना चाहिए।
ja: これらの手順を実行すると，fpmは利用可能になります．
nl: Na deze stappen moet fpm volledig functioneren.
pt: Fpm deverá estar disponível e funcionando após este processo.
zh_cn: 在这些步骤之后，fpm应该可用且功能正常。

source: [![MacPorts package](https://repology.org/badge/version-for-repo/macports/fpm-fortran-package-manager.svg)](https://ports.macports.org/port/fpm/)
fr: [![paquet MacPorts](https://repology.org/badge/version-for-repo/macports/fpm-fortran-package-manager.svg)](https://ports.macports.org/port/fpm/)
pt: [![pacote para MacPorts](https://repology.org/badge/version-for-repo/macports/fpm-fortran-package-manager.svg)](https://ports.macports.org/port/fpm/)
zh_cn: [![MacPorts 包](https://repology.org/badge/version-for-repo/macports/fpm-fortran-package-manager.svg)](https://ports.macports.org/port/fpm/)

source: MacPorts package
fr: Paquet MacPorts
pt: Pacote para MacPorts
zh_cn: MacPorts 包

source: The Fortran Package Manager (fpm) is available via [macports](https://www.macports.org/) and can be installed with
es: El administrador de paquetes de Fortran, fpm, está disponible en [macports](https://www.macports.org/) y puede ser instalado con
fr: Le gestionnaire de paquets Fortran (fpm) est disponible via [macports](https://www.macports.org/) et peut être installé avec
pt: O Gerenciador de Pacotes Fortran (fpm) está disponível via [macports](https://www.macports.org/) e pode ser instalado com
zh_cn: Fortran软件包管理器（fpm）可以通过[macports](https://www.macports.org/)获得，并且可以通过以下方式安装

source: {fab}`apple` {fab}`linux` Conda package manager
de: {fab}`apple` {fab}`linux` Conda Paketverwaltung
es: {fab}`apple` {fab}`linux` Administrador de paquetes Conda
fr: {fab}`apple` {fab}`linux` Gestionnaire de paquets Conda
in: {fab}'apple' {fab}'linux' Conda पैकेज मैनेजर
ja: {fab}`apple` {fab}`linux` Condaパッケージ管理システムの利用
nl: {fab}`apple` {fab}`linux` Conda Paketverwaltung
pt: {fab}`apple` {fab}`linux` Gerenciador de pacotes Conda
zh_cn: {fab}`apple` {fab}`linux` Conda包管理器

source: [![Conda (channel only)](https://img.shields.io/conda/vn/conda-forge/fpm)](https://github.com/conda-forge/fpm-feedstock)
fr: [ ![Conda (canal uniquement)](https://img.shields.io/conda/vn/conda-forge/fpm)](https://github.com/conda-forge/fpm-feedstock)
pt: [![Conda (apenas o channel)](https://img.shields.io/conda/vn/conda-forge/fpm)](https://github.com/conda-forge/fpm-feedstock)

source: Conda (channel only)
fr: Conda (canal uniquement)
pt: Conda (apenas por channel)

source: Fpm is available on [conda-forge], to add conda-forge to your channels use:
de: Fpm ist auf [conda-forge] verfügbar. Um conda-forge zu nutzen muss es zu den verfügbaren Kanälen hinzugefügt werden:
es: Fpm está disponible sobre [conda-forge]. Para adicionar conda-forge a sus canales use:
fr: Fpm est disponible sur [conda-forge](https://conda-forge.org/) ; pour ajouter conda-forge à vos canaux, utilisez :
in: Fpm [conda-forge] पर उपलब्ध है, आपके चैनल के उपयोग में conda-forge जोड़ने के लिए:
ja: Fpmは[conda-forge]で公開されています．conda-forgeをチャンネルに追加するには，次のコマンドを使用します．
nl: Fpm is beschikbaar via [conda-forge]. Om conda-forge te gebruiken moet je het toevoegen aan je kanalen:
pt: O fpm está disponível no [conda-forge](https://conda-forge.org/), para adicionar o conda-forge aos seus canais use:
zh_cn: fpm可在conda-forge上找到，以将conda-forge添加到你的频道使用：

source: Fpm can be installed with:
de: Fpm kann mit folgenden Befehlen installiert werden:
es: Fpm puede ser instalado con:
fr: Fpm peut être installé avec :
in: एफ पी एम के साथ स्थापित किया जा सकता है:
ja: Fpmは，以下のコマンドによってインストールされます．
nl: Fpm kan met de volgende opdrachten geïnstalleerd worden:
pt: Fpm pode ser instalado com:
zh_cn: fpm可以以下命令安装：

source: Alternatively, if you want fpm to be always available directly install into your current environment with
de: Alternativ kann fpm auch direkt in die aktuelle Umgebung installiert werden mit
es: Alternativamente, si desea que fpm esté siempre disponible, instalelo en su ambiente actual con
fr: Alternativement, si vous voulez que fpm soit toujours disponible, installez-le directement dans votre environnement actuel avec
in: वैकल्पिक रूप से, यदि आप चाहते हैं कि एफपीएम हमेशा उपलब्ध हो, तो सीधे अपने वर्तमान वातावरण में स्थापित करें
ja: あるいは，fpmを常に利用できるようにしたい場合，次のコマンドを用いて現在の環境に直接インストールします．
nl: Als alternatief kan fpm ook direct in de huidige omgeving geïnstalleerd worden met
pt: Alternativamente, se você deseja que o fpm estejaa sempre disponível instale diretamente no seu ambiente de trabalho atual usando
zh_cn: 或者，如果你希望 fpm 始终可用，直接安装到当前环境中

source: The conda package manager can be installed from [miniforge](https://github.com/conda-forge/miniforge/releases) or from [miniconda](https://docs.conda.io/en/latest/miniconda.html).
de: Der conda-Paketverwaltung kann von [miniforge](https://github.com/conda-forge/miniforge/releases) oder von [miniconda](https://docs.conda.io/en/latest/miniconda.html) installiert werden.
es: El Administrador de paquetes Conda puede ser instalado desde [miniforge](https://github.com/conda-forge/miniforge/release) o desde [miniconda](https://docs.conda.io/en/latest/miniconda.html).
fr: Le gestionnaire de paquets conda peut être installé à partir de [miniforge](https://github.com/conda-forge/miniforge/releases) ou de [miniconda](https://docs.conda.io/en/latest/miniconda.html).
in: कोंडा पैकेज मैनेजर कहाँ से स्थापित किया जा सकता है[मिनीफोर्ज] (https://github.com/conda-फोर्ज/मिनीफोर्ज/रिलीज) या उससे
ja: condaパッケージ管理システムは，[miniforge](https://github.com/conda-forge/miniforge/releases)もしくは[miniconda](https://docs.conda.io/en/latest/miniconda.html)からインストールできます．
nl: De conda-packagemanager kan vanaf [miniforge](https://github.com/conda-forge/miniforge/releases) of vanaf [miniconda](https://docs.conda.io/en/latest/miniconda.html) geïnstalleerd worden.
pt: O gerenciador de pacotes conda pode ser instalado a partir do [miniforge](https://github.com/conda-forge/miniforge/releases) ou partindo do [miniconda](https://docs.conda.io/en/latest/miniconda.html).
zh_cn: conda 包管理器可以从[miniforge](https://github.com/conda-forge/miniforge/releases)或[miniconda](https://docs.conda.io/en/latest/miniconda.html)安装。

source: {fab}`apple` {fab}`linux` Spack package manager
fr: {fab}`apple` {fab}`linux` Gestionnaire de paquets Spack
in: {fab}'apple' {fab}'linux' Spack पैकेज मैनेजर
pt: {fab}`apple` {fab}`linux` Gerenciador de pacotes Spack
zh_cn: {fab}`apple` {fab}`linux` Spack包管理器

source: [![Spack package](https://repology.org/badge/version-for-repo/spack/fpm-fortran-package-manager.svg)](https://packages.spack.io/package.html?name=fpm)
fr: [ ![Paquet Spack](https://repology.org/badge/version-for-repo/spack/fpm-fortran-package-manager.svg)](https://packages.spack.io/package.html?name=fpm)
pt: [![pacote Spack](https://repology.org/badge/version-for-repo/spack/fpm-fortran-package-manager.svg)](https://packages.spack.io/package.html?name=fpm)
zh_cn: [![Spack 包](https://repology.org/badge/version-for-repo/spack/fpm-fortran-package-manager.svg)](https://packages.spack.io/package.html?name=fpm)

source: Spack package
fr: Paquet Spack
pt: Pacote Spack
zh_cn: Spack 包

source: Fpm is available with spack in its develop version. To install fpm from spack use
fr: Fpm est disponible avec spack dans sa version de développement. Pour installer fpm à partir de spack, utilisez
in: एफपीएम अपने विकसित संस्करण में स्पैक के साथ उपलब्ध है। स्पैक उपयोग से एफपीएम स्थापित करने के लिए
pt: Fpm está disponível no spack, em sua versão de desenvolvimento. Para instalar o fpm a partir do spack use
zh_cn: Fpm在spack的开发版本中是可用的。要从spack安装fpm，请使用

source: You can add `+openmp` to enable parallelization of the target compilation in fpm. To use fpm in your environment load it with
fr: Vous pouvez ajouter `+openmp` pour activer la parallélisation de la compilation dans fpm. Pour utiliser fpm dans votre environnement, chargez-le avec
in: आप लक्ष्य संकलन के समानांतरकरण को सक्षम करने के लिए `+ openmp` जोड़ सकते हैंfpm। अपने वातावरण में fpm का उपयोग करने के लिए इसे लोड करें
pt: Você pode usar a flag `+openmp` para habilitar a paralelização do alvo de compilação no fpm. Para usar o fpm no seu ambiente, carregue-o com
zh_cn: 你可以添加`+openmp`来启用fpm中目标编译的并行化。要在你的环境中使用fpm，可以用以下命令加载它

source: For more details check the package information [here](https://spack.readthedocs.io/en/latest/package_list.html#fpm).
es: Para mas detalles revisar la información del paquete [aquí](https://spack.readthedocs.io/en/latest/package_list.html#fpm).
fr: Pour plus de détails, consultez les informations sur le paquet [ici](https://spack.readthedocs.io/en/latest/package_list.html#fpm).
in: अधिक विवरण के लिए पैकेज जानकारी की जाँच करें[यहां] (https://spack.readthedocs.io/en/latest/package_list.html#fpm)।
pt: Para mais detalhes verifique as informações do pacote [aqui](https://spack.readthedocs.io/en/latest/package_list.html#fpm).
zh_cn: 更多细节请查看软件包信息[这里](https://spack.readthedocs.io/en/latest/package_list.html#fpm)。

source: {fab}`linux` Arch Linux user repository
de: {fab}`linux` Arch Linux Nutzer Repository
es: {fab}`linux` Repositorio de usuarios de Arch Linux
fr: {fab}`linux` Dépôt utilisateur Arch Linux
in: {fab} `linux` आर्क लिनक्स उपयोगकर्ता रिपॉजिटरी
ja: {fab}`linux` Arch Linuxユーザリポジトリの利用
nl: {fab}`linux` Arch Linux gebruikersrepository
pt: {fab}`linux` Repositório comunitário do Arch Linux (AUR)
zh_cn: {fab}`linux` Arch Linux用户存储库

source: [![AUR version](https://img.shields.io/aur/version/fortran-fpm)](https://aur.archlinux.org/packages/fortran-fpm) [![AUR version](https://img.shields.io/aur/version/fortran-fpm-bin)](https://aur.archlinux.org/packages/fortran-fpm-bin)
fr: [ ![Version AUR](https://img.shields.io/aur/version/fortran-fpm)](https://aur.archlinux.org/packages/fortran-fpm) [ ![Version AUR](https://img.shields.io/aur/version/fortran-fpm-bin)](https://aur.archlinux.org/packages/fortran-fpm-bin)
pt: [![Versão do AUR](https://img.shields.io/aur/version/fortran-fpm)](https://aur.archlinux.org/packages/fortran-fpm) [![AUR version](https://img.shields.io/aur/version/fortran-fpm-bin)](https://aur.archlinux.org/packages/fortran-fpm-bin)

source: AUR version
fr: Version AUR
pt: Versão AUR
zh_cn: AUR版本

source: The Arch Linux user repository (AUR) contains two packages for the Fortran Package Manager (fpm). With the [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) installs the statically linked Linux/x86\_64 binary from the release page, while the [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) package will bootstrap fpm from source.
de: Das Arch Linux Nutzer Repository (AUR) enthält zwei Pakete für den Fortran-Paketmanager (fpm). Mit dem [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) installiert die statisch verknüpfte Linux/x86\_64-Binärdatei aus der Release-Seite, während das [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) Paket fpm vom Quellcode baut.
es: El repositorio de usuarios de Arch Linux (AUR) contiene dos paquetes para el Administrador de paquetes de Fortran (fpm). Con el [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) instala el binario estáticamente enlazados Linux/x86\_64 desde la página de lanzamientos, mientras que el paquete [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) construirá fpm desde la fuente.
fr: Le dépôt utilisateur d'Arch Linux (AUR) contient deux paquets pour fpm. Le paquet [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) installe le binaire Linux/x86\_64 lié statiquement, à partir de la page de publication, tandis que le paquet [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) installe fpm à partir des sources.
in: आर्क लिनक्स यूजर रिपॉजिटरी (AUR) में फोरट्रान पैकेज मैनेजर (fpm) के लिए दो पैकेज हैं। [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) के साथ। रिलीज पेज से स्टैटिकली लिंक्ड Linux/x86\_64 बाइनरी इंस्टॉल करता है, जबकि [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) पैकेज स्रोत से
ja: Arch Linuxユーザリポジトリ（AUR）には，Fortranパッケージマネージャ（fpm）のパッケージが二つ存在しています． [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/)は，静的にリンクされたLinux/x86\_64バイナリをリリースページからインストールし，他方の[fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/)はfpmをソースから自己的に構築します．
nl: De Arch Linux gebruikersrepository (AUR) bevat twee pakketten voor de Fortran-packagemanager (fpm). [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) is voor de statisch gelinkte Linux/x86\_64-Bin executable van de release-site, terwijl het [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) pakket fpm uit de broncode bouwt.
pt: O repositório da comunidade do Arch Linux (AUR) contém dois pacotes para o Gerenciador de Pacotes Fortran (fpm). O pacote [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) instala um binário estático Linux/x86\_64 da página de lançamento, já o pacote [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) vai compilar o fpm inicial direto do código-fonte.
zh_cn: Arch Linux 用户存储库（AUR）包含两个 Fortran 包管理器（fpm）包。使用 [fortran-fpm-bin](https://aur.archlinux.org/packages/fortran-fpm-bin/) 从发布页面安装静态链接的 Linux/x86\_64 二进制文件，而 [fortran-fpm](https://aur.archlinux.org/packages/fortran-fpm/) 软件包将从源代码引导安装 fpm。

source: Select one of the PKGBUILDs and retrieve it with
de: Wähle eines der PKGBUILDs aus und lade es mit
es: Seleccione uno de los PKGBUILDs y recuperelo con
fr: Sélectionnez un des PKGBUILDs et chargez-le avec
in: PKGBUILDs में से एक का चयन करें और इसे पुनः प्राप्त करें
ja: 一つのPKGBUILDを選び，次のコマンドで取得します．
nl: Kies een van de PKGBUILDs en haal het op met:
pt: Selecione um dos arquivos PKGBUILD e baixe-o usando
zh_cn: 选择其中一个 PKGBUILD 并使用

source: As usual, first inspect the PKGBUILD before building it. After verifying the PKGBUILD is fine, build the package with
de: Wie immer, überprüfe zunächst das PKGBUILD vor der Benutzung. Nach der Überprüfung der PKGBUILD ist es möglich, das Paket mit zu bauen
es: Como es usual, primero revise el PKGBUILD antes de construirlo. Después de verificar que el PKGBUILD está correcto, construya el paquete con
fr: Comme d'habitude, inspectez d'abord le PKGBUILD avant de le construire. Après avoir vérifié que le PKGBUILD est correct, construisez le paquet avec
in: हमेशा की तरह, PKGBUILD को बनाने से पहले उसका निरीक्षण करें। PKGBUILD के ठीक होने की पुष्टि करने के बाद, पैकेज का निर्माण करें
ja: 通常，選択したPKGBUILDをビルドする前に，検査を行います．PKGBUILDが正常であると確認した後，次のコマンドでパッケージをビルドします．
nl: Als altijd, inspecteer eerst de PKGBUILD voor je het bouwt. Als alles in orde is, bouw dan het pakket met:
pt: Naturalmente, primeiro você deve inspecionar o PKGBUILD antes compilá-lo. Após verificar que o arquivo PKGBUILD parece seguro, compile o pacote com
zh_cn: 像往常一样，在构建 PKGBUILD 之前，请先检查它。验证 PKGBUILD 是否正常后，使用

source: Once the build passed pacman will ask to install the fpm package.
de: Wenn das Paket erfolgreich gebaut ist, kann es mit pacman installiert werden.
es: Una vez la construcción haya terminado, pacman le pedirá que instale el paquete fpm.
fr: Une fois la construction réussie, pacman demandera l'installation du paquet fpm.
in: एक बार निर्माण पारित होने के बाद पैकमैन एफपीएम पैकेज स्थापित करने के लिए कहेगा।
ja: ビルドが成功すると，pacmanはfpmパッケージをインストールするかを確認してきます．
nl: Als het pakket met succes gebouwd is, kan het met pacman geïnstalleerd worden.
pt: Uma vez que a compilação tenha terminado, o pacman vai perguntar sobre a instalação do pacote fpm.
zh_cn: 一旦构建通过，pacman 将询问是否安装fpm包。

source: OpenBSD ports
fr: Ports OpenBSD
pt: Versões para o OpenBSD
zh_cn: OpenBSD端口

source: OpenBSD port
fr: Port OpenBSD
pt: Versão para o OpenBSD
zh_cn: OpenBSD端口

source: A port for OpenBSD is available in the default port tree. To install fpm install the *devel/fpm* port with
fr: Un port pour OpenBSD est disponible dans l'arbre des ports par défaut. Pour installer fpm, installez le port *devel/fpm* avec
pt: Uma versão para o OpenBSD está disponível na port tree padrão. Para instalar o fpm, instale a versão *devel/fpm* com
zh_cn: 在默认的端口树中有一个用于OpenBSD的端口。要安装fpm，请安装*devel/fpm*端口，使用

source: Building from source
de: Bauen von Quellcode
es: Construyendo desde la fuente
fr: Compiler à partir des sources
in: स्रोत से निर्माण
ja: ソースからのビルド
nl: Bouwen vanaf de broncode
pt: Compilando o código-fonte
zh_cn: 从源代码构建

source: To build fpm from source get the latest fpm source, either by cloning the repository from GitHub with
de: Um fpm von Quellcode zu bauen, hole die letzte fpm-Quelldatei, entweder durch das Klonen des Repositories von GitHub mit
es: Para construir fpm desde la fuente, obtenga el último lanzamiento de la fuente clonando el repositorio desde GitHub con
fr: Pour construire fpm à partir des sources, récupérez les dernières sources de fpm, soit en clonant le dépôt depuis GitHub avec
in: स्रोत से एफपीएम बनाने के लिए नवीनतम एफपीएम स्रोत प्राप्त करें, या तो गिटहब से रिपॉजिटरी की क्लोनिंग करके
ja: fpmをソースからビルドするには，以下のコマンドでGitHubリポジトリをクローンし，最新のfpmのソースを入手します．
nl: Om fpm vanaf de broncode te bouwen, haal eerst het meest recente fpm-bronbestand op door het clonen van de repositories op GitHub met:
pt: Para compilar o fpm a partir de seu código-fonte baixe sua versão mais recente, seja clonando o repositório do GitHub com
zh_cn: 要从源代码构建 fpm，请获取最新的 fpm 源代码，方法是从 GitHub 克隆存储库

source: or by downloading a source tarball from the latest source
de: oder durch das Herunterladen eines Tarballs mit den letzten Quellen
es: o descargando un archivo comprimido de la fuente mas reciente
fr: ou en téléchargeant une archive tar de la dernière version des sources
in: या नवीनतम स्रोत से स्रोत टारबॉल डाउनलोड करके
ja: もしくは，最新ソースのtarballをダウンロードします．
nl: of door het ophalen van een tarball met de laatste broncode.
pt: ou através do download de um arquivo comprimido contendo o código-fonte mais recente
zh_cn: 或从最新源下载源代码压缩包

source: The available install script allows to bootstrap fpm by using just a Fortran compiler, git and network access. Invoke the script to start the bootstrap build
de: Das installierende Skript erlaubt es, fpm durch einen Fortran-Compiler, Git und Netzwerkzugriff zu bauen. Starte das Skript, um den Bootstrap-Bau zu starten
es: La sequencia de comandos disponible permite iniciar fpm usando solo un compilador de Fortran, git y acceso a la red. Ejecute la sequencia de comandos para iniciar la construcción
fr: Le script d'installation disponible permet d'amorcer l'installation de fpm en utilisant simplement un compilateur Fortran, git et un accès réseau. Appelez le script pour amorcer la construction
in: उपलब्ध इंस्टाल स्क्रिप्ट सिर्फ एक फोरट्रान कंपाइलर, गिट और नेटवर्क एक्सेस का उपयोग करके fpm को बूटस्ट्रैप करने की अनुमति देती है। बूटस्ट्रैप बिल्ड शुरू करने के लिए स्क्रिप्ट को आमंत्रित करें
ja: 利用可能なインストールスクリプトを用いると，Fortranコンパイラ，git，ネットワークアクセスのみでfpmを自己的に構築できます．自己構築を開始するために，次のようにスクリプトを実行します．
nl: Het installatiescript staat je toe fpm via een Fortran-compiler, Git en netwerktoegang te bouwen. Start het script voor het bouwen van de bootstrap:
pt: O script de instalação disponível permite compilar o fpm inicial usando apenas um compilador Fortran, o git e acesso a rede. Rode o script para iniciar o processo de compilação
zh_cn: 可用的安装脚本允许仅使用 Fortran 编译器，git 和网络访问来引导安装 fpm。调用脚本以启动引导程序构建

source: Fpm will be installed in ``~/.local/bin/fpm``.
de: Fpm wird in ``~/.local/bin/fpm`` installiert.
es: Fpm será instalado en ``~/.local/bin/fpm``.
fr: Fpm sera installé dans ``~/.local/bin/fpm``.
in: Fpm को ``~/.local/bin/fpm`` में इंस्टॉल किया जाएगा।
ja: Fpmは``~/.local/bin/fpm``にインストールされます．
nl: Fpm wordt in ``~/.local/bin/fpm`` geïnstalleerd.
pt: Fpm será instalado em ``~/.local/bin/fpm``.
zh_cn: fpm将安装在``~/.local/bin/fpm``。

source: Building the bootstrapper binary from the single source file version might take a few seconds, which might make the install script look like it is hanging.
de: Das Bauen des Bootstrapper-Binaries aus der einzelnen Quelldatei kann ein paar Sekunden dauern, was das Skript scheinbar zum einfrieren bringt.
es: Construir el binario de inicialización a partir de la versión de archivo de fuente única puede tardar algunos segundos, lo que puede hacer pensar que la secuencia de commandos dejó de responder.
fr: La construction du binaire d'amorçage à partir du fichier source unique peut prendre quelques secondes, ce qui peut donner l'impression que le script d'installation est planté.
in: एकल स्रोत फ़ाइल संस्करण से बूटस्ट्रैपर बाइनरी बनाने में कुछ सेकंड लग सकते हैं, जिससे इंस्टॉल
ja: 単一版のソースファイルから自己構築用バイナリをビルドすると，数秒かかる場合があるため，インストールスクリプトが停止しているようにみえるかもしれません．
nl: Het bouwen van de bootstrap-executable vanaf het enkele bronbestand vergt een paar seconden, waardoor het script lijkt te bevriezen.
pt: A construção de um binário inicial partindo da versão de código-fonte único pode demorar alguns segundos, o que pode fazer com que o script pareça congelado.
zh_cn: 从单个源文件版本生成引导程序二进制文件可能需要一些时间，这可能会使安装脚本看起来像是未响应的。

source: The installation location can be adjusted by passing the ``--prefix=/path/to/install`` option.
de: Die Installations-Pfad kann mit der Option ``--prefix=/Pfad/zum/Installieren`` angepasst werden.
es: El lugar para instalación puede ser definido usando la opción ``--prefix=/ruta/para/instalar``.
fr: L'emplacement de l'installation peut être modifié en passant l'option ``--prefix=/path/to/install``.
in: स्थापना स्थान ``--prefix=/path/to/install`` विकल्प पास करके समायोजित किया जा सकता है।
ja: インストール場所は``--prefix=/path/to/install``オプションを渡すことで変更できます．
nl: De locatie voor de installatie kan met de optie ``--prefix=/pad/voor/installatie`` aangepast worden.
pt: O local da instalação pode ser ajustado passando a opção ``--prefix=/caminho/para/instalar``.
zh_cn: 可以通过传递选项``--prefix=/path/to/install``来调整安装位置。
