Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Dependencies can be declared in the *dependencies* table in the manifest root or the [*executable*](#executable-targets) or [*test*](#test-targets) sections. When declared in the manifest root the dependencies are exported with the project.
de: Abhängigkeiten können in der *dependencies*-Tabelle im Manifest-Wurzel- Eintrag oder in den [*executable*](#executable-targets) oder [*test*](#test-targets)-Abschnitten angegeben werden. Wenn sie im Manifest-Wurzel-Eintrag angegeben werden, werden sie mit dem Projekt exportiert.
es: Las dependencias se pueden declarar en la tabla *dependencies* en el manifiesto raiz o en las secciones [*executable*](#executable-targets) o [*test*](#test-targets). Cuando se declara en el manifiesto raiz, las dependencias se exportan con el proyecto.
fr: Les dépendances peuvent être déclarées dans la table *dependencies* à la racine du manifeste ou dans les sections [*executable*](#executable-targets) ou [*test*](#test-targets). Lorsqu'elles sont déclarées à la racine du manifeste, les dépendances sont exportées avec le projet.
in: निर्भरताओं को *निर्भरता* तालिका में प्रकट मूल या [*निष्पादन योग्य*] (#executable-लक्ष्य) या [*परीक्षण*](#test-लक्ष्य) अनुभागों में घोषित किया जा सकता है। जब मैनिफेस्ट रूट में घोषित किया जाता है तो निर्भरताओं को परियोजना के साथ निर्यात किया जाता है।
ja: 依存関係は，マニフェスト直下，あるいは[*executable*](#executable-targets)か[*test*](#test-targets)設定項目に，*dependencies*のテーブルとして宣言できます．マニフェスト直下に宣言した依存関係は，プロジェクトと共に外部に展開されます．
nl: Afhankelijkheden kunnen in de *dependencies*-tabel in de hoofdentry van het manifestbestand of in de secties [*executable*](#executable-targets) of [*test*](#test-targets) aangegeven worden. Als ze in de hoofdentry worden aangegeven, worden ze met het project geëxporteerd.
pt: Dependências podem ser declaradas na tabela *dependencies* na raiz do manifesto, ou nas seções [*executable*](#executable-targets) ou [*test*](#test-targets). Quando declaradas na raiz as dependências serão exportadas com o projeto.
zh_cn: 可以在清单根或可执行文件（[*executable*](#executable-targets)）或测试（[*test*](#test-targets)）部分的依赖项（*dependencies*）表中声明依赖项。在清单根目录中声明时，依赖项将与项目一起导出。

source: Local dependencies
de: Lokale Abhängigkeiten
es: Dependencias locales
fr: Dépendances locales
in: स्थानीय निर्भरताएँ
ja: ローカルな依存関係の指定
nl: Lokale afhankelijkheden
pt: Dependências locais
zh_cn: 本地依赖项

source: To declare local dependencies use the *path* entry.
de: Um lokale Abhängigkeiten anzugeben, muss der *path*-Eintrag genutzt werden.
es: Para declarar dependencias locales, utilice la entrada *path*.
fr: Pour déclarer des dépendances locales, utilisez l'entrée *path*.
in: स्थानीय निर्भरताओं की घोषणा करने के लिए *पथ* प्रविष्टि का उपयोग करें।
ja: ローカルな依存関係を宣言するには，*path*を用います．
nl: Om lokale afhankelijkheden aan te geven, moet dr *path*-entry gebruikt worden.
pt: Para declarar dependências locais use a entrada *path*.
zh_cn: 若要声明本地依赖项，请使用路径（*path*）条目。

source: The local dependency path is given relative to the ``fpm.toml`` it is written to, and uses ``/`` as the path separator on all platforms.
de: Lokale Abhängigkeits-Pfade sind relativ zum Projekt-Wurzelverzeichnis angegeben und verwenden ``/`` als Pfad-Trenner auf allen Plattformen.
es: La ruta de dependencia local se proporciona en relación con ``fpm.toml`` en el que se escribe, y utiliza ``/`` como separador de ruta en todas las plataformas.
fr: Les chemins des dépendances locales sont donnés relativement à l'emplacement du manifeste ``fpm.toml`` et utilisent ``/`` comme séparateur de chemin sur toutes les plateformes.
in: स्थानीय निर्भरता पथ ``fpm.toml`` के सापेक्ष दिया जाता है जिसे लिखा जाता है, और सभी प्लेटफॉर्म पर पथ विभाजक के रूप में ``/`` का उपयोग करता है।
pt: Os caminhos para dependências locais são dados relativos à localização do arquivo ``fpm.toml`` e usam ``/`` como separador de caminho em todas as plataformas.
zh_cn: 本地依赖路径是相对于写入它的 ``fpm.toml`` 给出的，并在所有平台上使用 ``/`` 作为路径分隔符。

source: Global config file
fr: Fichier de configuration globale
zh_cn: 全局配置文件

source: The global configuration file can be used to set default options across all fpm projects on the system. It is, by default, located at `~/.local/share/fpm/config.toml` on Unix-like machines and `%APPDATA%\local\fpm\config.toml` on Windows and must be parsable to a TOML structure. It can be used to configure [registry settings](#registry-settings).
fr: Le fichier de configuration globale peut être utilisé pour définir des options par défaut pour tous les projets fpm du système. Il est, par défaut, situé à l'emplacement `~/.local/share/fpm/config.toml` sur les machines de type Unix et `%APPDATA%\local\fpm\config.toml` sur Windows et doit pouvoir être analysé comme une structure TOML. Il peut être utilisé pour configurer les [paramètres du registre](#registry-settings).
zh_cn: 全局配置文件可用于设置系统中所有fpm项目的默认选项。默认情况下，它位于Unix-like机器上的`~/.local/share/fpm/config.toml`和Windows上的`%APPDATA%\local\fpm/config.toml`，并且必须可解析为TOML结构。它可以用来配置[注册表设置](#registry-settings)。

source: Registry settings
fr: Paramètres du registre
pt: Configurações dos registros
zh_cn: 注册表设置

source: The registry settings can be used to customize the registry for all projects. If no registry is specified, the packages will be fetched via HTTP from the [official registry](https://registry-frontend.vercel.app/). The registry settings are specified in the [global config file](#global-config-file).
fr: Les paramètres du registre peuvent être utilisés pour personnaliser le registre pour tous les projets. Si aucun registre n'est spécifié, les paquets seront récupérés via HTTP à partir du [registre officiel](https://registry-frontend.vercel.app/). Les paramètres du registre sont spécifiés dans le [fichier de configuration globale](#global-config-file).
zh_cn: 注册表设置可以用来为所有项目定制注册表。如果没有指定注册表，软件包将通过HTTP从[官方注册表](https://registry-frontend.vercel.app/)获取。注册表设置在[全局配置文件](#global-config-file)中指定。

source: Registry cache
fr: Cache du registre
zh_cn: 注册表缓存

source: The registry cache contains the source code of previously downloaded packages. It will first be searched for existing packages that satify the requirements of the requesting project before the package is downloaded. The default cache location is `~/.local/share/fpm/dependencies` on Unix-like machines and `%APPDATA%\local\fpm\dependencies` on Windows. The location of the cache can be changed by setting the `cache_path` in the global config file:
fr: Le cache du registre contient le code source des paquets précédemment téléchargés. Il sera d'abord interrogé pour les paquets existants qui satisfont aux exigences du projet demandeur avant que le paquet ne soit téléchargé. L'emplacement par défaut du cache est `~/.local/share/fpm/dependencies` sur les machines de type Unix et `%APPDATA%\local\fpm\dependencies` sur Windows. L'emplacement du cache peut être modifié en définissant `cache_path` dans le fichier de configuration globale :
zh_cn: 注册表缓存包含以前下载的软件包的源代码。在下载软件包之前，它将首先搜索符合请求项目要求的现有软件包。默认的缓存位置在类似Unix的机器上是`~/.local/share/fpm/dependencies`，在Windows上是`%APPDATA%/local/fpm/dependencies`。缓存的位置可以通过在全局配置文件中设置`cache_path`来改变：

source: Custom registry
fr: Registre personnalisé
pt: Registro customizado
zh_cn: 自定义注册表

source: If you want to use a custom registry, you can specify it in the global config file:
fr: Si vous souhaitez utiliser un registre personnalisé, vous pouvez le spécifier dans le fichier de configuration globale :
zh_cn: 如果你想使用一个自定义的注册表，你可以在全局配置文件中指定它：

source: Your registry must implement the same [API](https://registry-apis.vercel.app/apidocs/) as the official registry.
fr: Votre registre doit mettre en œuvre la même [API](https://registry-apis.vercel.app/apidocs/) que le registre officiel.
zh_cn: 你的注册表必须实现与官方注册表相同的[API](https://registry-apis.vercel.app/apidocs/)。

source: Local registry
fr: Registre local
pt: Registro Local
zh_cn: 本地注册表

source: Use the following configuration if you want to set up a local registry:
fr: Utilisez la configuration suivante si vous souhaitez mettre en place un registre local :
zh_cn: 如果你想设置一个本地注册表，请使用以下配置：

source: fpm will search this directory for packages and will not download packages from the internet or fetch packages from the cache.
fr: fpm recherchera les paquets dans ce répertoire et ne téléchargera pas de paquets depuis internet et ne récupérera pas de paquets depuis le cache.
zh_cn: fpm会在这个目录下搜索软件包，而不会从互联网上下载软件包或从缓存中获取软件包。

source: The directory must be structured the way fpm expects it to be. A package must be located in a directory named after the namespace name, followed by the name of the package and the package version. For example, the package `my-package` with version `0.1.0`, which is part of `my-namespace`, must be located in the directory `<path_to_local_registry>/my-namespace/my-package/0.1.0` on Unix-like systems. The package directory must contain an `fpm.toml` file that has the package metadata. The manifest must therefore be located at `<path_to_local_registry>/my-namespace/my-package/0.1.0/fpm.toml`.
fr: Le répertoire doit être structuré selon le modèle attendu par fpm. Un paquet doit être situé dans un répertoire nommé d'après le nom de l'espace de noms, suivi du nom du paquet et de sa version. Par exemple, le paquet `my-package` avec la version `0.1.0`, qui fait partie de `my-namespace`, doit se trouver dans le répertoire `<path_to_local_registry>/my-namespace/my-package/0.1.0` sur les systèmes de type Unix. Le répertoire du paquet doit contenir un fichier `fpm.toml` qui contient les métadonnées du paquet. Le manifeste doit donc se trouver à l'adresse `<path_to_local_registry>/my-namespace/my-package/0.1.0/fpm.toml`.
zh_cn: 该目录必须按照fpm所期望的方式来结构化。一个软件包必须位于以命名空间名称命名的目录中，后面是软件包的名称和软件包的版本。例如，版本为`0.1.0'的`my-package`包是`my-namespace`的一部分，在类似Unix的系统中必须位于`<path_to_local_registry>/my-namespace/my-package/0.1.0`目录下。软件包目录必须包含一个`fpm.toml`文件，其中有软件包元数据。因此，清单必须位于`<path_to_local_registry>/my-namespace/my-package/0.1.0/fpm.toml`。

source: If a specific [version](#version) is requested, fpm will look for that version in the local registry. If you do not specify a version, fpm will look for the version with the highest precedence.
fr: Si une [version](#version) spécifique est demandée, fpm recherchera cette version dans le registre local. Si vous ne spécifiez aucune version, fpm recherchera la version la plus élevée.
zh_cn: 如果要求一个特定的[版本](#version)，fpm将在本地注册表中寻找该版本。如果你没有指定一个版本，fpm将寻找优先级最高的版本。

source: Dependencies from version control systems
de: Abhängigkeiten von Version-Kontrollsystemen
es: Dependencias de los sistemas de control de versiones
fr: Dépendances issues de systèmes de contrôle de version
in: संस्करण नियंत्रण प्रणाली से निर्भरताएँ
ja: バージョンコントロールシステムからの依存関係の指定
nl: Afhankelijkheden van versiebeheersystemen
pt: Dependências a partir de sistemas de controle de versão
zh_cn: 来自版本控制系统的依赖关系

source: Dependencies can be specified by the projects git repository.
de: Abhängigkeiten können durch die Git-Repository des Projekts angegeben werden.
es: Las dependencias pueden ser especificadas por el repositorio git de proyectos.
fr: Les dépendances peuvent être spécifiées par le dépôt git des projets.
in: निर्भरताएँ प्रोजेक्ट गिट रिपॉजिटरी द्वारा निर्दिष्ट की जा सकती हैं।
ja: プロジェクトのgitリポジトリから依存関係を指定できます．
nl: Afhankelijkheden kunnen via een Git-repository van het project aangegeven worden.
pt: Dependências podem ser especificadas a partir de repositórios git.
zh_cn: 依赖项可以由项目git存储库指定。

source: To use a specific upstream branch declare the *branch* name with
de: Um einen bestimmten Branch des Upstreams anzugeben, muss der *branch*-Name mit angegeben werden
es: Para usar una rama ascendente específica, declare el nombre de la *branch* con
fr: Pour utiliser une branche amont spécifique, déclarez la branche avec
in: किसी विशिष्ट अपस्ट्रीम शाखा का उपयोग करने के लिए *शाखा* नाम की घोषणा करें
ja: 特定の上流ブランチを利用するには，*branch*の名前を次のように宣言します．
nl: Om een bepaalde branch van de upstream repository aan te geven, moet de *branch*-naam gespecificeerd werden.
pt: Para usar um ramo upstream específico declare o nome *branch* usando
zh_cn: 要使用特定的上游分支（*branch*），请使用

source: Alternatively, reference tags by using the *tag* entry
de: Alternativ können Referenz-Tags durch den Eintrag *tag* verwendet werden
es: Alternativamente, haga referencia a las etiquetas mediante la entrada *tag*
fr: Vous pouvez également indiquer les versions en utilisant l'entrée *tag*
in: वैकल्पिक रूप से, *टैग* प्रविष्टि का उपयोग करके संदर्भ टैग
ja: または，*tag*を用いてタグを参照します．
nl: Als alternatief kunnen referentie-tags via een entry *tag* gebruikt worden.
pt: Alternativamente, referencie tags usando a entrada *tag*
zh_cn: 或者，使用标签条目引用标签（*tag*）

source: To pin a specific revision specify the commit hash in the *rev* entry
de: Um eine bestimmte Revision festzulegen, muss der Commit-Hash im *rev*-Eintrag angegeben werden
es: Para anclar una revisión específica, brinde el hash de confirmación en la entrada *rev*
fr: Pour fixer une version précise, indiquez le hachage du commit dans l'entrée *rev*
in: किसी विशिष्ट संशोधन को पिन करने के लिए *rev* प्रविष्टि में प्रतिबद्ध हैश निर्दिष्ट करें
ja: 特定のリビジョンに固定するには，*rev*にコミットハッシュを指定します．
nl: Om een bepaalde revisie vast te leggen, moet de hash van de betreffende commit in een *rev*-entry aangegeven worden.
pt: Para fixar uma versão específica, identifique o hash do commit na entrada *rev*
zh_cn: 要固定特定修订版，请在修订版（*rev*）条目中指定提交哈希

source: For more verbose layout use normal tables rather than inline tables to specify dependencies
de: Für eine ausführlichere Layout-Darstellung können normal-Tabellen statt inline-Tabellen zur Abhängigkeits-Spezifikation verwendet werden
es: Para un diseño más detallado, use tablas normales en lugar de tablas en línea para especificar las dependencias
fr: Pour une présentation plus verbeuse, utilisez une table TOML standard plutôt qu'une table en ligne pour spécifier les dépendances
in: अधिक वर्बोज़ लेआउट के लिए निर्भरताएँ निर्दिष्ट करने के लिए इनलाइन तालिकाओं के बजाय सामान्य तालिकाओं का उपयोग करें
ja: インラインではなく通常のテーブルを利用すると，より冗長なレイアウトで依存関係が指定できます．
nl: Voor een uitgebreide layout kunnen normale tabellen gebruikt worden in plaats van inline-tabellen om afhankelijkheden te specificeren."
pt: Para um leiaute mais verboso use tabelas normais em vez de tabelas em linha, ao especificar dependências
zh_cn: 对于更详细的布局，请使用普通表而不是内联表来指定依赖项

source: Dependencies from a registry
fr: Dépendances à partir d'un registre
zh_cn: 来自注册表的依赖性

source: Namespace
fr: Espace de noms
zh_cn: 命名空间

source: Packages obtained from a registry (both remote and local) are required to specify a namespace, which provides a way to uniquely identify and differentiate packages with identical names. The namespace is declared in the manifest (`fpm.toml`).
fr: Les paquets obtenus à partir d'un registre (distant ou local) doivent spécifier un espace de noms, qui permet d'identifier et de différencier de manière unique les paquets ayant des noms identiques. L'espace de noms est déclaré dans le manifeste (`fpm.toml`).
zh_cn: 从注册中心获得的包（包括远程和本地）需要指定一个命名空间，它提供了一种唯一识别和区分名称相同的包的方法。命名空间在清单（`fpm.toml`）中声明。

source: This will prompt fpm to download the newest version of "my-package", which belongs to "my-namespace", from the registry.
fr: fpm est alors invité à télécharger la dernière version de "my-package", qui appartient à "my-namespace", depuis le registre.
zh_cn: 这将促使fpm从注册表中下载属于 "my-namespace"的 "my-package"的最新版本。

source: Version
fr: Version du projet
pt: Versão
zh_cn: 版本

source: If you want to download a specific version of a package instead of the newest one available, you can specify the version (`v`) in the manifest.
fr: Si vous souhaitez télécharger une version spécifique d'un paquet plutôt que la plus récente, vous pouvez spécifier la version (`v`) dans le manifeste.
zh_cn: 如果你想下载一个特定版本的软件包，而不是最新的可用版本，你可以在清单中指定版本（`v`）。

source: Development dependencies
de: Entwicklungsabhängigkeiten
es: Dependencias de desarrollo
fr: Dépendances de développement
in: विकास निर्भरता
ja: 開発時の依存関係の指定
nl: Afhankelijkheden voor ontwikkeling
pt: Dependências de desenvolvimento
zh_cn: 开发依赖关系

source: Development dependencies allow to declare *dev-dependencies* in the manifest root, which are available to all tests but not exported with the project.
de: Entwicklungsabhängigkeiten ermöglichen es, *dev-dependencies* im Manifest-Wurzel-Eintrag anzugeben, die für alle Tests verfügbar sind, aber nicht mit dem Projekt exportiert werden.
es: Las dependencias de desarrollo permiten declarar *dev-dependencies* en manifiesto de la raiz, que están disponibles para todas las pruebas pero no se exportan con el proyecto.
fr: Les dépendances de développement permettent de déclarer des *dev-dependencies* dans la racine du manifeste, disponibles pour tous les tests mais pas exportées avec le projet.
in: विकास निर्भरताएँ मेनिफेस्ट रूट में *देव-निर्भरता* घोषित करने की अनुमति देती हैं, जो सभी परीक्षणों के लिए उपलब्ध हैं लेकिन प्रोजेक्ट के साथ निर्यात नहीं किए गए हैं।
ja: 開発時の依存関係は，マニフェスト直下の*dev-dependencies*設定項目で宣言できます．これは全てのテストで利用できますが，他のプロジェクトには展開されません．
nl: Afhankelijkheden die een rol spelen bij de ontwikkeling zijn aan te geven via de entry *dev-dependencies* in de hoofdentry van het manifest. Ze zijn beschikbaar voor alle testen, maar worden niet geëxporteerd.
pt: São permitidas as dependências de desenvolvimento declarar *dev-dependencies* na raiz do manifesto, que estão disponíveis para todos os testes porém não são exportadas com o projeto.
zh_cn: 开发依赖项允许在清单根目录中声明开发依赖项（*dev-dependencies*），这些依赖项可用于所有测试，但不能随项目一起导出。

source: Installation configuration
de: Installations-Konfiguration
es: Cofiguración de instalación
fr: Configuration de l'installation
in: स्थापना विन्यास
ja: インストール設定
nl: Installatieconfiguratie
pt: Configuração da instalação
zh_cn: 安装配置

source: In the *install* section components for the installation can be selected. By default only executables are installed, library projects can set the *library* boolean to also installatation the module files and the archive.
de: In den *install*-Abschnitten können Komponenten für die Installation ausgewählt werden. Standardmäßig werden nur ausführbare Projekte installiert, Library-Projekte können das *library*-Attribut auf *true* setzen, um die Module-Dateien auch zu installieren und das Archiv.
es: En la sección *install* se pueden seleccionar los componentes para la instalación. De forma predeterminada, solo se instalan los ejecutables, los proyectos de biblioteca pueden configurar el booleano *library* para instalar también los archivos del módulo y el archivo.
fr: Dans la section *install*, les composants à installer peuvent être sélectionnés. Par défaut, seuls les exécutables sont installés. Les projets de type bibliothèque peuvent définir le booléen *library* pour installer également les fichiers module et l'archive.
in: *इंस्टॉल* सेक्शन में इंस्टॉलेशन के लिए घटकों का चयन किया जा सकता है। डिफ़ॉल्ट रूप से केवल निष्पादन योग्य स्थापित होते हैं, लाइब्रेरी प्रोजेक्ट * लाइब्रेरी * बूलियन को मॉड्यूल फ़ाइलों और संग्रह को भी स्थापित करने के लिए सेट कर सकते हैं।
ja: *install*設定項目では，インストールする対象を選択できます．標準では，実行ファイルのみがインストールされます．ライブラリを作成するプロジェクトでは，*library*に真値を設定することで，モジュールファイルやアーカイブもインストールするように設定できます．
nl: In de *install*-sectie kunnen componenten voor de installatie geselecteerd worden. Standaard worden alleen de executables geïnstalleerd. Bij bibliotheekprojecten kan het *library*-kenmerk op *true* gezet worden, om de bibliotheek en de modulebestanden ook te installeren.
pt: Na seção *install* os componentes para a instalação podem ser selecionados. Por padrão, apenas executáveis são instalados, projetos do tipo biblioteca podem definir o booleano *library* para também instalar os arquivos de módulo e o archive.
zh_cn: 在安装（*install*）部分中，可以选择安装的组件。默认情况下，仅安装可执行文件，库项目可以将库（*library*）布尔值设置为同时安装模块文件和归档文件。

source: *Example*
de: *Beispiel*
es: *Ejemplo*
fr: *Exemple*
in: *उदाहरण*
ja: **例**
nl: *Voorbeeld*
pt: *Exemplo*
zh_cn: *例如：*

source: Preprocessor configuration
de: Konfiguration des Präprozessors
es: Configuración del preprocesador
fr: Configuration du préprocesseur
in: प्रीप्रोसेसर कॉन्फ़िगरेशन
pt: Configuração de pré-processamento
zh_cn: 预处理器配置

source: Under the *preprocess* section, you can specify one or more preprocessor to use in an fpm project.
de: Unter dem Abschnitt *preprocess* können ein oder mehrere Präprozessoren angeben werden, die in einem fpm-Projekt verwendet werden sollen.
es: En la sección *preprocesamiento*, puede especificar uno o más preprocesadores para usar en un proyecto fpm.
fr: Dans la section *preprocess*, vous pouvez spécifier un ou plusieurs préprocesseurs à utiliser dans votre projet fpm.
in: *प्रीप्रोसेस* सेक्शन के तहत, आप एफपीएम प्रोजेक्ट में उपयोग करने के लिए एक या अधिक प्रीप्रोसेसर निर्दिष्ट कर सकते हैं।
pt: Sob a seção *preprocess*, você pode especificar um ou mais pré-processadores para usá-lo em um projeto fpm.
zh_cn: 在 *preprocess* 部分下，你可以指定一个或多个预处理器以在 fpm 项目中使用。

source: Specifying the preprocessor
de: Spezifizierung des Präprozessors
es: Especificación del preprocesador
fr: Spécifier le préprocesseur
in: प्रीप्रोसेसर निर्दिष्ट करना
pt: Definição do pré-processador
zh_cn: 指定预处理器

source: The *preprocess* section allows one or more preprocessors to be specified. For example, ```cpp``` can be specified like this :
de: Im Abschnitt *preprocess* können ein oder mehrere Präprozessoren angegeben werden. Zum Beispiel kann ```cpp``` wie folgt angegeben werden:
es: La sección *preprocess* permite especificar uno o más preprocesadores. Por ejemplo, ```cpp``` se puede especificar así:
fr: La section *preprocess* permet de spécifier un ou plusieurs préprocesseurs. Par exemple, ```cpp``` peut être spécifié comme suit :
in: *प्रीप्रोसेस* सेक्शन एक या अधिक प्रीप्रोसेसरों को निर्दिष्ट करने की अनुमति देता है। उदाहरण के लिए, ```cpp``` इस तरह निर्दिष्ट किया जा सकता है:
pt: A seção *preprocess* permite usar um ou mais pré-processadores. Por exemplo, o pré-processador ```cpp``` pode ser definido como:
zh_cn: *preprocess* 部分允许指定一个或多个预处理器。例如，```cpp``` 可以这样指定：

source: To use multiple preprocessors, for example ```cpp``` and ```fypp```, specify them like this:
de: Um mehrere Präprozessoren zu verwenden, z. B. ```cpp``` und ```fypp```, werden diese wie folgt angegeben:
es: Para usar múltiples preprocesadores, por ejemplo ```cpp``` y ```fypp```, especifíquelos así:
fr: Pour utiliser plusieurs préprocesseurs, par exemple ```cpp``` et ```fypp```, spécifiez-les comme suit :
in: एकाधिक प्रीप्रोसेसरों का उपयोग करने के लिए, उदाहरण के लिए ```cpp``` और ```fypp```, उन्हें इस तरह निर्दिष्ट करें:
pt: Para usar mais de um pré-processador, por exemplo, o ```cpp``` e o ```fypp```, defina-os como:
zh_cn: 要使用多个预处理器，例如 ```cpp``` 和 ```fypp```，请像这样指定它们：

source: You can also specify source file suffixes that the preprocessor should run on:
de: Auch Suffixe von Quelldateien mit denen der Präprozessor arbeiten soll können angeben werden:
es: También puede especificar los sufijos del archivo de origen en los que debe ejecutarse el preprocesador:
fr: Vous pouvez également spécifier les suffixes des fichiers sources pour lesquels le préprocesseur doit être exécuté :
in: आप स्रोत फ़ाइल प्रत्यय भी निर्दिष्ट कर सकते हैं कि प्रीप्रोसेसर को किस पर चलना चाहिए:
pt: Você também pode definir sufixos de código-fonte aos quais o pré-processador deve processar:
zh_cn: 你还可以指定预处理器应在其上运行的源文件后缀：
