Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: We will use the *replace\_all* function from the *stdlib\_strings* module for this purpose. The implementation is shown here
de: Wir werden die *replace\_all*-Funktion aus dem *stdlib\_strings*-Modul für diesen Zweck verwenden. Die Implementierung ist hier angegeben
es: Para esto, usaremos la función *replace\_all* desde el módulo *stdlib\_strings*. La implementación es mostrada aquí
fr: Nous utiliserons à cet effet la fonction *replace\_all* du module *stdlib\_strings*. L'implémentation est présentée ici
in: हम इस उद्देश्य के लिए *stdlib\_strings* मॉड्यूल से *replace\_all* फ़ंक्शन का उपयोग करेंगे। कार्यान्वयन यहाँ दिखाया गया है
ja: これを実現するために，*stdlib\_strings*モジュールにある*replace\_all*関数を用います．実装を以下に示します．
nl: We gebruiken hier de *replace\_all*-functie uit de *stdlib\_strings* module voor. De implementatie is hier weergegeven:
pt: Usaremos a função *replace_all* do módulo *stdlib\_strings* para este propósito. A implementação é mostrada a seguir
zh_cn: 为此，我们将使用 *stdlib_strings* 模块中的 *replace_all* 函数。以下为代码实现：

source: Finally, we need a command line driver to make use of our new function.
de: Zuletzt brauchen wir einen Kommandozeilen-Treiber, um unsere neue Funktion zu nutzen.
es: Finalmente, necesitamos un controlador de línea de comandos para usar la nueva función.
fr: Enfin, nous avons besoin de gérer la ligne de commandes pour utiliser notre nouvelle fonction.
in: अंत में, हमें अपने नए फ़ंक्शन का उपयोग करने के लिए कमांड लाइन ड्राइवर की आवश्यकता होती है।
ja: 最後に，作成した新しい手続を使えるようにするために，コマンドラインから呼び出すメインルーチンが必要です．
nl: Tenslotte hebben we een stuurprogramma nodig om onze nieuwe functie te gebruiken.
pt: Por fim, precisamos de um programa principal para usar nossa nova função.
zh_cn: 最后，我们需要一个命令行程序来使用我们的新函数。

source: We can check our command line driver by running it with fpm:
de: Wir können unseren Kommandozeilen-Treiber über fpm testen:
es: Podemos verificar el controlador de línea de comandos ejecutando con fpm:
fr: Nous pouvons vérifier la gestion de la ligne de commandes en exécutant avec fpm :
in: हम अपने कमांड लाइन ड्राइवर को fpm के साथ चलाकर देख सकते हैं:
ja: fpmを用いてメインルーチンを呼び出し，動作を確認します．
nl: We kunnen ons programma via fpm testen:
pt: Podemos conferir nosso programa rodando-o com o fpm:
zh_cn: 我们可以通过使用fpm运行命令行程序来检查它：

source: Adding a testing framework
de: Hinzufügen eines Test-Frameworks
es: Adicionando un marco de pruebas
fr: Ajouter un environnement de test
in: एक परीक्षण ढांचा जोड़ा जा रहा है|
ja: テストフレームワークの追加
nl: Een test-framework toevoegen
pt: Adicionando um framework de testes
zh_cn: 添加测试框架

source: Before we continue implementing new features, we want to add some tests to verify that our implementation keeps working as we modify it. A minimalist testing framework is available with [test-drive]. Since the testing framework is only required when developing the package itself, but not for other packages which might in the future make use of our modules, we add it as a development dependency. The *test-drive* package is added in the *dev-dependencies* table as shown below
de: Bevor wir weitermachen, um neue Funktionen zu implementieren, möchten wir einige Tests hinzufügen, um zu verifizieren, dass unsere Implementierung weiterhin funktioniert, wenn wir es ändern. Ein minimalistes Test-Framework ist verfügbar mit [test-drive]. Da das Test-Framework nur benötigt wird, wenn wir das Paket selbst entwickeln, aber nicht für andere Pakete, die in der Zukunft unsere Module nutzen, fügen wir eine lokale Abhängigkeit hinzu. Das *test-drive*-Paket wird in der *dev-dependencies*-Tabelle wie unten angegeben hinzugefügt
es: Antes de adicionar nuevas características, deseamos realizar algunas pruebas para verificar si nuestra implementación sigue funcionando a medida que esta es modificada. Un marco de pruebas minimalista está disponible con [test-drive]. Dado que el marco de pruebas es solo requerido durante el desarrollo del paquete, pero no para otros paquetes que puedan ser usados en el futuro para nuestros módulos, adicionamos una dependencia local. El paquete *test-drive* es adicionado en la table *dev-dependencies* como se muestra abajo
fr: Avant de continuer à implémenter de nouvelles fonctionnalités, nous voulons ajouter quelques tests pour vérifier que notre implémentation continue de fonctionner au fur et à mesure que nous la modifions. Un environnement de test minimaliste est disponible avec [test-drive](https://github.com/fortran-lang/test-drive). Comme l'environnement de tests n'est nécessaire que pour le développement du paquet lui-même, mais pas pour d'autres paquets qui pourraient à l'avenir utiliser nos modules, nous ajoutons une dépendance de dévelopement. Le paquet *test-drive* est ajouté dans la table *dev-dependencies* comme indiqué ci-dessous
in: इससे पहले कि हम नई सुविधाओं को लागू करना जारी रखें, हम यह सत्यापित करने के लिए कुछ परीक्षण जोड़ना चाहते हैं कि हमारा कार्यान्वयन काम करता रहता है क्योंकि हम इसे संशोधित करते हैं। [टेस्ट-ड्राइव] के साथ एक न्यूनतम परीक्षण ढांचा उपलब्ध है। चूंकि पैकेज विकसित करते समय ही परीक्षण ढांचे की आवश्यकता होती है, लेकिन अन्य पैकेजों के लिए नहीं जो भविष्य में हमारे मॉड्यूल का उपयोग कर सकते हैं, हम इसे विकास निर्भरता के रूप में जोड़ते हैं। *test-drive* पैकेज * देव-निर्भरता * तालिका में जोड़ा जाता है जैसा कि नीचे दिखाया गया है
pt: Antes que continuemos a implementar novos recursos, queremos adicionar alguns testes para verificar que nossa implementação continua funcionando conforme a modificamos. Um framework minimalista de testes está disponível em [test-drive](https://github.com/fortran-lang/test-drive). Já que o framework de testes é necessário apenas ao desenvolvermos o pacote em si, mas não para outros pacotes que por ventura usem nossos módulos, adicionaremos uma dependência de desenvolvimento. O pacote *test-drive* é adicionado na tabela *dev-dependencies* como é mostrado abaixo
zh_cn: 在继续实现新功能之前，我们希望添加一些测试，以验证我们的实现在修改后是否保持工作状态。[test-drive](https://github.com/fortran-lang/test-drive) 提供了一个极简的测试框架。由于仅在开发包本身时才需要测试框架，而对于将来可能使用我们的模块的其它包则不需要，我们添加了开发依赖项。*test-drive* 包被添加到 *dev-dependencies* 表中，如下所示

source: For a development dependency like a testing framework we choose a strict version pin by specifying the *tag* we want to use.
de: Für eine Entwicklungsabhängigkeit wie das Test-Framework wählen wir eine strikte Versions Einschränkung, indem wir den *tag* angeben, den wir benutzen wollen.
es: Para una dependencia de desarrollo similar a un marco de prueba, elegimos un estricto pin de la versión especificando la *tag* que queremos usar.
fr: Pour une dépendance de développement de ce type, nous imposons une version précise en spécifiant le *tag* que nous voulons utiliser.
in: एक विकास निर्भरता के लिए एक परीक्षण ढांचे की तरह हम * टैग * निर्दिष्ट करके एक सख्त संस्करण पिन चुनते हैं जिसका हम उपयोग करना चाहते हैं।
ja: テストフレームワークのような開発時に参照する依存関係に対しては，タグを指定して，使用したい厳密なバージョンを選択します．
nl: Voor een afhankelijkheid die voor de ontwikkeling van een nieuw pakket nodig is zoals het test-framework, willen we liefst een specifieke versie hebben. Hiervoor geven we de juiste *tag* aan.
pt: Para dependências de desenvolvimento como um framework de testes vamos escolher uma versão fixa através da *tag* que queremos usar.
zh_cn: 像测试框架这样的开发依赖关系，我们通过指定标记（*tag*）来选择严格的版本引脚。

source: Now we can write a simple unit test, since our function works with units, we will create scratch units to create the input and capture the output. For now we will add a simple one line substitution as single test case
de: Wir können nun einen einfachen Test schreiben, da unsere Funktion mit Units arbeitet, werden wir temporäre Units erstellen, um den Eingang und die Ausgabe zu erfassen. Für den Moment werden wir eine einfache Ersetzung in einer Zeile als Test hinzufügen
es: Ahora podemos escribir una prueba unitária simple, dado que nuestra función trabaja con unidades, usaremos unidades borrador para definir las entradas y las salidas. Por ahora, adicionaremos una única substitución de línea como caso de prueba
fr: Maintenant nous pouvons écrire un test unitaire simple. Puisque notre fonction fonctionne avec des numéros d'unités, nous allons créer des fichiers temporaires non nommés ("scratch") pour créer l'entrée et capturer la sortie. Pour l'instant, nous allons simplement ajouter la substitution d'une ligne comme unique test
in: अब हम एक साधारण इकाई परीक्षण लिख सकते हैं, क्योंकि हमारा कार्य इकाइयों के साथ काम करता है, हम इनपुट बनाने और आउटपुट कैप्चर करने के लिए स्क्रैच इकाइयां बनाएंगे। अभी के लिए हम सिंगल टेस्ट केस के रूप में एक साधारण एक लाइन प्रतिस्थापन जोड़ेंगे
ja: ここで作成している関数はそれ単体で動作するため，単純な単体テストを記述できます．入力を生成して出力を取得する単体機能を作成することにします．とりあえず，単純な1行の差し替えを，一つのテストケースとして追加します．
nl: We schrijven vervolgens een simpele test. Omdat onze functie met unitnummers werkt, maken we tijdelijke files aan voor de invoer en om de uitvoer op te vangen. Voor het moment is die test een substitutie in een enkele regel.
pt: Agora podemos escrever um simples teste unitário, já que nossa função funciona com uma unit, vamos criar units do tipo scratch para criar a entrada e capturar a saída. Por enquanto, vamos adicionar uma simples substituição em uma linha como um caso de teste
zh_cn: 现在我们可以编写一个简单的单元测试。因为我们的函数执行需要文件通道，我们将创建暂存（scratch）通道来创建输入并捕获输出。现在，我们将添加一个简单的单行替换作为单个测试用例：

source: We run our new test using fpm
de: Wir führen unseren neuen Test mit fpm aus
es: Ejecutamos nuestra nueva prueba usando fpm
fr: Nous lançons notre nouveau test avec fpm
in: हम fpm का उपयोग करके अपना नया परीक्षण चलाते हैं
ja: fpmを用いて作成したテストを実行します．
nl: We draaien onze nieuwe test met fpm
pt: Rodamos o nosso novo teste usando o fpm
zh_cn: 我们使用 fpm 运行新测试：

source: Creating the scratch units for multiple unit tests will be repetitive, this kind of tasks can usually be done in a separate procedure and reused in several tests.
de: Die Erstellung der temporären Units für mehrere Unit-Tests wird repetitiv sein, diese Aufgaben können in einer separatem Prozedur erledigt werden und in mehreren Tests wiederverwendet werden.
es: La creación de unidades borrador para múltiples pruebas unitárias será repetitiva, este tipo de tareas normalmente se pueden realizar en un procedimiento separado y reutilizarse en varias pruebas.
fr: La création des fichiers temporaires pour plusieurs tests unitaires sera répétitive. Ce genre de tâches peut généralement être effectué dans une procédure séparée et réutilisée dans plusieurs tests.
in: एकाधिक यूनिट परीक्षणों के लिए स्क्रैच इकाइयां बनाना दोहराव होगा, इस प्रकार के कार्य आमतौर पर एक अलग प्रक्रिया में किए जा सकते हैं और कई परीक्षणों में पुन: उपयोग किए जा सकते हैं।
ja: 複数の単体テストにおける単体機能の作成は，反復的な作業になります．この種の作業は通常，独立した手順で行うことができ，いくつかのテストで再利用されます．
nl: Het schrijven van dit soort tijdelijke bestanden is vaak een herhaling van zetten en daarom doen we dit in een aparte procedure die we meerdere keren kunnen gebruiken.
pt: Criar unidades do tipo scratch para múltiplos teste de unidade pode ser uma tarefa repetitiva, este tipo de coisa pode ser feita em um procedimento a parte e reutilizada em vários testes.
zh_cn: 在多个单元测试中创建暂存通道比较繁琐，通常会在一个单独的过程中创建它们，然后在多个测试中重用。

source: Target-specific dependencies
de: Ziel-spezifische Abhängigkeiten
es: Dependencias de objetivo específico
fr: Dépendances spécifiques au système d'exploitation
in: लक्ष्य-विशिष्ट निर्भरताएँ
ja: ビルド対象固有の依存関係
nl: Specifieke afhankelijkheden per doel (target)
pt: Dependências específicas do alvo
zh_cn: 目标特定的依赖项

source: Dependencies can also be used for specific targets only. This can be used for adding a command line interface package, which is only used for the executable but not part of the library dependencies.
de: Abhängigkeiten können auch nur für bestimmte Ziele verwendet werden. Dies kann verwendet werden, um ein Kommandozeilen-Interface-Paket hinzuzufügen, das nur für die Ausführungsdatei benutzt wird, aber nicht Teil der Bibliotheksabhängigkeiten ist.
es: Las dependencias también se pueden ser usadas, solamente, para objetivos específicos. Esto se puede usar para adicionar un paquete de interfaz de línea de comandos, que solo se utiliza para el ejecutable pero que no forma parte de las dependencias de la biblioteca.
fr: Les dépendances peuvent également être utilisées uniquement pour des cibles spécifiques. Par exemple pour ajouter un paquet d'interface en ligne de commandes, qui n'est utilisé que pour l'exécutable mais ne fait pas partie des dépendances de la bibliothèque.
in: निर्भरता का उपयोग केवल विशिष्ट लक्ष्यों के लिए भी किया जा सकता है। इसका उपयोग कमांड लाइन इंटरफ़ेस पैकेज जोड़ने के लिए किया जा सकता है, जिसका उपयोग केवल निष्पादन योग्य के लिए किया जाता है लेकिन लाइब्रेरी निर्भरताओं का हिस्सा नहीं है।
ja: 依存関係は，特定のビルド対象に対してのみ利用できます．ここで導入するビルド対象固有の依存関係は，実行ファイルにコマンドラインインタフェースを追加するパッケージであって，ライブラリの依存関係ではありません．
nl: Afhankelijkheden kunnen ook gebruikt voor specifieke doelen. Een simpel voorbeeld is een pakket voor het verwerken van opdrachtopties dat alleen door een programma wordt gebruikt, maar niet door de bibliotheken die voor dat programma nodig zijn.
pt: Dependências também podem ser usadas apenas para alvos específicos. Isso pode ser feito para adicionar uma interface de linha de comando que é usada no executável mas não é parte das dependências da biblioteca.
zh_cn: 依赖项也只能用于特定目标。这可用于添加命令行界面程序包，该包仅用于可执行文件，而不是库依赖项的一部分。

source: We restructure our main program a bit for using [M\_CLI2] to handle the command line input. The *unnamed* array contains all positional command line arguments, we still use the first two as pattern and replacement, and use all remaining arguments as input. We also add an option to redirect the output. Our final main program looks like
de: Wir restrukturieren unsere Hauptprogramm etwas, um [M\_CLI2] zu benutzen was die Kommandozeileneingabe verarbeitet. Das *unnamed*-Feld enthält alle positionsbezogenen Kommandozeilenargumente, wir benutzen die ersten zwei als Muster und Ersetzung, und verwenden alle weiteren Argumente als Eingabe. Wir fügen auch eine Option hinzu, um die Ausgabe zu umleiten. Unser finales Hauptprogramm sieht wie folgt aus
es: Reestructuramos un poco nuestro programa principal para usar [M \ _ CLI2] para manejar la entrada de línea de comandos. La matriz *unname* contiene todos los comandos posicionales de argumentos de línea, todavía usamos los dos primeros como patrón y reemplazo, y usamos todos los argumentos restantes como entrada. También agregamos una opción a redirigir la salida. Nuestro programa principal final parece
fr: Nous restructurons un peu notre programme principal pour utiliser [M\_CLI2](https://github.com/urbanjost/M_CLI2) pour gérer l'entrée de la ligne de commandes. Le tableau *unnamed* contient tous les arguments positionnels de la ligne de commandes, nous utilisons toujours les deux premiers comme motif et remplacement, et utilisons tous les autres arguments comme entrées. Nous ajoutons également une option pour rediriger la sortie. Notre programme principal final se présente ainsi :
in: कमांड लाइन इनपुट को संभालने के लिए [M\_CLI2] का उपयोग करने के लिए हम अपने मुख्य कार्यक्रम को थोड़ा सा पुनर्गठित करते हैं। *unnamed* सरणी में सभी स्थितीय कमांड लाइन तर्क शामिल हैं, हम अभी भी पैटर्न और प्रतिस्थापन के रूप में पहले दो का उपयोग करते हैं और इनपुट के रूप में शेष सभी तर्कों का उपयोग करते हैं। हम आउटपुट को रीडायरेक्ट करने के लिए एक विकल्प भी जोड़ते हैं। हमारा अंतिम मुख्य कार्यक्रम जैसा दिखता है
ja: [M\_CLI2](https://github.com/urbanjost/M_CLI2)を用いてコマンドライン入力を処理するために，メインルーチンを若干再構成します．配列*unnamed*は，位置関係を含むコマンドライン引数全てを保持しています．最初の二つをパターンと置換に利用し，残りの全ての引数を入力として用います．また，出力をリダイレクトするオプションも追加しました．最終的なメインルーチンは，次のようになりました．
nl: We zetten de structuur van ons hoofdprogram iets anders op, om [M\_CLI2] te kunnen gebruiken voor het afhandeling van de opdrachtregels. De array *unnamed* bevat alle positie-afhankelijke argumenten. We gebruiken de eerste twee als patroon en vervanging en alle verdere als invoer. Tenslotte voeren we een optie in om de uitvoer om te leiden. Het resultaat ziet er zo uit:
pt: Reestruturamos nosso programa principal um pouco para usar o [M\_CLI](https://github.com/urbanjost/M_CLI2) para lidar com a interface de linha de comando. O array *unnamed* contém todos os argumentos posicionais do comando, vamos usar os dois primeiros como padrão e seu substituto e usar o todos os restantes como entrada. Além disso, adicionamos a opção de redirecionar a saída. Ao final, nosso programa ficará assim
zh_cn: 我们稍微重构了一下主程序，以便使用 [M_CLI2](https://github.com/urbanjost/M_CLI2) 来处理命令行输入。*unnamed* 数组包含所有位置命令行参数，我们仍然使用前两个作为模式和替换，并使用所有剩余的参数作为输入。我们还添加了一个选项来重定向输出。最终主程序像这样：

source: Again we run a quick check using fpm
de: Wir führen einen kurzen Test mit fpm aus
es: Nuevamente ejecutamos y rápidamente verificamos con fpm
fr: Encore une fois nous vérifions le bon fonctionnement avec fpm
in: फिर से हम fpm का उपयोग करके एक त्वरित जाँच करते हैं
ja: fpmを用いて簡単な確認を再度行います．
nl: We voeren opnieuw een kleine test met fpm uit
pt: Mais uma vez fazemos uma verificação rápida usando o fpm
zh_cn: 我们再次使用 fpm 运行快速检查：

source: The output looks as expected with two substitutions.
de: Die Ausgabe sieht wie erwartet aus, mit zwei Ersetzungen.
es: La salida luce como se espera con dos substituciones.
fr: La sortie comporte deux substitutions comme attendu.
in: आउटपुट दो प्रतिस्थापन के साथ अपेक्षा के अनुरूप दिखता है।
ja: 期待通りに2箇所の差し替えが行われました．
nl: De uitvoer ziet eruit als verwacht, met twee vervangingen.
pt: A saída está conforme o esperado, com duas substituições.
zh_cn: 输出看起来与预期一样，有两个替换。

source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
in: संक्षेप
ja: まとめ
nl: Samenvatting
pt: Sumário
zh_cn: 总结

source: In this tutorial you learned how to
de: In diesem Kurs haben wir gelernt, wie man
es: En este tutorial aprenderas cómo
fr: Dans ce tutoriel vous avez appris à
in: इस ट्यूटोरियल में आपने सीखा कि कैसे
ja: ここでは以下の方法を学びました．
nl: In deze tutorial hebben we geleerd hoe je
pt: Neste tutorial você aprendeu como
zh_cn: 在本教程中，你学习了如何

source: depend on another fpm project in the package manifest
de: von einem anderen fpm-Projekt im Paketmanifest abhängen
es: depender de otro proyecto fpm en el manifiesto del paquete
fr: mettre un autre projet fpm en dépendance dans le manifeste de votre projet
in: पैकेज मेनिफ़ेस्ट में अन्य fpm प्रोजेक्ट पर निर्भर हैं
ja: パッケージマニフェスト内で別のfpmプロジェクトを参照する方法
nl: een afhankelijkheid van een fpm project in het manifestbestand specificeert
pt: depender de outro projeto fpm no manifesto do pacote
zh_cn: 在包清单中添加对另一个fpm项目的依赖；

source: add development dependencies for testing
de: Hinzufügen von Entwicklungsabhängigkeiten zum Testen
es: añadir dependencias de desarrollo para pruebas
fr: utiliser des dépendances pour ajouter des tests
in: परीक्षण के लिए विकास निर्भरता जोड़ें
ja: テストのために開発時の依存関係を追加する方法
nl: afhankelijkheden toevoegt voor testen
pt: adicionar dependências de desenvolvimento para testes
zh_cn: 添加用于测试的开发依赖项；

source: use dependencies for executables
de: Verwenden von Abhängigkeiten für ausführbare Dateien
es: usar dependencias para ejecutables
fr: utiliser des dépendances ne concernant que l'exécutable
in: निष्पादनयोग्य के लिए निर्भरता का उपयोग करें
ja: 実行ファイルに依存関係を追加する方法
nl: afhankelijkheden specificeert voor het programma zelf
pt: usar dependências para os executáveis
zh_cn: 使用可执行文件的依赖项。

source: First steps with fpm
de: Erste Schritte mit fpm
es: Primeros pasos con fpm
fr: Premiers pas avec fpm
in: fpm के साथ पहला कदम
ja: fpm最初の一歩
nl: Eerste stappen met fpm
pt: Primeiros passos com o fpm
zh_cn: 使用 fpm 的第一步

source: This tutorial covers the basic usage of the Fortran Package Manager (fpm) command line. It will cover the generation of a new project and the possibility to compile a project into an executable as well as the possibility to run the resulting program.
de: Dieses Tutorial behandelt die grundlegende Verwendung der Befehlszeile des Fortran-Paketmanagers (fpm). Es behandelt die Erstellung eines neuen Projekts und die Möglichkeit, ein Projekt in eine ausführbare Datei zu kompilieren sowie die Möglichkeit, das resultierende Programm auszuführen.
es: Este tutorial cubre el uso básico de la línea de comandos de Administrador de paquetes de Fortran (fpm). Cubrirá la construcción de un nuevo proyecto y la posibilidad de compilar un proyecto en un ejecutable, así como el posibilidad de ejecutar el programa resultante.
fr: Ce tutoriel concerne l'utilisation basique de la ligne de commandes du gestionnaire de paquets Fortran (fpm). Nous aborderons la création d'un nouveau projet, la compilation d'un projet en un exécutable, ainsi que l'exécution du programme résultant.
in: यह ट्यूटोरियल फोरट्रान पैकेज मैनेजर (fpm) कमांड लाइन के मूल उपयोग को कवर करता है। इसमें एक नई परियोजना की पीढ़ी और एक निष्पादन योग्य में एक परियोजना को संकलित करने की संभावना के साथ-साथ परिणामी कार्यक्रम को चलाने की संभावना शामिल होगी।
ja: ここでは，コマンドラインにおけるFortranパッケージマネージャ（fpm）の基本的な使用方法を取り扱います．新規プロジェクトの作成や，プロジェクトを実行ファイルにコンパイルする方法だけでなく，構築されたプログラムを実行する方法についても取り扱います．
nl: Deze tutorial behandelt het basale gebruik van opdrachtinterface van de Fortran-packagemanager (fpm) aan de hand van het opzetten van een nieuw project en de mogelijkheden om hiermee een programma te bouwen en uit te voeren.
pt: Este tutorial cobre o uso básico da linha de comando do Gerenciador de Pacotes Fortran (fpm). Ele vai cobrir a geração de um projeto novo e a sua compilação em um executável, bem como a possibilidade de rodar o programa resultante.
zh_cn: 本教程介绍了Fortran包管理器（fpm）的命令行基本用法。它涵盖新项目的生成、将项目编译为可执行文件的可能性以及运行结果程序的可能性。

source: To start a new project with fpm use the *fpm new* command
de: Um ein neues Projekt mit fpm zu starten, verwende den Befehl *fpm new*
es: Para iniciar un nuevo proyecto con fpm use el comando *fpm new*
fr: Pour commencer un nouveau projet avec fpm, utilisez la commande *fpm new*
in: fpm के साथ एक नया प्रोजेक्ट शुरू करने के लिए *fpm new* कमांड का प्रयोग करें
ja: fpmで新しいプロジェクトを始めるには，*fpm new*コマンドを用います．
nl: Om een nieuw project met fpm te beginnen, gebruik de opdracht *fpm new*
pt: Para começar um novo projeto com o fpm use o comando *fpm new*
zh_cn: 要使用 fpm 新建项目，请使用 *fpm new* 命令:

source: By default fpm creates a git repository with a dummy project in the fpm standard layout
de: Standardmäßig erstellt fpm ein Git-Repository mit einem Dummy-Projekt im fpm-Standardlayout
es: De forma predeterminada, fpm crea un repositorio git con un proyecto ficticio en la configuración usual de fpm
fr: Par défaut, fpm crée un dépôt git avec un projet Hello World dont la structure est :
in: डिफ़ॉल्ट रूप से, fpm FPM मानक लेआउट में एक डमी प्रोजेक्ट के साथ एक git रिपॉजिटरी बनाता है|
ja: 標準では，fpmは既定の構成をもつ仮プロジェクトを含んだgitリポジトリを作成します．
nl: Standaard zet fpm een Git-repository op met daarin een dummy-project in de standaardlayout van fpm
pt: Por padrão o fpm cria um repositório git com um projeto modelo em seu formato padrão
zh_cn: 默认情况下，fpm 使用 fpm 标准布局中的式样项目创建一个 git 存储库：
