Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Thanks to [@minhqdao](https://github.com/minhqdao), [@perazz](https://github.com/perazz) and everyone who contributed to this release! This release was supported by the Sovereign Tech Fund ([STF](https://sovereigntechfund.de/de/)).
fr: Merci à [@minhqdao](https://github.com/minhqdao), [@perazz](https://github.com/perazz) et à tous ceux qui ont contribué à cette version ! Cette version a été soutenue par le Sovereign Tech Fund ([STF](https://sovereigntechfund.de/de/)).
zh_cn: 感谢[@minhqdao](https://github.com/minhqdao)、[@perazz](https://github.com/perazz)以及所有为这个版本做出贡献的人!这个版本得到了主权技术基金（[STF](https://sovereigntechfund.de/de/)）的支持。

source: Not store temporary data in .local (#900) by @minhqdao
fr: Ne pas stocker les données temporaires dans .local (#900) par @minhqdao
zh_cn: @minhqdao，不在.local中存储临时数据（#900）

source: Add flags to link main programs with C/C++ main (#896) by @perazz
fr: Ajouter des drapeaux pour lier les programmes principaux avec le `main` C/C++ (#896) par @perazz
zh_cn: 添加标志，将主程序与C/C++主程序连接起来（#896），作者：@perazz

source: replace unix with is_unix to avoid intel fpp collisions (#894) by @perazz
fr: Remplace unix par is_unix pour éviter les collisions avec Intel fpp (#894) par @perazz
zh_cn: 用is_unix替换unix，以避免intel fpp的碰撞（#894），作者：@perazz

source: Fix bootstrapping on Windows (#892) by @minhqdao
fr: Corrige le bootstrapping sur Windows (#892) par @minhqdao
zh_cn: 修复Windows上的引导（#892），作者：@minhqdao

source: Improve error message for [build] structure errors (#890) by @perazz
fr: Améliore le message d'erreur pour les erreurs de structure [build] (#890) par @perazz
zh_cn: 改进[build]结构错误的错误信息（#890） 作者：@perazz

source: Fix multiple installs (#888) by @perazz
fr: Corrige les installations multiples (#888) par @perazz
zh_cn: 修复多重安装（#888），作者：@perazz

source: Fix --show-package-version (#887) by @minhqdao
fr: Corrige --show-package-version (#887) par @minhqdao
zh_cn: 修复 --show-package-version (#887)，作者：@minhqdao

source: Update Windows CI image compiler to MinGW gfortran 10.4.0 (#881) by @perazz
fr: Mise à jour du compilateur image pour l'intégration continue Windows vers MinGW gfortran 10.4.0 (#881) par @perazz
zh_cn: 更新Windows CI图像编译器至MinGW gfortran 10.4.0（#881），作者：@perazz

source: Implement fpm publish (#876) by @minhqdao
fr: Implémente fpm publish (#876) par @minhqdao
zh_cn: 实施fpm发布（#876），作者：@minhqdao

source: Automated dependency update: restore deterministic behavior (#875) by @perazz
fr: Mise à jour automatisée des dépendances : rétablissement du comportement déterministe (#875) par @perazz
zh_cn: 自动依赖性更新：恢复确定性行为（#875），作者：@perazz

source: **Full Changelog**: https://github.com/fortran-lang/fpm/compare/v0.8.1...v0.8.2
fr: **Journal complet des modifications** : https://github.com/fortran-lang/fpm/compare/v0.8.1...v0.8.2
pt: **Registro de Mudanças Completo**: https://github.com/fortran-lang/fpm/compare/v0.8.1...v0.8.2
zh_cn: **完整的更改日志**: https://github.com/fortran-lang/fpm/compare/v0.8.1...v0.8.2

source: Welcome to the package registry for the Fortran package manager. All currently registered packages can be found here.
de: Willkommen bei der Paketregistrierung für den Fortran-Paketmanager. Alle derzeit registrierten Pakete können hier gefunden werden.
es: Bienvenido al registro de paquetes del Administrador de paquetes de Fortran. Todos los paquetes registrados actualmente se pueden encontrar aquí.
fr: Bienvenue dans le catalogue du gestionnaire de paquets Fortran fpm. Tous les paquets actuellement enregistrés peuvent être trouvés ici.
in: Fortran पैकेज प्रबंधक के लिए पैकेज रजिस्ट्री में आपका स्वागत है। सभी वर्तमान में पंजीकृत पैकेज यहां पाए जा सकते हैं।
pt: Bem-vindo(a) ao registro de pacotes para o gerenciador de pacotes Fortran. Todos os pacotes atualmente registrados podem ser encontrados aqui.
zh_cn: 欢迎使用 Fortran 包管理器的包注册表，所有当前注册的包都可以在这里找到。

source: Your project is not listed? Submit a request at `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>`_!
de: Ihr Projekt ist nicht aufgeführt? Senden Sie eine Anfrage an `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>`_!
es: ¿su proyecto no está en la lista? ¡Envíe una solicitud a `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>`_!
fr: Votre projet n'est pas répertorié ? Soumettez une demande à `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>`_ !
in: आपकी परियोजना सूचीबद्ध नहीं है? 'fortran-lang/fpm-रजिस्ट्री <https://github.com/fortran-lang/fpm-registry>' पर एक अनुरोध सबमिट करें!
pt: Seu projeto não está listado? Submeta-o em `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>`_!
zh_cn: 你的项目未列出？在 `fortran-lang/fpm-registry <https://github.com/fortran-lang/fpm-registry>` 中提交请求！

source: API documentation
de: API-Dokumentation
es: Documentación de la API
fr: Documentation de l'API
in: एपीआई दस्तावेज
ja: API文書
nl: API-Dokumentation
pt: Documentação da API
zh_cn: API 文档

source: Specifications and Reference
de: Spezifikationen und Referenz
es: Especificaciones y referencia
fr: Spécifications et manuel de référence
in: निर्दिष्टीकरण और संदर्भ
ja: 参考資料
nl: Specificaties en referentie
pt: Especificações e referência
zh_cn: 规范和参考

source: This section contains the specifications the components of the Fortran Package Manager.
de: Dieser Abschnitt enthält die Spezifikationen der Komponenten des Fortran Paketmanagers.
es: Esta sección contiene las especificaciones de los componentes del Administrador de paquetes de Fortran.
fr: Cette section contient les spécifications des composants du gestionnaire de paquets Fortran fpm.
in: इस खंड में फोरट्रान पैकेज मैनेजर के घटकों के विनिर्देशों को शामिल किया गया है।
ja: ここには，Fortranパッケージマネージャの仕様を掲載しています．
nl: Dit onderdeel detailleert de specificiaties van de componenten van de Fortran-packagemanager.
pt: Esta seção contém as definições dos componentes do Gerenciador de Pacotes Fortran.
zh_cn: 本节包含Fortran包管理器组件的规范。

source: The generated API documentation of the fpm internals can be found [here](https://fortran-lang.github.io/fpm).
de: Die API-Dokumentation der internen Funktionen von fpm kann unter https://fpm.fortran-lang.org gefunden werden.
es: La documentación de la API generada sobre los componentes internos de fpm puede ser encontrada en [https://fortran-lang.github.io/fpm](https://fortran-lang.github.io/fpm).
fr: La documentation de l'API de fpm peut être trouvée [ici](https://fortran-lang.github.io/fpm).
in: एफपीएम इंटर्नल के उत्पन्न एपीआई दस्तावेज [यहां] (https://fortran-lang.github.io/fpm) मिल सकते हैं।
ja: fpm内部から生成されたAPI文書は[こちら](https://fortran-lang.github.io/fpm)から参照できます．
nl: De API-documentatie van de interne functies van fpm kan op https://fpm.fortran-lang.org gevonden worden.
pt: A documentação da API gerada automaticamente dos componentes internos do fpm pode ser encontrada [aqui](https://fortran-lang.github.io/fpm).
zh_cn: fpm内部生成的API文档可在[https://fpm.fortran-lang.org](https://fortran-lang.github.io/fpm)中找到。

source: Manifest reference
de: Manifest-Referenz
es: Manifiesto de la referencia
fr: Manuel de référence du manifeste
in: प्रकट संदर्भ
ja: マニフェスト詳説
nl: Referentie voor manifestbestanden
pt: Referência do manifesto
zh_cn: 清单参考

source: The ``fpm.toml`` file for each project is called its *manifest*. It is written using the [TOML] format. Every manifest file consists of the following sections:
de: Die ``fpm.toml`` Datei für jedes Projekt wird als Manifest-Datei benannt. Sie wird im [TOML] Format geschrieben. Jede Manifest-Datei enthält folgende Abschnitte:
es: El archivo ``fpm.toml`` para cada proyecto es denominado *manifiesto*. Este es escrito usando el formato [TOML]. Cada archivo del manifiesto consiste de las siguientes secciones:
fr: Le fichier ``fpm.toml`` de chaque projet est appelé son *manifeste*. Il utilise le format [TOML](https://toml.io/). Chaque fichier manifeste est composé des sections suivantes :
in: प्रत्येक प्रोजेक्ट के लिए ``fpm.toml`` फ़ाइल को इसका *मेनिफेस्ट* कहा जाता है। यह [TOML] प्रारूप का उपयोग करके लिखा गया है। प्रत्येक मेनिफेस्ट फ़ाइल में निम्न अनुभाग होते हैं:
ja: 各プロジェクトの``fpm.toml``ファイルは，マニフェストとよばれています．これは[TOML](https://toml.io/ja/)形式で記述されます．マニフェストファイルは，以下の設定項目で構成されます．
nl: Het ``fpm.toml`` bestand voor elk project wordt het manifestbestand genoemd. Het staat in het [TOML] format. Ieder manifestbestand bevat de volgende secties:
pt: O ficheiro ``fpm.toml`` para cada projeto é chamado de seu *manifest* (manifesto). É escrito usando um formato de texto chamado [TOML](https://toml.io/). Cada ficheiro de manifesto é dividido nas seguintes seções:
zh_cn: 每个项目的文件``fpm.toml``称为清单（*manifest*），它是使用[TOML格式](https://toml.io/cn/)编写的。每个清单文件都包含以下部分：

source: [*name*](#project-name): The name of the project
de: [*name*](#project-name): Der Name des Projekts
es: [*name*](#project-name): Nombre del proyecto
fr: [*name*](#project-name) : nom du projet
in: [*नाम*](#परियोजना-नाम): परियोजना का नाम
ja: [*name*](#project-name): プロジェクトの名前
nl: [*name*](#project-name): De naam van het project
pt: [*name*](#project-name): O nome do projeto
zh_cn: [*name*](#project-name)：项目名称

source: [*version*](#project-version): The version of the project
de: [*version*](#project-version): Die Version des Projekts
es: [*version*](#project-version): Versión del proyecto
fr: [*version*](#project-version) : version du projet
in: [*version*](#प्रोजेक्ट-संस्करण): प्रोजेक्ट का संस्करण
ja: [*version*](#project-version): プロジェクトのバージョン
nl: [*version*](#project-version): De versie van het project
pt: [*version*](#project-version): A versão do projeto
zh_cn: [*version*](#project-version)：项目版本

source: [*license*](#project-license): The project license
de: [*license*](#project-license): Die Lizenz des Projekts
es: [*license*](#project-license): Licencia del proyecto
fr: [*license*](#project-license) : license du projet
in: [*लाइसेंस*](#प्रोजेक्ट-लाइसेंस): प्रोजेक्ट लाइसेंस
ja: [*license*](#project-license): プロジェクトのライセンス
nl: [*license*](#project-license): De licentie voor het project
pt: [*license*](#project-license): A licença do projeto
zh_cn: [*license*](#project-license)：项目许可证

source: [*maintainer*](#project-maintainer): Maintainer of the project
de: [*maintainer*](#project-maintainer): Der Maintainer des Projekts
es: [*maintainer*](#project-maintainer): Encargado del proyecto
fr: [*maintainer*](#project-maintainer) : mainteneur du projet
in: [*मेंटेनर*](#प्रोजेक्ट-मेंटेनर): प्रोजेक्ट का मेंटेनर
ja: [*maintainer*](#project-maintainer): プロジェクトのメンテナ
nl: [*maintainer*](#project-maintainer): De beheerder van het project
pt: [*maintainer*](#project-maintainer): Mantenedor do projeto
zh_cn: [*maintainer*](#project-maintainer)：项目的维护者

source: [*author*](#project-author): Author of the project
de: [*author*](#project-author): Der Autor des Projekts
es: [*author*](#project-author): Autor del proyecto
fr: [*author*](#project-author) : auteur du projet
in: [*author*](#प्रोजेक्ट-लेखक): प्रोजेक्ट के लेखक
ja: [*author*](#project-author): プロジェクトの作成者
nl: [*author*](#project-author): De auteur van het project
pt: [*author*](#project-author): Autor do projeto
zh_cn: [*author*](#project-author)：项目作者

source: [*copyright*](#project-copyright): Copyright of the project
de: [*copyright*](#project-copyright): Copyright des Projekts
es: [*copyright*](#project-copyright): Derechos de autor del proyecto
fr: [*copyright*](#project-copyright) : copyright du projet
in: [*कॉपीराइट*](#प्रोजेक्ट-कॉपीराइट): प्रोजेक्ट का कॉपीराइट
ja: [*copyright*](#project-copyright): プロジェクトの著作権
nl: [*copyright*](#project-copyright): Copyright voor het project
pt: [*copyright*](#project-copyright): Copyright do projeto
zh_cn: [*copyright*](#project-copyright)：项目版权

source: [*description*](#project-description): Description of the project
de: [*description*](#project-description): Die Beschreibung des Projekts
es: [*description*](#project-description): Descripcción del proyecto
fr: [*description*](#project-description) : description du projet
in: [*विवरण*](#प्रोजेक्ट-विवरण): प्रोजेक्ट का विवरण
ja: [*description*](#project-description): プロジェクトの概要
nl: [*description*](#project-description): De omschrijving van het project
pt: [*description*](#project-description): Descrição do projeto
zh_cn: [*description*](#project-description)：项目描述

source: [*categories*](#project-categories): Categories associated with the project
de: [*categories*](#project-categories): Kategorien, die dem Projekt zugeordnet sind
es: [*categories*](#project-categories): Categorias asociadas con el proyecto
fr: [*categories*](#project-categories) : catégories associées au projet
in: [*श्रेणियां*](#परियोजना-श्रेणियां): परियोजना से जुड़ी श्रेणियां
ja: [*categories*](#project-categories): プロジェクトに関連する分類
nl: [*categories*](#project-categories): Categorieën, waaronder het project valt
pt: [*categories*](#project-categories): Categorias associadas com o projeto
zh_cn: [*categories*](#project-categories)：与项目相关的类别

source: [*keywords*](#project-keywords): Keywords describing the project
de: [*keywords*](#project-keywords): Schlüsselwörter, die dem Projekt zugeordnet sind
es: [*keywords*](#project-keywords): palabras clave
fr: [*keywords*](#project-keywords) : mots-clés décrivant le projet
in: [*कीवर्ड*](#प्रोजेक्ट-कीवर्ड): प्रोजेक्ट का वर्णन करने वाले कीवर्ड
ja: [*keywords*](#project-keywords): プロジェクトを説明するキーワード
nl: [*keywords*](#project-keywords): Sleutelwoorden waarmee het project wordt gekenmerkt
pt: [*keywords*](#project-keywords): Palavras-chave descrevendo o projeto
zh_cn: [*keywords*](#project-keywords)：描述项目的关键词

source: [*homepage*](#project-homepage): The project's homepage
de: [*homepage*](#project-homepage): Die Homepage des Projekts
es: [*homepage*](#project-homepage): Página web del proyecto
fr: [*homepage*](#project-homepage) : page d'accueil du projet
in: [* होमपेज*](#प्रोजेक्ट-होमपेज): प्रोजेक्ट का होमपेज
ja: [*homepage*](#project-homepage): プロジェクトのホームページ
nl: [*homepage*](#project-homepage): De homepage van het project
pt: [*homepage*](#project-homepage): A página principal do projeto
zh_cn: [*homepage*](#project-homepage)：项目主页

source: Build configuration:
de: Build-Konfiguration:
es: Configuración:
fr: Configuration de la construction :
in: कॉन्फ़िगरेशन बनाएँ:
ja: ビルド設定:
nl: Build-configuratie:
pt: Configuração de compilação:
zh_cn: 构建（*build*）配置：

source: [*auto-tests*](#automatic-target-discovery): Toggle automatic discovery of test executables
de: [*auto-tests*](#automatic-target-descovery): Automatische Erkennung von Test Programmen
es: [*auto-tests*](#automatic-target-discovery): Reconocimiento automático de ejecutables de prueba
fr: [*auto-tests*](#automatic-target-discovery) : activer la découverte automatique des exécutables des tests
in: [*ऑटो-टेस्ट*](#स्वचालित-लक्ष्य-खोज): परीक्षण निष्पादनयोग्य की स्वत: खोज को टॉगल करें
ja: [*auto-tests*](#automatic-target-discovery): テスト用実行ファイルの自動検出の切替
nl: [*auto-tests*](#automatic-target-descovery): Automatische herkenning van testprogramma's
pt: [*auto-tests*](#automatic-target-discovery): Alterna a descoberta automática dos executáveis de teste
zh_cn: [*auto-tests*](#automatic-target-discovery)：切换测试程序的自动发现

source: [*auto-examples*](#automatic-target-discovery): Toggle automatic discovery of example programs
de: [*auto-examples*](#automatic-target-discovery): Automatische Erkennung von Beispiel Programmen
es: [*auto-examples*](#automatic-target-discovery): Reconocimiento automático de programas de ejemplo
fr: [*auto-exemples*](#automatic-target-discovery) : activer la découverte automatique d'exemples
in: [*ऑटो-उदाहरण*](#स्वचालित-लक्ष्य-खोज): उदाहरण कार्यक्रमों की स्वचालित खोज को टॉगल करें
ja: [*auto-examples*](#automatic-target-discovery): サンプルプログラムの自動検出の切替
nl: [*auto-examples*](#automatic-target-discovery): Automatische herkenning van voorbeeldprogramma's
pt: [*auto-examples*](#automatic-target-discovery): Alterna a descoberta automática de programas de exemplo
zh_cn: [*auto-examples*](#automatic-target-discovery)：切换示例程序的自动发现

source: [*auto-executables*](#automatic-target-discovery): Toggle automatic discovery of executables
de: [*auto-executables*](#automatic-target-discovery): Automatische Erkennung von Programmen
es: [*auto-executables*](#automatic-target-discovery): Reconocimiento automático de ejecutables
fr: [*auto-executables*](#automatic-target-discovery) : activer la découverte automatique d'exécutables
in: [*auto-executables*](#automatic-target-discovery): निष्पादनयोग्य की स्वत: खोज को टॉगल करें
ja: [*auto-executables*](#automatic-target-discovery): 実行ファイルの自動検出の切替
nl: [*auto-executables*](#automatic-target-discovery): Schakel automatische herkenning van programma's aan/uit
pt: [*auto-executables*](#automatic-target-discovery): Alterna o reconhecimento automático de executáveis
zh_cn: [*auto-executables*](#automatic-target-discovery)：切换应用程序的自动发现

source: [*link*](#link-external-libraries): Link with external dependencies
de: [*link*](#link-external-dependencies): Link mit externen Abhängigkeiten
es: [*link*](#link-external-libraries): Enlace con dependencias externas
fr: [*link*](#link-external-libraries) : lier à des dépendances externes
in: [*link*](#link-external-libraries): बाहरी निर्भरताओं के साथ लिंक
ja: [*link*](#link-external-libraries): 外部依存関係とのリンク
nl: [*link*](#link-external-dependencies): Link met externe afhankelijkheden
pt: [*link*](#link-external-libraries): Vínculo com dependências externas
zh_cn: [*link*](#link-external-libraries)：与外部依赖项的链接

source: [*external-modules*](#use-system-installed-modules): Specify modules used that are not within your fpm package
de: [*external-modules*](#use-system-installed-moduled): Module, die nicht innerhalb des fpm Paketes definiert werden
es: [*external-modules*](#use-system-installed-modules): Especificar los módulos que no están en su paquete de fpm
fr: [*external-modules*](#use-system-installed-modules) : spécifier les modules utilisés qui ne font pas partie de votre paquet fpm
in: [*external-modules*](#use-system-installed-modules): उपयोग किए गए मॉड्यूल निर्दिष्ट करें जो आपके fpm पैकेज के भीतर नहीं हैं
ja: [*external-modules*](#use-system-installed-modules): fpmパッケージ内に存在しないモジュールの指定
nl: [*external-modules*](#use-system-installed-moduled): Modules, die niet binnen het fpm pakket zelf gedefinieerd worden
pt: [*external-modules*](#use-system-installed-modules): Define módulos usados que não usados de dentro do seu pacote fpm
zh_cn: [*external-modules*](#use-system-installed-modules)：指定不在fpm包中使用的模块

source: Fortran configuration:
fr: Configuration Fortran :
zh_cn: Fortran配置：

source: [*implicit-typing*](#implicit-typing): Toggle default implicit typing
fr: [*implicit-typing*](#implicit-typing) : Basculer le typage implicite par défaut
zh_cn: [*implicit-typing*](#implicit-typing)：切换默认的隐式类型声明

source: [*implicit-external*](#implicit-external): Toggle implicit external interfaces
fr: [*implicit-external*](#implicit-external) : Basculer les interfaces externes implicites
zh_cn: [*implicit-external*](#implicit-external)：切换隐式外部接口

source: [*source-form*](#source-form): Select source form for project
fr: [*source-form*](#source-form) : Sélectionner le format de code source du projet
zh_cn: [*source-form*](#source-form)：选择项目的源形式

source: Target sections:
de: Target-Abschnitte:
es: Secciones de destino:
fr: Sections relatives aux cibles :
in: लक्षित अनुभाग:
ja: 構築対象に関する設定項目
nl: Target-secties:
pt: Seção de alvos:
zh_cn: 目标部分：

source: [*library*](#library-configuration) Configuration of the library target
de: [*library*](#library-configuration) Konfiguration des Library-Targets
es: [*library*](#library-configuration) Configuración de la biblioteca objetivo
fr: [*library*](#library-configuration) configuration de la bibliothèque cible
in: [*लाइब्रेरी*](#लाइब्रेरी-कॉन्फ़िगरेशन) लाइब्रेरी लक्ष्य का कॉन्फ़िगरेशन
ja: [*library*](#library-configuration) ビルドされるライブラリの設定
nl: [*library*](#library-configuration) Configuratie van de bibliotheek-targets
pt: [*library*](#library-configuration) Configuração da biblioteca alvo
zh_cn: [*library*](#library-configuration)：函数库目标的配置

source: [*executable*](#executable-targets) Configuration of the executable targets
de: [*executable*](#executable-targets) Konfiguration der Executable-Targets
es: [*executable*](#executable-targets) Configuración del ejecutable
fr: [*executable*](#executable-targets) configuration des exécutables cibles
in: [* निष्पादन योग्य *] (# निष्पादन योग्य-लक्ष्य) निष्पादन योग्य लक्ष्यों का विन्यास
ja: [*executable*](#executable-targets) ビルドされる実行ファイルの設定
nl: [*executable*](#executable-targets) Configuratie van de targets voor executables
pt: [*executable*](#executable-targets) Configuração de alvos executáveis
zh_cn: [*executable*](#executable-targets)：应用程序目标的配置

source: [*test*](#test-targets) Configuration of the test targets
de: [*test*](#test-targets) Konfiguration der Test-Targets
es: [*test*](#test-targets) Configración de pruebas
fr: [*test*](#test-targets) configuration des tests cibles
in: [*test*](#test-targets) परीक्षण लक्ष्यों का विन्यास
ja: [*test*](#test-targets) ビルドされるテストの設定
nl: [*test*](#test-targets) Configuratie van de test-targets
pt: [*test*](#test-targets) Configuração dos alvos de teste
zh_cn: [*test*](#test-targets)：测试程序目标的配置

source: Dependency sections:
de: Abhängigkeiten-Abschnitte:
es: Sección de dependencias:
fr: Sections concernant les dépendances :
in: निर्भरता अनुभाग:
ja: 依存関係に関する設定項目
nl: Secties voor afhankelijkheden:
pt: Seção de dependências:
zh_cn: 依赖项（*dependencies*）部分：

source: [*dependencies*](#specifying-dependencies): Project library dependencies
de: [*dependencies*](#specifying-dependencies): Abhängigkeiten des Projekts
es: [*dependencies*](#specifying-dependencies): Dependencias de la biblioteca del proyecto
fr: [*dependencies*](#specifying-dependencies) : dépendances de la bibliothèque du projet
in: [*निर्भरताएं*](#निर्दिष्ट-निर्भरताएं): प्रोजेक्ट लाइब्रेरी निर्भरताएं
ja: [*dependencies*](#specifying-dependencies): プロジェクトが参照するライブラリの依存関係
nl: [*dependencies*](#specifying-dependencies): Bibliotheken gebruikt in het project
pt: [*dependencies*](#specifying-dependencies): Dependências da biblioteca do projeto
zh_cn: [*dependencies*](#specifying-dependencies)：项目库依赖项Projekts

source: [*dev-dependencies*](#development-dependencies): Dependencies only needed for tests
de: [*dev-dependencies*](#development-dependencies): Abhängigkeiten, die nur für Tests benötigt werden
es: [*dev-dependencies*](#development-dependencies): Dependencias necesarias solo para pruebas
fr: [*dev-dependencies*](#development-dependencies) : dépendances nécessaires uniquement pour les tests
in: [*देव-निर्भरता*](#विकास-निर्भरता): केवल के लिए आवश्यक निर्भरता परीक्षण
ja: [*dev-dependencies*](#development-dependencies): テストのみに必要な依存関係
nl: [*dev-dependencies*](#development-dependencies): Afhankelijkheden die alleen nodig zijn voor de testen
pt: [*dev-dependencies*](#development-dependencies): Dependências necessárias apenas para os testes
zh_cn: [*dev-dependencies*](#development-dependencies)：仅测试需要的依赖关系

source: [*install*](#installation-configuration): Installation configuration
de: [*install*](#installation-configuration): Installation-Konfiguration
es: [*install*](#installation-configuration): Configuración de la instalación
fr: [*install*](#installation-configuration) : configuration de l'installation
in: [*इंस्टॉल*](#इंस्टॉलेशन-कॉन्फ़िगरेशन): इंस्टॉलेशन कॉन्फ़िगरेशन
ja: [*install*](#installation-configuration): インストール設定
nl: [*install*](#installation-configuration): Installatieconfiguratie
pt: [*install*](#installation-configuration): Configuração da instalação
zh_cn: [*install*](#installation-configuration)：安装配置
