Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Projects which use the Fortran `include` statement or C preprocessor `#include` statement, can use the *include-dir* key to specify search directories for the included files. *include-dir* can contain one or more directories, where multiple directories are specified using a list of strings. Include directories from all project dependencies are passed to the compiler using the appropriate compiler flag.
de: Projekte, die die Fortran-Include-Anweisung oder die C-Präprozessor-Include-Anweisung verwenden, können das Schlüsselwort *include-dir* verwenden, um die Verzeichnisse für die eingebundenen Dateien anzugeben. *include-dir* kann ein oder mehrere Verzeichnisse enthalten, in denen mehrere Verzeichnisse als Liste von Strings angegeben werden. Die Include-Verzeichnisse aller Projekt-Abhängigkeiten werden dem Compiler mittels dem entsprechenden Kompilierungsoptionen übergeben.
es: Proyectos que usan la instrucción `include` o la instrucción de preprocesamiento `#include`, pueden usar la clave *include-dir* para especificar la busqueda en directorios de los archivos incluidos. *include-dir* puede contener uno o mas directorios, donde múltiples directorios son especificados usando una lista de cadenas de caracteres. Directorios incluir de todos los proyectos son pasados al compilador usando la opción de compilación apropiada.
fr: Les projets qui utilisent l'instruction Fortran `include` ou l'instruction du préprocesseur C `#include`, peuvent utiliser la clé *include-dir* pour spécifier les répertoires de recherche des fichiers inclus. *include-dir* peut contenir un ou plusieurs répertoires, les répertoires multiples étant spécifiés en utilisant une liste de chaînes de caractères. Les répertoires de fichiers inclus de toutes les dépendances du projet sont transmis au compilateur en utilisant l'indicateur de compilateur approprié.
in: प्रोजेक्ट जो फोरट्रान `इन्क्लूड` स्टेटमेंट या सी प्रीप्रोसेसर `#शामिल` स्टेटमेंट का उपयोग करते हैं, शामिल फाइलों के लिए खोज निर्देशिका निर्दिष्ट करने के लिए *शामिल-डीआईआर* कुंजी का उपयोग कर सकते हैं। *शामिल-डीआईआर* में एक या अधिक निर्देशिकाएं हो सकती हैं, जहां स्ट्रिंग्स की सूची का उपयोग करके कई निर्देशिकाओं को निर्दिष्ट किया जाता है। सभी प्रोजेक्ट निर्भरताओं से निर्देशिका शामिल करें उपयुक्त कंपाइलर ध्वज का उपयोग करके कंपाइलर को पास कर दिया गया है।
ja: Fortranの`include`文やCプリプロセッサの`#include`文を使用するプロジェクトでは，*include-dir*をインクルードファイルの探索ディレクトリの指定に利用できます．*include-dir*は一つ以上のディレクトリを指定でき，複数のディレクトリを指定するには文字列のリストを用います．依存関係で指定される全てのインクルードディレクトリは，適切なコンパイラフラグを介してコンパイラに渡されます．
nl: Projecten, die het Fortran include-statement of het `#include` statement van de C-preprocessor gebruiken, kunnen via het sleutelwoord *include-dir* aangeven welke directories de mee te nemen bronbestanden bevatten. *include-dir* bestaat uit een of meer directorynamen als een lijst van strings. De include-directories van alle project-afhankelijkheden worden aan de compiler door middel van de juiste opties doorgegeven.
pt: Projetos que usam o comando `include` do Fortran ou o comando `#include` do preprocessador da linguagem C, podem usar a chave *include-dir* para definir diretórios de busca para a inclusão dos ficheiros. *include-dir* pode conter um ou mais diretórios, onde múltiplos diretórios são definidos usando uma lista de cadeias. Os diretórios incluídos por todas as dependências do projeto serão passadas ao compilador com a flag apropriada.
zh_cn: 使用 Fortran `include` 语句或 C 预处理器 `#include` 语句的项目可以使用包含目录（*include-dir*）键为包含的文件指定搜索目录。包含目录（*include-dir*）可以包含一个或多个目录，其中使用字符串列表指定多个目录。所有项目依赖项中的包含目录都使用相应的编译器标志传递给编译器。

source: *include-dir* does not currently allow using pre-built module `.mod` files
de: *include-dir* erlaubt derzeit keine Verwendung von breits kompilierten `.mod`-Dateien
es: *include-dir* actualmente no permite usar archivos `.mod` del módulo predefinido
fr: *include-dir* ne permet pas actuellement d'utiliser les fichiers `.mod` de modules préconstruits
in: *include-dir* वर्तमान में पूर्व-निर्मित मॉड्यूल `.mod` फ़ाइलों का उपयोग करने की अनुमति नहीं देता है
ja: 現在の所，*include-dir*はビルド済みモジュールである`.mod`ファイルを使用できません．
nl: Op dit moment kan *include-dir* niet gebruikt worden voor voorgecompileerde modules files `.mod`
pt: *include-dir* atualmente não permite usar módulos `.mod` pré-compilados
zh_cn: 包含目录（*include-dir*）当前不允许使用预构建的`.mod`模块文件

source: Executable targets
de: Ausführbare Ziele
es: Ejecutables objetivo
fr: Cibles exécutables
in: निष्पादन योग्य लक्ष्य
ja: 実行ファイル
nl: Targets voor executables
pt: Executáveis-alvo
zh_cn: 可执行目标

source: Executable targets are Fortran programs defined as *executable* sections. If no executable section is specified the ``app`` directory is searched for program definitions. For explicitly specified executables the *name* entry must always be specified. The source directory for each executable can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
de: Ausführbare Ziele sind Fortran-Programme definiert als *executable*-Sektionen. Wenn keine executable-Sektion angegeben ist, wird das ``app``-Verzeichnis für Programmdefinitionen gesucht. Für explizit angegebene Ausführbare muss immer das *name*-Eintrag angegeben werden. Das Quell-Verzeichnis für jedes Ausführbare kann in dem *source-dir*-Eintrag angepasst werden. Pfade für das Quell-Verzeichnis sind relativ zum Projekt-Wurzelverzeichnis und verwenden ``/`` als Pfad-Trenner auf allen Plattformen. Die Quell-Datei mit dem Programm-Körper kann in dem *main*-Eintrag angegeben werden.
es: Ejecutables objetivo son programas en Fortran definidos como secciones *executable*. Si ninguna sección ejecutable es especificada, el directorio ``app`` es buscado desde las definiciones del programa. Para especificar explicitamente los ejecutables la entrada *name* debe ser siempre dada. Las rutas para el directorio fuente son dados relativos al proyecto raiz y usan ``/`` como separador de rutas en todas las plataformas. El archivo fuente conteniendo el cuerpo del programa puede ser especificado en la entrada *main*.
fr: Les cibles exécutables sont des programmes Fortran définis par des sections *executable*. Si aucune section *executable* n'est spécifiée, le répertoire ``app`` est recherché pour les déclarations de programmes. Pour les exécutables explicitement spécifiés, l'entrée *name* doit toujours être renseignée. Le répertoire source de chaque exécutable peut être modifié dans l'entrée *source-dir*. Les chemins pour le répertoire source sont donnés relativement à la racine du projet et utilisent ``/`` comme séparateur de chemin sur toutes les plateformes. Le fichier source contenant le corps du programme peut être spécifié dans l'entrée *main*.
in: निष्पादन योग्य लक्ष्य फोरट्रान कार्यक्रम हैं जिन्हें *निष्पादन योग्य* वर्गों के रूप में परिभाषित किया गया है। यदि कोई निष्पादन योग्य अनुभाग निर्दिष्ट नहीं किया गया है तो प्रोग्राम परिभाषाओं के लिए ``app`` निर्देशिका खोजी जाती है। स्पष्ट रूप से निर्दिष्ट निष्पादकों के लिए *name* प्रविष्टि हमेशा निर्दिष्ट होनी चाहिए। प्रत्येक निष्पादन योग्य के लिए स्रोत निर्देशिका को *source-dir* प्रविष्टि में समायोजित किया जा सकता है। स्रोत निर्देशिका के लिए पथ प्रोजेक्ट रूट के सापेक्ष दिए गए हैं और सभी प्लेटफॉर्म पर पथ विभाजक के रूप में ``/`` का उपयोग करते हैं। प्रोग्राम बॉडी वाली स्रोत फ़ाइल को *मुख्य* प्रविष्टि में निर्दिष्ट किया जा सकता है।
ja: 実行ファイルは，*executable*設定項目で指定されたFortranのプログラムです．もし*executable*が書かれていない場合，``app``ディレクトリで``program``の定義が探索されます．明示的に実行ファイルを設定する場合，*name*が指定されている必要があります．各実行ファイルのソースディレクトリは，*source-dir*で設定できます．ソースディレクトリへのパスは，プロジェクト直下からの相対パスで与え，パスの区切りには``/``を用います．メインルーチンが定義されているソースファイルの名前は，*main*で指定します．
nl: Targets die uitvoerbare programma's definiëren staan in de secties *executable*. Als er geen *executable* secties zijn gegeven, wordt in plaats daarvan de directory ``app`` onderzocht. Voor expliciet aangegeven executables moet altijd de *name*-entry opgegeven worden. De brondirectory voor elek executable kan in de entry *source-dir* aangepast worden. Paden voor de source-directory zijn relatief t.o.v. de hoofddirectory van het projecten en gebruiken``/`` als padscheiding op alle plattforms. Het bronbestanden met het hoofdprogramma is aan te geven met de entry *main*.
pt: Executáveis-alvo são programas em Fortran definidos nas seções *executable*. Se nenhuma seção desse tipo for definida o diretório ``app`` é vasculhado para encontrar definições de programas. Para executáveis definidos explicitamente o campo *name* precisa sempre estar definido O diretório do código-fonte para cada executável pode ser ajustado com o campo *source-dir*. Os caminhos são sempre dados relativos a raiz do projeto e usa ``/`` como separador em todas as plataformas. O código fonte contendo o corpo do programa pode ser definido no campo *main*.
zh_cn: 可执行目标是定义为可执行部分的Fortran程序。如果未指定可执行文件（*executable*）部分，则会在``app``目录中搜索程序定义。对于显式指定的可执行文件，必须始终指定名称（*name*）条目。每个可执行文件的源目录都可以在源目录（*source-dir*）条目中进行调整。源目录的路径是相对于项目根目录给出的，并在所有平台上使用``/``用作路径分隔符。可以在主（*main*）条目中指定包含程序正文的源文件。

source: Executables can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
de: Ausführbare Programme können ihre eigenen Abhängigkeiten haben. Siehe [spezifizieren von Abhängigkeiten](#spezifizieren-von-abhaengigkeiten) für weitere Details.
es: Ejecutables pueden tener sus propias depedencias. Ver [especificar dependencias](#specifying-dependencies) para mas detalles.
fr: Les exécutables peuvent avoir leurs propres dépendances. Voir [specifying dependencies](#specifying-dependencies) pour plus de détails.
in: एक्ज़ीक्यूटेबल्स की अपनी निर्भरताएँ हो सकती हैं। अधिक विवरण के लिए [निर्दिष्ट निर्भरताएं](#निर्दिष्ट-निर्भरताएं) देखें।
ja: 複数の実行ファイルがある場合，実行ファイルごとに依存関係を持つことができます．[依存関係の指定](#specifying-dependencies)を参照してください．
nl: Executables kunnen elk hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.
pt: Executáveis podem ter suas próprias dependências. Veja [definindo dependências](#specifying-dependencies) para mais detalhes.
zh_cn: 可执行文件可以有自己的依赖项。有关更多详细信息，请参阅[指定依赖项](#specifying-dependencies)。

source: Executables can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
de: Ausführbare Programme können auch ihre eigenen externen Bibliotheksabhängigkeiten spezifizieren. Siehe [externe Bibliotheken](#link-external-libraries) für weitere Details.
es: Ejecutables también pueden especificar su propias depedencias externas de biblioteca. Ver [bibliotecas externas](#link-external-libraries) para mas detalles.
fr: Les exécutables peuvent également spécifier leurs propres dépendances vis-à-vis des bibliothèques externes. Voir [external libraries](#link-external-libraries) pour plus de détails.
in: एक्ज़ीक्यूटेबल्स अपनी स्वयं की बाहरी लाइब्रेरी निर्भरताओं को भी निर्दिष्ट कर सकते हैं। अधिक विवरण के लिए [बाहरी पुस्तकालय](#link-external-पुस्तकालय) देखें।
ja: 複数の実行ファイルがある場合，実行ファイルごとに外部ライブラリを指定できます．[外部ライブラリのリンク](#link-external-libraries)を参照してください．
nl: Executables kunnen afzonderlijk afhangen van specifieke bibliotheken. Zie [externe bibliotheken](#link-externe-bibliotheken) voor verdere details.
pt: Executáveis também podem definir suas próprias dependências em bibliotecas externas. Veja [bibliotecas externas](#link-external-libraries) para mais detalhes.
zh_cn: 可执行文件还可以指定自己的外部库依赖项。有关更多详细信息，请参阅[外部库](#link-external-libraries)。

source: Linking against libraries is supported in Fortran fpm only
de: Nur Fortran fpm unterstützt das Linken gegen Bibliotheken
es: El vínculo con bibliotecas solo es soportado en Fortran fpm
fr: La liaison avec les bibliothèques n'est supportée qu'avec fpm
in: लाइब्रेरीज़ के विरुद्ध लिंकिंग केवल फोरट्रान एफपीएम में समर्थित है
ja: ライブラリのリンクは，Fortran fpmのみ対応しています．
nl: Linking met bibliotheken wordt binnen fpm alleen voor Fortran ondersteund
pt: Apenas a versão Fortran do fpm possui suporte ao vínculo com bibliotecas
zh_cn: 仅在Fortran fpm中支持针对库的链接

source: Specifying many separate executables can be done by using inline tables for brevity instead
de: Viele separate Ausführbare können auch mittels Inline-Tabellen spezifiziert werden
es: Por brevedad, se puede especificar muchos ejecutables separados usando tablas en línea
fr: Il est possible de spécifier plusieurs exécutables distincts en utilisant un tableau :
in: इसके बजाय संक्षिप्तता के लिए इनलाइन तालिकाओं का उपयोग करके कई अलग-अलग निष्पादनयोग्य निर्दिष्ट किए जा सकते हैं
ja: インラインテーブルを使用することで，多数の実行ファイルに対する個別の指定を簡潔に記述できます．
nl: Als je veel aparte executables hebt, kun je deze specificeren via inline-tabellen.
pt: A definição de múltiplos executáveis separados pode ser feita através do uso de tabelas na mesma linha de forma curta
zh_cn: 指定许多单独的可执行文件可以通过使用内联表来完成，以便简洁

source: Example targets
de: Beispiel-Ziele
es: Ejemplos objetivo
fr: Cibles de type exemple
in: उदाहरण लक्ष्य
ja: サンプル
nl: Voorbeeld-targets
pt: Exemplos-alvo
zh_cn: 示例目标

source: Example applications for a project are defined as *example* sections. If no example section is specified the ``example`` directory is searched for program definitions. For explicitly specified examples the *name* entry must always be specified. The source directory for each example can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
de: Beispiel-Programme für ein Projekt sind definiert als *example*-Sektionen. Wenn keine example-Sektion angegeben ist, wird das ``example``-Verzeichnis für Programmdefinitionen gesucht. Für explizit angegebene Beispiele muss immer das *name*-Eintrag angegeben werden. Das Quell-Verzeichnis für jedes Beispiel kann in dem *source-dir*-Eintrag angepasst werden. Pfade für das Quell-Verzeichnis sind relativ zum Projekt-Wurzelverzeichnis und verwenden ``/`` als Pfad-Trenner auf allen Plattformen. Die Quell-Datei mit dem Programm-Körper kann in dem *main*-Eintrag angegeben werden.
es: Programas de ejemplo para un proyecto son definidos como secciones *example*. Sininguna sección ejemplo es especificada, el directorio ``example`` es buscado en las definiciones del programa. Para especficar ejemplos explicitamente la entrada *name* debe siempre ser dada. El directorio fuente para cada ejemplo puede ser ajustado en la entrada *source-dir*. Rutas para el directorio fuente son dadas relativas al proyecto raiz y usan ``/`` como separador en todas las plataformas. El archivo fuente continiendo el cuerpo del programa puede ser especificado en la entrada *main*.
fr: Les applications d'exemple d'un projet sont définies par des sections *example*. Si aucune section *example* n'est spécifiée, le répertoire ``example`` est recherché et analysé. Pour les exemples explicitement déclarés, l'entrée *name* doit toujours être renseignée. Le répertoire source de chaque exemple peut être modifié dans l'entrée *source-dir*. Les chemins pour le répertoire source sont donnés relativement à la racine du projet et utilisent ``/`` comme séparateur de chemin sur toutes les plateformes. Le fichier source contenant le corps du programme peut être indiqué dans l'entrée *main*.
in: किसी प्रोजेक्ट के लिए उदाहरण एप्लिकेशन को *example* सेक्शन के रूप में परिभाषित किया गया है। यदि कोई उदाहरण खंड निर्दिष्ट नहीं किया गया है तो प्रोग्राम परिभाषाओं के लिए ``उदाहरण`` निर्देशिका खोजी जाती है। स्पष्ट रूप से निर्दिष्ट उदाहरणों के लिए *नाम* प्रविष्टि हमेशा निर्दिष्ट होनी चाहिए। प्रत्येक उदाहरण के लिए स्रोत निर्देशिका को *source-dir* प्रविष्टि में समायोजित किया जा सकता है। स्रोत निर्देशिका के लिए पथ प्रोजेक्ट रूट के सापेक्ष दिए गए हैं और सभी प्लेटफॉर्म पर पथ विभाजक के रूप में ``/`` का उपयोग करते हैं। प्रोग्राम बॉडी वाली स्रोत फ़ाइल को *मुख्य* प्रविष्टि में निर्दिष्ट किया जा सकता है।
ja: プロジェクトのサンプルアプリケーションは，*example*設定項目で定義されます．もし*example*が指定されていない場合，``example``ディレクトリで``program``の定義が探索されます．明示的にサンプルを設定する場合，*name*が指定されている必要があります．各サンプルのソースディレクトリは，*source-dir*で設定できます．ソースディレクトリへのパスは，プロジェクト直下からの相対パスで与え，パスの区切りには``/``を用います．プログラム本体を含むソースファイルの名前は，*main*で指定します．
nl: Vorobeeldprogramma's voor een project worden gedefinieerd via *example*-secties. Als er geen sectie ``example`` opgegeven is, wordt de directory ``example`` onderzocht voor definities van programma's. Voor expliciet opgegeven voorbeelden is altijd de *name*-entry nodig. De brondirectory voor elk voorbeeld kan in de *source-dir*-entry aangepast worden. Paden voor de brondirectory zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als padscheiding op alle plattforms. Het bronbestand met het hoofdprogramma kan in de *main*-entry aangegeven worden.
pt: Aplicações de exemplo para um projeto são definidas so a seção *example*. Se nenhuma seção de exemplo for definida o diretório ``example`` será vasculhado para encontrar definições de programas. Para exemplos explicitamente definidos o campo *name* também deve estar definido. Os diretórios dos código-fonte dos exemplos pode ser ajustada no campo *source-dir*. Os caminhos são sempre relativos a raiz do projeto e usa ``/`` como separador em todas as plataformas. O código-fonte contendo o corpo do programa pode ser definido no campo *main*.
zh_cn: 项目的示例应用程序被定义为示例部分。如果未指定示例（*example*）部分，则会在``example``目录中搜索程序定义。对于显式指定的示例，必须始终指定名称（*name*）条目。每个示例的源目录都可以在源目录（*source-dir*）条目中进行调整。源目录的路径是相对于项目根目录给出的，并在所有平台上使用``/``用作路径分隔符。可以在主（*main*）条目中指定包含程序正文的源文件。

source: Examples can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
de: Beispiel-Programme können ihre eigenen Abhängigkeiten haben. Siehe [spezifizieren von Abhängigkeiten](#spezifizieren-von-abhaengigkeiten) für weitere Details.
es: Programas ejemplo pueden tener sus propias dependencias. Ver [especificar dependencies](#specifying-dependencies) para mas detalles.
fr: Les exemples peuvent avoir leurs propres dépendances. Voir [specifying dependencies](#specifying-dependencies) pour plus de détails.
in: उदाहरणों की अपनी निर्भरताएँ हो सकती हैं। अधिक विवरण के लिए [निर्दिष्ट निर्भरताएं](#निर्दिष्ट-निर्भरताएं) देखें।
ja: 複数のサンプルがある場合，サンプルごとに依存関係を持つことができます．[依存関係の指定](#specifying-dependencies)を参照してください．
nl: Voorbeeldprogramma's kunnen hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.
pt: Exemplos podem ter suas próprias dependências. Veja [definir dependências](#specifying-dependencies) para mais detalhes.
zh_cn: 可执行文件可以有自己的依赖项。有关更多详细信息，请参阅[指定依赖项](#specifying-dependencies)。

source: Examples can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
de: Beispiel-Programme können auch ihre eigenen externen Bibliotheksabhängigkeiten spezifizieren. Siehe [externe Bibliotheken](#link-external-libraries) für weitere Details.
es: Programas ejemplos tambien pueden especificar sus propias dependencias de biblioteca. Ver [bibliotecas externas](#link-external-libraries) para mas detalles.
fr: Les exemples peuvent également avoir leurs propres dépendances vis-à-vis de bibliothèques externes. Voir [external libraries](#link-external-libraries) pour plus de détails.
in: उदाहरण अपने स्वयं के बाहरी पुस्तकालय निर्भरताओं को भी निर्दिष्ट कर सकते हैं। अधिक विवरण के लिए [बाहरी पुस्तकालय](#link-external-पुस्तकालय) देखें।
ja: 複数のサンプルがある場合，サンプルごとに外部ライブラリを指定できます．[外部ライブラリ](#link-external-libraries)を参照してください．
nl: Voorbeeldprogramma's kunnen afzonderlijk van externe bibliotheken afhangen. Zie [externe bibliotheken](#link-externe-bibliotheken) voor verdere details.
pt: Exemplos podem definir suas próprias dependências de bibliotecas externas. Veja [bibliotecas externas](#link-external-libraries) para mais detalhes.
zh_cn: 可执行文件还可以指定自己的外部库依赖项。有关更多详细信息，请参阅[外部库](#link-external-libraries)。

source: Test targets
de: Test-Ziele
es: Pruebas objetivo
fr: Cibles de type test
in: परीक्षण लक्ष्य
ja: テスト
nl: Targets voor testen
pt: Testes-alvo
zh_cn: 测试目标
