Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: If you can't run the install script, you can perform the bootstrap procedure manually, with the following three steps:
de: Wenn das Skript nicht ausgeführt werden kann, kann der Bootstrap-Prozess manuell durchführen, mit den folgenden drei Schritten:
es: Si no puede ejecutar la secuencia de comandos para la instalación, puede iniciar el procedimiento manualmente con los tres pasos siguientes:
fr: Si vous ne pouvez pas exécuter le script d'installation, vous pouvez réaliser la procédure d'amorçage manuellement, en suivant ces trois étapes :
in: यदि आप इंस्टॉल स्क्रिप्ट नहीं चला सकते हैं, तो आप बूटस्ट्रैप प्रक्रिया को मैन्युअल रूप से, निम्नलिखित तीन चरणों के साथ निष्पादित कर सकते हैं:
ja: インストールスクリプトが実行されない場合は，以下の三手順で自己構築を手動実行します．
nl: Als je het script niet kunt uitvoeren, kan het bootstrap-proces handmatig doorlopen worden, met de volgende drie stappen:
pt: Se você não conseguir rodar o script de instalação, você pode realizar o procedimento manualmente, com os seguintes passos:
zh_cn: 如果无法运行安装脚本，则可以通过以下三个步骤手动执行自举安装过程：

source: Download the single source version of fpm
de: Lade die einzelne Quellversion von fpm herunter
es: Descargue la versión de fuente única de fpm
fr: Télécharger fpm sous forme d'un fichier source unique
in: एफ पी एम का एकल स्रोत संस्करण डाउनलोड करें
ja: fpmの単一版ソースをダウンロードします．
nl: Download het enkele bronbestand voor fpm
pt: Baixe a versão de código-fonte único do fpm
zh_cn: 下载 fpm 的单一源文件版本

source: Build a bootstrap binary from the single source version
de: Baue ein Bootstrap-Binary aus der einzelnen Quellversion
es: Construya un binario de inicio desde la versión de fuente única
fr: Construire un binaire d'amorçage à partir du fichier source unique
in: एकल स्रोत संस्करण से बूटस्ट्रैप बाइनरी बनाएँ
ja: 単一版ソースから自己構築用バイナリをビルドします．
nl: Bouw een bootstrap-executable met dit enkele bronbestand
pt: Compile um executável inicial a partir da versão de código-fonte único
zh_cn: 从单一源文件版本构建引导二进制文件

source: Use the bootstrap binary to build the feature complete fpm version
de: Verwende das Bootstrap-Binary, um die fpm mit vollem Funktionsumfang zu bauen
es: Use el binario de inicio para construir la versión completa de fpm
fr: Utilisez le binaire d'amorçage pour construire la version complète de fpm
in: सुविधा पूर्ण fpm संस्करण बनाने के लिए बूटस्ट्रैप बाइनरी का उपयोग करें
ja: 自己構築用バイナリを使用し，完全版のfpmをビルドします．
nl: Gebruik de bootstrap-executable om fpm met volledige functionaliteit te bouwen
pt: Use o executável inicial para compilar a versão completa do fpm
zh_cn: 使用自举二进制文件构建功能完整的 fpm 版本

source: News
de: Aktuelles
es: Noticias
fr: Actualités
in: समाचार
ja: 新着情報
nl: Actualités
pt: Notícias
zh_cn: 新闻

source: Fpm version 0.5.0 released
de: Fpm-Version 0.5.0 veröffentlicht
es: Lanzamiento fpm versión 0.5.0
fr: Fpm 0.5.0 est sorti
in: एफपीएम संस्करण 0.5.0 जारी किया गया
ja: Fpm 0.5.0をリリースしました
nl: Fpm 0.5.0 uitgebracht
pt: Lançada a versão 0.5.0 do fpm
zh_cn: Fpm 0.5.0 版本发布

source: We have a large number of bug fixes in this release and made plenty of improvements to the tooling around fpm, like the continuous delivery and the Windows installer. New features include the possibility for better compiler/linker selection and the improved build backend (test are only build when needed, link dependencies are properly tracked).
de: Wir haben eine große Anzahl von Fehlerkorrekturen in dieser Version und viele Verbesserungen an den Werkzeugen rund um fpm vorgenommen, wie die kontinuierliche Bereitstellung und den Windows-Installer. Zu den neuen Funktionen gehören die Möglichkeit einer besseren Auswahl von Compilern/Linkern und ein verbessertes Build-Backend (Tests werden nur bei Bedarf gebaut, Link-Abhängigkeiten werden korrekt verfolgt).
es: Tenemos una gran cantidad de correcciones de errores en esta versión y realizamos muchas mejoras en las herramientas en torno a fpm, como la entrega continua y el instalador de Windows. Las nuevas características incluyen la posibilidad de una mejor selección del compilador/enlazador y el backend de compilación mejorado (las pruebas solo se compilan cuando es necesario, las dependencias de los enlaces se rastrean correctamente).
fr: Nous avons corrigé un grand nombre de bogues dans cette version et apporté de nombreuses améliorations autour de fpm, comme la livraison continue et l'installateur Windows. Les nouvelles fonctionnalités incluent une sélection améliorée du compilateur et de l'éditeur de liens et l'amélioration du backend de construction (les tests ne sont construits que lorsque cela est nécessaire, les modifications dans les bibliothèques liées mènent à une reconstruction correcte).
in: हमारे पास इस रिलीज में बड़ी संख्या में बग फिक्स हैं और एफपीएम के आसपास टूलिंग में बहुत सारे सुधार किए गए हैं, जैसे निरंतर वितरण और विंडोज इंस्टॉलर। नई सुविधाओं में बेहतर कंपाइलर / लिंकर चयन और बेहतर बिल्ड बैकएंड की संभावना शामिल है (परीक्षण केवल आवश्यकता होने पर बनाया जाता है, लिंक
ja: このリリースには，多くのバグ修正があり，また継続的デリバリやWindowsインストーラといったfpmの周辺ツールに多くの改善が加えられています．新機能として，コンパイラ・リンカの選択の幅が広がり，バックエンドが改善されました．（テストは必要な場合にのみビルドされ，リンクの依存関係は適切に追跡されます）
nl: In deze release hebben we een groot aantal bugs opgelost en veel verbeteringen doorgevoerd in de tools bij fpm, zoals continue bouw en levering en de installatie voor Windows. Onder de nieuwe functionaliteit vind je betere mogelijkheden om de compiler/linker te selecteren en een slimmere build-backend (testen worden bijvoorbeeld alleen gebouwd indien nodig en link-afhankelijkheden worden netter bijgehouden).
pt: Temos um grande número de correções nesta versão e foi feito um grande número de melhorias nas ferramentas que rodeiam o fpm, como o CI/CD e o instalador Windows. Novos recursos incluem a possibilidade de uma melhor seleção de compilador/vinculador e um backend de compilação melhorado (testes são compilados apenas quando necessário, dependências vinculadas são rastreadas corretamente).
zh_cn: 我们在此版本中修复了大量错误，并对围绕 fpm 的工具进行了大量改进，例如持续交付和 Windows 安装程序。新功能包括更好的编译器/链接器选择和改进的构建后端（仅在需要时构建测试，正确跟踪链接依赖关系）。

source: Find the full release notes [here](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0).
de: Die vollständigen Versionshinweise sind [hier] (https://github.com/fortran-lang/fpm/releases/tag/v0.5.0) zu finden.
es: Encuentre las notas completas de la versión [Aquí](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0).
fr: Accédez aux notes de version complètes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0).
in: पूर्ण रिलीज नोट्स [यहां] (https://github.com/fortran-lang/fpm/releases/tag/v0.5.0) प्राप्त करें।
ja: リリースノートの全文は[こちら](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0)をご覧ください．
nl: Hier vind je alle releasenotes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0).
pt: Encontre as notas de lançamento completas [aqui](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0).
zh_cn: 在 [此处](https://github.com/fortran-lang/fpm/releases/tag/v0.5.0) 找到完整的发行说明。

source: Changes
de: Änderungen
es: Cambios
fr: Modifications
in: परिवर्तन
ja: 変更点
nl: Wijzigingen
pt: Mudanças
zh_cn: 改变

source: tests are only build for fpm test and not by default anymore ([#572](https://github.com/fortran-lang/fpm/pull/572))
de: Tests werden nur noch für fpm test und nicht mehr standardmäßig erstellt ([#572](https://github.com/fortran-lang/fpm/pull/572))
es: las pruebas solo se crean para fpm test y ya no de forma predeterminada ([#572](https://github.com/fortran-lang/fpm/pull/572))
fr: les tests sont compilés uniquement lors d'un fpm test et non plus par défaut ([#572](https://github.com/fortran-lang/fpm/pull/572))
in: परीक्षण केवल एफपीएम परीक्षण के लिए बनाए जाते हैं और डिफ़ॉल्ट रूप से नहीं([#572](https://github.com/fortran-lang/fpm/pull/572))
nl: testen worden alleen gebouwd met fpm test en niet langer bij verstek ([#572](https://github.com/fortran-lang/fpm/pull/572))
pt: agora os testes são compilados apenas pelo fpm test e não mais por padrão ([#572](https://github.com/fortran-lang/fpm/pull/572))
zh_cn: 测试只为 fpm 测试构建，不再默认 ([#572](https://github.com/fortran-lang/fpm/pull/572))

source: environment variables for setting Fortran and C compiler changed ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
de: Umgebungsvariablen für die Einstellung von Fortran- und C-Compilern geändert ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
es: variables de entorno para configurar el compilador de Fortran y C cambiadas ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
fr: les variables d'environnement pour sélectionner les compilateurs Fortran et C ont été modifiées ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
in: फोरट्रान और सी कंपाइलर सेट करने के लिए पर्यावरण चर बदल गए([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
nl: andere environmentvariabelen voor het kiezen van de Fortran en C compilers ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
pt: mudança nas variáveis de ambiente que controlavam os compiladores de Fortran e C ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))
zh_cn: 用于设置 Fortran 和 C 编译器的环境变量已更改 ([#549](https://github.com/fortran-lang/fpm/pull/549), [#584](https://github.com/fortran-lang/fpm/pull/584))

source: add LFortran optimization flag to release profile ([#597](https://github.com/fortran-lang/fpm/pull/597))
de: LFortran-Optimierungs-Flag zum Release-Profil hinzugefügt ([#597](https://github.com/fortran-lang/fpm/pull/597))
es: agregue el indicador de optimización LFortran al perfil de lanzamiento ([#597](https://github.com/fortran-lang/fpm/pull/597))
fr: ajout du drapeau d'optimisation LFortran au profil Release ([#597](https://github.com/fortran-lang/fpm/pull/597))
in: प्रोफ़ाइल रिलीज़ करने के लिए LFortran ऑप्टिमाइज़ेशन फ़्लैग जोड़ें ([#597](https://github.com/fortran-lang/fpm/pull/597))
nl: optie voor optimalisatie toegevoegd aan het releaseprofiel voor de LFortran compiler ([#597](https://github.com/fortran-lang/fpm/pull/597))
pt: adiciona uma flag de otimização LFortran no perfil de lançamento ([#597](https://github.com/fortran-lang/fpm/pull/597))
zh_cn: 将 LFortran 优化标志添加到发布配置文件 ([#597](https://github.com/fortran-lang/fpm/pull/597))

source: New features
de: Neue Funktionen
es: Nuevas características
fr: Nouvelles fonctionnalités
in: नई सुविधाओं
nl: Nieuwe functonaliteiten
pt: Novos recursos
zh_cn: 新特性

source: command line arguments for linker, archiver and C-compiler added ([#549](https://github.com/fortran-lang/fpm/pull/549))
de: Kommandozeilenargumente für Linker, Archivierer und C-Compiler hinzugefügt ([#549](https://github.com/fortran-lang/fpm/pull/549))
es: Se agregaron argumentos de línea de comando para el enlazador, el archivador y el compilador C ([#549](https://github.com/fortran-lang/fpm/pull/549))
fr: ajout des arguments en ligne de commandes pour l'éditeur de liens, l'archiveur et le compilateur C ([#549](https://github.com/fortran-lang/fpm/pull/549))
in: लिंकर, संग्रहकर्ता और सी-कंपाइलर के लिए कमांड लाइन तर्क जोड़े गए([#549](https://github.com/fortran-lang/fpm/pull/549))
nl: command-lineargumenten toegevoegd voor linker, archiver en C-compiler ([#549](https://github.com/fortran-lang/fpm/pull/549))
pt: adicionados argumentos de linha de comando para o linker, archiver e compilador C ([#549](https://github.com/fortran-lang/fpm/pull/549))
zh_cn: 添加了链接器、存档器和 C 编译器的命令行参数 ([#549](https://github.com/fortran-lang/fpm/pull/549))

source: Fixes
de: Behobene Probleme
es: Correcciones
fr: Corrections de bogues
in: हल
nl: Verbeteringen
pt: Correções
zh_cn: 修复

source: tabs are correctly expanded in source file scanning ([#521](https://github.com/fortran-lang/fpm/pull/521))
de: Tabs werden beim Scannen von Quelldateien korrekt expandiert ([#521](https://github.com/fortran-lang/fpm/pull/521))
es: las tabulaciones se expanden correctamente en el análisis del archivo de origen ([#521](https://github.com/fortran-lang/fpm/pull/521))
fr: les tabulations sont correctement traitées lors de l'analyse des fichiers sources ([#521](https://github.com/fortran-lang/fpm/pull/521))
in: स्रोत फ़ाइल स्कैनिंग में टैब सही ढंग से विस्तारित होते हैं([#521](https://github.com/fortran-lang/fpm/pull/521))
nl: tabs worden nu correct behandeld bij het scannen van de broncode ([#521](https://github.com/fortran-lang/fpm/pull/521))
pt: tabulações são corretamente expandidas durante a análise do ficheiro fonte ([#521](https://github.com/fortran-lang/fpm/pull/521))
zh_cn: Tab 键在源文件扫描中正确展开 ([#521](https://github.com/fortran-lang/fpm/pull/521))

source: installer script will use fpm update to avoid stale dependencies ([#557](https://github.com/fortran-lang/fpm/pull/557))
de: Installer-Skript wird fpm update verwenden, um veraltete Abhängigkeiten zu vermeiden ([#557](https://github.com/fortran-lang/fpm/pull/557))
es: la secuencia de comandos del instalador utilizará la actualización de fpm para evitar dependencias obsoletas ([#557](https://github.com/fortran-lang/fpm/pull/557))
fr: le script d'installation utilisera fpm update pour éviter les dépendances périmées ([#557](https://github.com/fortran-lang/fpm/pull/557))
in: इंस्टॉलर स्क्रिप्ट बासी निर्भरता से बचने के लिए fpm अपडेट का उपयोग करेगी([#557](https://github.com/fortran-lang/fpm/pull/557))
nl: installatiescript gebruikt fpm update om verouderde afhankelijkheden te vermijden ([#557](https://github.com/fortran-lang/fpm/pull/557))
pt: o script instalador agora usará o fpm update para evitar dependências obsoletas ([#557](https://github.com/fortran-lang/fpm/pull/557))
zh_cn: 安装程序脚本将使用 fpm update 来避免过时的依赖项（[#557](https://github.com/fortran-lang/fpm/pull/557)）

source: use multiple build output directories depending on link line options ([#575](https://github.com/fortran-lang/fpm/pull/575))
de: mehrere Build-Ausgabeverzeichnisse abhängig von den Link-Line-Optionen verwenden ([#575](https://github.com/fortran-lang/fpm/pull/575))
es: use múltiples directorios de salida de compilación dependiendo de las opciones de línea de enlace ([#575](https://github.com/fortran-lang/fpm/pull/575))
fr: utiliser plusieurs répertoires pour la construction, en fonction des options pour l'édition de liens ([#575](https://github.com/fortran-lang/fpm/pull/575))
in: लिंक लाइन विकल्पों के आधार पर एकाधिक बिल्ड आउटपुट निर्देशिकाओं का उपयोग करें([#575](https://github.com/fortran-lang/fpm/pull/575))
nl: gebruik meerder uitvoerdirectories afhankelijk van de linkeropties ([#575](https://github.com/fortran-lang/fpm/pull/575))
pt: usar múltiplos diretórios de saída de compilação dependendo das opções de vínculo ([#575](https://github.com/fortran-lang/fpm/pull/575))
zh_cn: 根据链接行选项使用多个构建输出路径 ([#575](https://github.com/fortran-lang/fpm/pull/575))

source: update truncated help text ([#578](https://github.com/fortran-lang/fpm/pull/578))
de: abgeschnittenen Hilfetext aktualisiert ([#578](https://github.com/fortran-lang/fpm/pull/578))
es: actualizar el texto de ayuda truncado ([#578](https://github.com/fortran-lang/fpm/pull/578))
fr: mise à jour du texte tronqué dans l'aide ([#578](https://github.com/fortran-lang/fpm/pull/578))
in: छंटे हुए सहायता पाठ को अपडेट करें ([#578](https://github.com/fortran-lang/fpm/pull/578))
nl: afgebroken helptekst verbeterd ([#578](https://github.com/fortran-lang/fpm/pull/578))
pt: correção de texto de ajuda truncado ([#578](https://github.com/fortran-lang/fpm/pull/578))
zh_cn: 更新截断的帮助文本 ([#578](https://github.com/fortran-lang/fpm/pull/578))

source: fix directory removal in fpm new tests ([#579](https://github.com/fortran-lang/fpm/pull/579))
de: Verzeichnisentfernung in neuen fpm-Tests behoben ([#579](https://github.com/fortran-lang/fpm/pull/579))
es: corrige la eliminación de directorios en fpm nuevas pruebas ([#579](https://github.com/fortran-lang/fpm/pull/579))
fr: résoud le problème du répertoire non supprimé lors d'un fpm new tests ([#579](https://github.com/fortran-lang/fpm/pull/579))
in: fpm नए परीक्षणों में निर्देशिका हटाने को ठीक करें ([#579](https://github.com/fortran-lang/fpm/pull/579))
nl: verwijderen van directories verbeterd in fpm new tests ([#579](https://github.com/fortran-lang/fpm/pull/579))
pt: corrige a remoção de diretórios nos testes do comando fpm new ([#579](https://github.com/fortran-lang/fpm/pull/579))
zh_cn: 修复 fpm 新测试中的路径删除 ([#579](https://github.com/fortran-lang/fpm/pull/579))

source: use MSVS like commands for Intel compilers on Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
de: verwende MSVS-ähnliche Befehle für Intel-Compiler unter Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
es: use comandos similares a MSVS para compiladores Intel en Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
fr: utiliser des commandes du type MSVS pour les compilateurs Intel sous Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
in: विंडोज़ पर इंटेल कंपाइलर्स के लिए एमएसवीएस जैसे कमांड का उपयोग करें([#590](https://github.com/fortran-lang/fpm/pull/590))
nl: gebruik opdrachten van het type MSVS voor de Intel-compilers op Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
pt: usar comandos parecidos com o MSVS nos compiladores Intel para Windows ([#590](https://github.com/fortran-lang/fpm/pull/590))
zh_cn: 在 Windows 上为英特尔编译器使用类似 MSVS 的命令 ([#590](https://github.com/fortran-lang/fpm/pull/590))

source: add critical section to mkdir in backend ([#613](https://github.com/fortran-lang/fpm/pull/613))
de: hinzufügen von kritischen Abschnitt zu mkdir im Backend ([#613](https://github.com/fortran-lang/fpm/pull/613))
es: agregar sección crítica a mkdir en backend ([#613](https://github.com/fortran-lang/fpm/pull/613))
fr: ajout d'une section critique pour mkdir dans le backend ([#613](https://github.com/fortran-lang/fpm/pull/613))
in: बैकएंड में mkdir में महत्वपूर्ण अनुभाग जोड़ें ([#613](https://github.com/fortran-lang/fpm/pull/613))
nl: kritische sectie toegevoegd in het backend voor mkdir ([#613](https://github.com/fortran-lang/fpm/pull/613))
pt: adiciona uma seção crítica ao mkdir no backend ([#613](https://github.com/fortran-lang/fpm/pull/613))
zh_cn: 在后端将 critical section（OpenMP 指令）添加到 mkdir ([#613](https://github.com/fortran-lang/fpm/pull/613))

source: fix modules listing (for install) ([#612](https://github.com/fortran-lang/fpm/pull/612))
de: Modulliste korrigiert (für Installation) ([#612](https://github.com/fortran-lang/fpm/pull/612))
es: lista de módulos fijos (para instalar) ([#612](https://github.com/fortran-lang/fpm/pull/612))
fr: corrige la liste des modules (pour l'installation) ([#612](https://github.com/fortran-lang/fpm/pull/612))
in: मॉड्यूल लिस्टिंग को ठीक करें (इंस्टॉल करने के लिए) ([#612](https://github.com/fortran-lang/fpm/pull/612))
nl: corrigeer de lijst van modules (voor de installatie) ([#612](https://github.com/fortran-lang/fpm/pull/612))
pt: correção da listagem de módulos (para a instalação) ([#612](https://github.com/fortran-lang/fpm/pull/612))
zh_cn: 修复模块列举（用于安装）（[#612](https://github.com/fortran-lang/fpm/pull/612)）

source: repair --list option and correct obsolete descriptions of the --list option ([#607](https://github.com/fortran-lang/fpm/pull/607))
de: Reparatur der Option --list und Korrektur veralteter Beschreibungen der Option --list ([#607](https://github.com/fortran-lang/fpm/pull/607))
es: reparar opción --list y corregir descripción obsoleta de la opción --list ([#607](https://github.com/fortran-lang/fpm/pull/607))
fr: répare l'option --list et corrige les descriptions obsolètes de l'option --list ([#607](https://github.com/fortran-lang/fpm/pull/607))
in: मरम्मत --सूची विकल्प और --सूची विकल्प के अप्रचलित विवरणों को सही करें([#607](https://github.com/fortran-lang/fpm/pull/607))
nl: corrigeer de optie --list et corrigeer de verouderde beschrijvingen van deze optie ([#607](https://github.com/fortran-lang/fpm/pull/607))
pt: corrige opção --list e suas descrições desatualizadas ([#607](https://github.com/fortran-lang/fpm/pull/607))
zh_cn: 修复 --list 选项并更正 --list 选项的过时描述 ([#607](https://github.com/fortran-lang/fpm/pull/607))

source: fix incorrect Intel release flag on Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
de: Behebung des falschen Intel Release Flags unter Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
es: corregir el indicador de lanzamiento de Intel incorrecto en Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
fr: corrige le drapeau Release pour Intel sous Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
in: विंडोज पर गलत इंटेल रिलीज फ्लैग को ठीक करें ([#602](https://github.com/fortran-lang/fpm/pull/602))
nl: corrigeer de foutieve Release-optie voor Intel op Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
pt: corrige flag incorreta para o compilador Intel no Windows ([#602](https://github.com/fortran-lang/fpm/pull/602))
zh_cn: 修复 Windows 上不正确的 Intel 发布选项 ([#602](https://github.com/fortran-lang/fpm/pull/602))

source: list names without suffix for Windows ([#595](https://github.com/fortran-lang/fpm/pull/595))
de: Namen ohne Suffix für Windows auflisten ([#595](https://github.com/fortran-lang/fpm/pull/595))
es: lista de nombres sin sufijo para Windows ([#595](https://github.com/fortran-lang/fpm/pull/595))
fr: liste les noms sans suffixe sous Windows ([#595](https://github.com/fortran-lang/fpm/pull/595))
in: विंडोज के लिए प्रत्यय के बिना नामों की सूची ([#595](https://github.com/fortran-lang/fpm/pull/595))
nl: vermeld de namen zonder suffix op Windows ([#595](https://github.com/fortran-lang/fpm/pull/595))
pt: listar nomes sem sufixo no Windows ([#595](https://github.com/fortran-lang/fpm/pull/595))
zh_cn: 为 Windows 列出不带后缀的名称 ([#595](https://github.com/fortran-lang/fpm/pull/595))

source: Repository updates
de: Repository-Aktualisierungen
es: Actualizaciones del repositorio
fr: Mises à jour du dépôt fpm
in: रिपॉजिटरी अपडेट
nl: Updates van de fpm repository
pt: Atualizações do repositório
zh_cn: 存储库更新

source: add files and workflow to make installer on release ([#616](https://github.com/fortran-lang/fpm/pull/616))
de: Dateien und Workflow hinzufügen, um Installer bei Veröffentlichung zu erstellen ([#616](https://github.com/fortran-lang/fpm/pull/616))
es: agregue archivos y flujo de trabajo para hacer que el instalador se lance ([#616](https://github.com/fortran-lang/fpm/pull/616))
fr: ajoute les fichiers et le processus pour générer un installeur Windows à la sortie d'une nouvelle version ([#616](https://github.com/fortran-lang/fpm/pull/616))
in: रिलीज़ पर इंस्टॉलर बनाने के लिए फ़ाइलें और कार्यप्रवाह जोड़ें([#616](https://github.com/fortran-lang/fpm/pull/616))
nl: bestanden en workflow voor het maken van de release-installatie op Windows toegevoegd ([#616](https://github.com/fortran-lang/fpm/pull/616))
pt: adiciona ficheiros e workflow para fazer o instalador Windows a cada lançamento ([#616](https://github.com/fortran-lang/fpm/pull/616))
zh_cn: 添加文件和工作流以在发布时生成安装程序 ([#616](https://github.com/fortran-lang/fpm/pull/616))
