Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: [*preprocess*](#preprocessor-configuration) Preprocessor configuration
de: [*Vorverarbeitung*] (#preprocessor-configuration) Präprozessor-Konfiguration
es: [*preprocess*](#preprocessor-configuration) Configuración del preprocesador
fr: [*preprocess*](#preprocessor-configuration) Configuration d'un préprocesseur
in: [*preprocess*](#preprocessor-configuration) प्रीप्रोसेसर कॉन्फ़िगरेशन
pt: [*preprocess*](#preprocessor-configuration) Configuração do pré-processador
zh_cn: [*preprocess*](#preprocessor-configuration) 预处理器配置

source: [*extra*](#additional-free-data-field): Additional free data field
de: [*extra*](#additional-free-data-field): Zusätzliches freies Datenfeld
es: [*extra*](#additional-free-data-field): Campo adicional de datos libre
fr: [*extra*](#additional-free-data-field) : champ de données libre supplémentaire
in: [*अतिरिक्त*](#अतिरिक्त-मुक्त-डेटा-फ़ील्ड): अतिरिक्त मुफ़्त डेटा फ़ील्ड
ja: [*extra*](#additional-free-data-field): 設定の追加欄
nl: [*extra*](#additional-free-data-field): Veld voor aanvullende gegevens
pt: [*extra*](#additional-free-data-field): Campo de dados adicional
zh_cn: [*extra*](#additional-free-data-field)：额外的自由数据字段

source: Project name
de: Projektname
es: Nombre del proyecto
fr: Nom du projet
in: परियोजना का नाम
ja: プロジェクトの名前
nl: Projectnaam
pt: Nome do projeto
zh_cn: 项目名称

source: The project name identifies the package and is used to refer to it. It is used when listing the project as dependency for another package and the default name of the library and executable target. Therefore, the project name must always be present.
de: Der Projektname identifiziert das Paket und wird benutzt, um es zu referenzieren. Er wird verwendet, um das Projekt als Abhängigkeit für ein anderes Paket zu listen und der Standardname des Library- und Executable-Targets. Daher muss der Projektname immer vorhanden sein.
es: El nombre del proyecto identifica el paquete y es usado para referirse a este. Es usado cuando se enumera el proyecto como dependencia de otro paquete y el nombre predeterminado de la biblioteca y ejecutable objetivo. Además, el nombre del proyecto siempre debe estar presente.
fr: Le nom du projet identifie le paquet et est utilisé pour s'y référer. Il est utilisé lorsque l'on liste le projet comme dépendance d'un autre paquet et est le nom par défaut de la bibliothèque et de la cible exécutable. Par conséquent, le nom du projet doit toujours être présent.
in: प्रोजेक्ट का नाम पैकेज की पहचान करता है और इसे संदर्भित करने के लिए उपयोग किया जाता है। इसका उपयोग तब किया जाता है जब परियोजना को किसी अन्य पैकेज के लिए निर्भरता और पुस्तकालय के डिफ़ॉल्ट नाम और निष्पादन योग्य लक्ष्य के रूप में सूचीबद्ध किया जाता है। इसलिए, प्रोजेक्ट का नाम हमेशा मौजूद होना चाहिए।
ja: プロジェクト名は，パッケージを識別し，それを参照するために用いられます．ライブラリと実行ファイルの標準の名前として用いられ，また他のパッケージの依存関係としてプロジェクトを列挙するときにも用いられます．したがって，プロジェクト名は常に記述する必要があります．
nl: De projectnaam geeft het pakket aan en wordt gebruikt, om eraan te refereren. Het wordt ook gebruikt als afhankelijkheid bij andere projecten en als standardnaam voor de targets voor de bibliotheek en de executable. Daarom moet er altijd een projectnaam zijn.
pt: O nome do projeto identifica o pacote e será usado ao se referir a ele. Será usado ao listá-lo como dependência por outro pacote e será, por padrão, o nome da biblioteca e de seu executável. Dessa forma, o nome do projeto deve sempre estar presente.
zh_cn: 项目名称标识包并用于引用包。在将项目列为另一个包的依赖项以及库和可执行目标的默认名称时，将使用它。因此，项目名称必须始终存在。

source: *Example:*
de: *Beispiel:*
es: *Ejemplo:*
fr: *Exemple:*
in: *उदाहरण:*
ja: **例:**
nl: *Voorbeeld:*
pt: *Exemplo:*
zh_cn: *例如：*

source: Project version
de: Projektversion
es: Versión del proyecto
fr: Version du projet
in: परियोजना संस्करण
ja: プロジェクトのバージョン
nl: Projectversie
pt: Versão do projeto
zh_cn: 项目版本

source: The version number of the project is specified as string. A standardized way to manage and specify versions is the [Semantic Versioning] scheme.
de: Die Versionsnummer des Projekts wird als String angegeben. Eine Standardisierungsmethode zur Versionsverwaltung und zur Spezifikation der Versionsnummer ist das [Semantic Versioning] Schema.
es: El número de la versión es dado como una cadena de caracteres. Una forma estándar para manejar y especificar versiones es el esquema [Semantic Versioning].
fr: Le numéro de version du projet est spécifié sous forme d'une chaîne. Le schéma [Semantic Versioning](https://semver.org/) est une méthode courante pour gérer et spécifier les versions.
in: परियोजना की संस्करण संख्या स्ट्रिंग के रूप में निर्दिष्ट है। संस्करणों को प्रबंधित और निर्दिष्ट करने का एक मानकीकृत तरीका [सिमेंटिक संस्करण] योजना है।
ja: プロジェクトのバージョン番号を文字列で指定します．バージョンを管理・指定する標準的な方法は，[セマンティックバージョニング](https://semver.org/lang/ja/)です．
nl: Het versienummer van het project wordt als een string behandeld. Een standaardmethode om versies aan te geven is het zogeheten [Semantic Versioning] schema.
pt: O número da versão do projeto é definido como uma cadeia. Uma forma padronizada de gerir e definir versões é o esquema de [Versionamento Semântico](https://semver.org/lang/pt-BR/).
zh_cn: 项目的版本号指定为字符串。管理和指定版本的标准化方法是[语义版本控制](https://semver.org/lang/zh-CN/)方案。

source: The version entry can also contain a filename relative to the project root, which contains the version number of the project
de: Die Versions-Eintrag kann auch einen Dateinamen relativ zum Projekt-Wurzel-Verzeichnis enthalten, der die Versionsnummer des Projekts enthält
es: La entrada de versiones puede contener un nombre de archivo relativo al proyecto principal, que contiene el número de versión del proyecto
fr: Le champ de version peut également contenir un nom de fichier, relatif à la racine du projet, qui contient le numéro de version du projet.
in: संस्करण प्रविष्टि में प्रोजेक्ट रूट से संबंधित फ़ाइल नाम भी हो सकता है, जिसमें प्रोजेक्ट की संस्करण संख्या शामिल है
ja: versionの設定値として，プロジェクトのバージョン番号を含むファイルの名前をプロジェクト直下からの相対パスで指定できます．
nl: Het veld voor het versienummer kan ook een bestandsnaam zijn relatief t.o.v. de hoofddirectory van het project. Dit bestand bevat dan het versienummer.
pt: O campo de versão poderá conter também um nome de ficheiro, relativo a raiz do projeto, contendo o número da versão do projeto
zh_cn: 版本条目还可以包含相对于项目根目录的文件名，其中包含项目的版本号:

source: Project license
de: Projekt-Lizenz
es: Licencia del proyecto
fr: Licence du projet
in: प्रोजेक्ट लाइसेंस
ja: プロジェクトのライセンス
nl: Licentie voor het project
pt: Licença do projeto
zh_cn: 项目许可证

source: The project license field contains the license identifier. A standardized way to specify licensing information are [SPDX] identifiers.
de: Das Projekt-Lizenz-Feld enthält den Lizenz-Identifikator. Eine Standardisierungsmethode zur Spezifikation der Lizenzinformationen sind die [SPDX] Identifikatoren.
es: El campo de licencia del proyecto contiene el identificador de licencia. Una forma estandarizada para especificar la información de la licencia es con los indentificadores [SPDX].
fr: Le champ de la licence du projet contient l'identifiant de la licence. Les identifiants [SPDX](https://spdx.org/licenses/) constituent une méthode courante pour spécifier les informations relatives à la licence.
in: प्रोजेक्ट लाइसेंस फ़ील्ड में लाइसेंस पहचानकर्ता होता है। [SPDX] पहचानकर्ता लाइसेंसिंग जानकारी निर्दिष्ट करने का एक मानकीकृत तरीका है।"
ja: プロジェクトのライセンス設定欄には，ライセンス識別子を記述します．ライセンス情報を指定する標準的な方法は，[SPDX](https://spdx.org/licenses/)識別子です．
nl: Het veld ``license`` geeft aan welke licentie er voor het project geldt. Een standaardmethode is de [SPDX] Identicatie.
pt: O campo de licença do projeto contém um identificador da licença. Uma forma padronizada de definir a informação de licenciamento são os identificadores [SPDX](https://spdx.org/licenses/).
zh_cn: 项目许可字段包含许可标识符。指定许可信息的标准化方法是[SPDX]标识符。

source: *Examples:*
de: *Beispiele:*
es: *Ejemplos:*
fr: *Exemples:*
in: *उदाहरण:*
ja: **例:**
nl: *Voorbeelden:*
pt: *Exemplos:*
zh_cn: *例如：*

source: Projects licensed under the [GNU Lesser General Public License](https://www.gnu.org/licenses/lgpl-3.0-standalone.html), either version 3 or any later version, is specified as
de: Projekte, die unter der [GNU Lesser General Public License] (https://www.gnu.org/licenses/lgpl-3.0-standalone.html), entweder Version 3 oder jede spätere Version, werden angegeben als
es: Proyectos aprobados baja la licencia [GNU Lesser General Public License](https://www.gnu.org/license/lgpl-3.0-standalone.html), cualquier version 3 o posterior son especificados como
fr: Les projets sous licence [GNU Lesser General Public License](https://www.gnu.org/licenses/lgpl-3.0-standalone.html), pour la version 3 ou toute version ultérieure, sont indiqués ainsi
in: [जीएनयू लेसर जनरल पब्लिक लाइसेंस](https://www.gnu.org/licenses/lgpl-3.0-standalone.html) के तहत लाइसेंस प्राप्त परियोजनाएं, या तो संस्करण 3 या बाद के संस्करण के रूप में निर्दिष्ट हैं
ja: [GNU Lesser General Public License](https://www.gnu.org/licenses/lgpl-3.0-standalone.html)のバージョン3もしくはそれ以降の下で許諾されるプロジェクトは，次のように指定します．
nl: Projecten, die onder de [GNU Lesser General Public License] (https://www.gnu.org/licenses/lgpl-3.0-standalone.html), versie 3 of elke latere versie vallen, worden aangegeven als
pt: Projetos licenciados sob a [GNU Lesser General Public Licence](https://www.gnu.org/licenses/lgpl-3.0-standalone.html), tanto a versão 3 quanto qualquer versão posterior, são definidos como
zh_cn: 根据[ GNU 宽通用公共许可证（版本 3 或任何更高版本）许可](https://www.gnu.org/licenses/lgpl-3.0-standalone.html)的项目被指定为：

source: Dual licensed project under the [Apache license, version 2.0](http://www.apache.org/licenses/LICENSE-2.0) or the [MIT license](https://opensource.org/licenses/MIT) are specified as
de: Projekte, die unter der [Apache-Lizenz, Version 2.0] (http://www.apache.org/licenses/LICENSE-2.0) oder der [MIT-Lizenz] (https://opensource.org/licenses/MIT) lizenziert sind, werden angegeben als
es: Proyectos aprobados bajo la doble licencia [Apache license, version 2.0](http://www.apache.org/license/LICENSE-2.0) or la [MIT license](https://opensource.org/license/MIT) son especificados como
fr: Les projets à double licence, par exemple sous la [licence Apache, version 2.0](http://www.apache.org/licenses/LICENSE-2.0) ou la [licence MIT](https://opensource.org/licenses/MIT), sont spécifiés comme suit
in: [Apache लाइसेंस, संस्करण 2.0](http://www.apache.org/licenses/LICENSE-2.0) या [MIT लाइसेंस](https://opensource.org/licenses/MIT) के तहत दोहरे लाइसेंस वाले प्रोजेक्ट निर्दिष्ट हैं जैसा
ja: [Apache license, version 2.0](http://www.apache.org/licenses/LICENSE-2.0)もしくは[MIT license](https://opensource.org/licenses/MIT)のデュアルライセンスのプロジェクトの場合は，次のように指定します．
nl: Projecten, die onder de [Apache-licentie, versie 2.0](http://www.apache.org/licenses/LICENSE-2.0) of de [MIT-licentie](https://opensource.org/licenses/MIT) vallen, worden aangegeven als
pt: Projetos de licença dupla sob [Apache license, version 2.0](http://www.apache.org/licenses/LICENSE-2.0) ou [MIT license](https://opensource.org/licenses/MIT) são definidos como
zh_cn: [Apache 许可证——版本 2.0 ](http://www.apache.org/licenses/LICENSE-2.0)或[ MIT 许可证](https://opensource.org/licenses/MIT)下的双重许可项目被指定为：

source: Project maintainer
de: Projekt-Maintainer
es: Encargado del proyecto
fr: Mainteneur du projet
in: परियोजना अनुरक्षक
ja: プロジェクトのメンテナ
nl: Projectbeheerder
pt: Mantenedor do projeto
zh_cn: 项目维护者

source: Information on the project maintainer and means to reach out to them.
de: Informationen über den Projekt-Maintainer und die Möglichkeit zur Kontakaufname.
es: Información sobre el encargado del proyecto y forma para comunicarse con este.
fr: Informations sur le responsable du projet et les moyens de le contacter.
in: प्रोजेक्ट मेंटेनर के बारे में जानकारी और उन तक पहुंचने के साधन।
ja: プロジェクトのメンテナに関する情報および連絡手段を記載します．
nl: Informatie over de projectbeheerder en de mogelijkheden tot contact.
pt: Informação sobre o mantenedor do projeto e meios de contatá-lo.
zh_cn: 有关项目维护者的信息以及与他们的联系方式。

source: Project author
de: Projekt-Autor
es: Autor del proyecto
fr: Auteur du projet
in: परियोजना लेखक
ja: プロジェクトの作成者
nl: Auteur van het project
pt: Autor do projeto
zh_cn: 项目作者

source: Information on the project author.
de: Informationen über den Projekt-Autor.
es: Información sobre el autor del proyecto.
fr: Information sur l'auteur du projet.
in: परियोजना लेखक के बारे में जानकारी।
ja: プロジェクト作成者の情報を記載します．
nl: Informatie over de auteur.
pt: Informação sobre o autor do projeto.
zh_cn: 有关项目作者的信息。

source: Project copyright
de: Projekt-Copyright
es: Derechos de autor del proyecto
fr: Copyright du projet
in: प्रोजेक्ट कॉपीराइट
ja: プロジェクトの著作権
nl: Copyright voor het project
pt: Copyright do projeto
zh_cn: 项目版权

source: A statement clarifying the copyright status of the project.
de: Eine Aussage, die den Copyright-Status des Projekts klarifiziert.
es: Una declaración que especifique el estatus de la autoria del proyecto.
fr: Une déclaration clarifiant le statut des droits d'auteur du projet.
in: परियोजना की कॉपीराइट स्थिति को स्पष्ट करने वाला एक बयान।
ja: プロジェクトの著作権を明示する文言を記述します．
nl: Verklaring van de copyrightstatus van het project.
pt: Uma declaração que especifique o status de copyright do projeto.
zh_cn: 澄清项目版权状态的声明。

source: Project description
de: Projekt-Beschreibung
es: Descripción del proyecto
fr: Description du projet
in: परियोजना विवरण
ja: プロジェクトの概要
nl: Projectbeschrijving
pt: Descrição do projeto
zh_cn: 项目描述

source: The description provides a short summary on the project. It should be plain text and not using any markup formatting.
de: Die Beschreibung stellt eine kurze Zusammenfassung des Projekts dar. Sie sollte keine Markup-Formatierung verwenden.
es: La descripción brinda un resumen sobre el proyecto. Este debe ser texto plano y no usar marcas de formatación.
fr: La description fournit un bref résumé du projet. Elle doit être sous forme de texte brut, sans formatage.
in: विवरण परियोजना पर एक संक्षिप्त सारांश प्रदान करता है। यह सादा पाठ होना चाहिए और किसी मार्कअप स्वरूपण का उपयोग नहीं करना चाहिए।
ja: プロジェクトに関する要約を記述します．プレーンテキストを用いてください．装飾用の情報は挿入しないでください．
nl: De beschrijving hoort een korte samenvatting van het project te zijn zonder enige opmaakcodes.
pt: A descrição fornece um pequeno resumo sobre o projeto. Deve conter apenas texto e não usar nenhum tipo de formatação.
zh_cn: 该说明提供了有关项目的简短摘要。它应该是纯文本，不使用任何标记格式。

source: Project categories
de: Projekt-Kategorien
es: Categorias del proyecto
fr: Catégories du projet
in: परियोजना श्रेणियां
ja: プロジェクトの分類
nl: Projectcategorieën
pt: Categorias do projeto
zh_cn: 项目类别

source: The project can be associated with different categories.
de: Das Projekt kann mit verschiedenen Kategorien assoziiert werden.
es: El proyecto puede estar asociado con diversas categorias.
fr: Le projet peut être associé à différentes catégories.
in: परियोजना को विभिन्न श्रेणियों से जोड़ा जा सकता है।
ja: プロジェクトは，様々な分類と関連付けることができます．
nl: Het project kan onder meerdere categorieën vallen.
pt: O projeto pode ser associado com diferentes categorias.
zh_cn: 项目可以与不同的类别相关联。

source: Project keywords
de: Projekt-Schlüsselwörter
es: Palabras clave
fr: Mots-clés du projet
in: प्रोजेक्ट कीवर्ड
ja: プロジェクトのキーワード
nl: Projectsleutelwoorden
pt: Palavras-chave do projeto
zh_cn: 项目关键词

source: The keywords field is an array of strings describing the project.
de: Das Schlüsselwort-Feld ist ein Feld von Strings, die das Projekt beschreiben.
es: El campo palabras clave es un arreglo de cadenas de caracteres que describen el proyecto.
fr: Le champ "keywords" est un tableau de chaînes de caractères décrivant le projet.
in: कीवर्ड फ़ील्ड प्रोजेक्ट का वर्णन करने वाली स्ट्रिंग्स की एक सरणी है।
ja: プロジェクトを説明する文字の配列を記述します．
nl: Het veld voor sleutelwoorden bevat een of meer strings die het project beschrijven.
pt: O campo de palavras-chave é um array de cadeias que descreve o projeto.
zh_cn: 关键词字段是描述项目的字符串数组。

source: Project homepage
de: Projekt-Homepage
es: Página web del proyecto
fr: Page d'accueil du projet
in: प्रोजेक्ट होमपेज
ja: プロジェクトのホームページ
nl: Homepage van het project
pt: Página principal do projeto
zh_cn: 项目主页

source: URL to the webpage of the project.
de: URL zur Webseite des Projekts.
es: URL de la página web del proyecto.
fr: URL de la page d'accueil du projet.
in: परियोजना के वेबपेज का URL।
ja: プロジェクトのウェブページへのURLを記載します．
nl: URL voor de website van het project.
pt: URL da página web do projeto.
zh_cn: 指向项目网页的URL。

source: Project targets
de: Projekt-Ziele
es: Objetivos del proyecto
fr: Cibles du projet
in: परियोजना के लक्ष्य
ja: プロジェクトの構築対象
nl: Doelstellingen van het project
pt: Alvos do projeto
zh_cn: 项目目标

source: Every fpm project can define library, executable and test targets. Library targets are exported and useable for other projects.
de: Jedes fpm-Projekt kann Bibliotheken, ausführbare Programme und Tests definieren. Bibliotheken werden exportiert und für andere Projekte nutzbar.
es: Cada proyecto puede definir una biblioteca, un ejecutable y pruebas objetivosLas bibliotecas objetivo se exportan y pueden ser usadas por otros proyectos.
fr: Chaque projet fpm peut définir des cibles de type bibliothèque, exécutable et test. Les cibles de type bibliothèque sont exportées et utilisables par d'autres projets.
in: प्रत्येक एफपीएम परियोजना पुस्तकालय, निष्पादन योग्य और परीक्षण लक्ष्यों को परिभाषित कर सकती है। लाइब्रेरी लक्ष्य निर्यात किए जाते हैं और अन्य परियोजनाओं के लिए उपयोग योग्य होते हैं।
ja: すべてのfpmプロジェクトは，構築対象としてライブラリ，実行ファイル，テストを定義できます．構築されたライブラリは，他のプロジェクトで利用できます．
nl: Elk fpm-project kan bibliotheken, executables en testen definiëren. Bibliotheken worden geëxporteerd voor gebruik in andere projecten.
pt: Cada projeto fpm pode definir bibliotecas, executáveis e testes. Bibliotecas são exportadas e podem ser usadas em outros projetos.
zh_cn: 每个fpm项目都可以定义函数库、可执行程序和测试目标。库目标被导出并可用于其它项目。

source: Library configuration
de: Bibliotheks-Konfiguration
es: Configuración de bibliotecas
fr: Configuration de la bibliothèque
in: लाइब्रेरी कॉन्फ़िगरेशन
ja: ライブラリ
nl: Configuratie voor bibliotheken
pt: Configuração de biblioteca
zh_cn: 库配置

source: Defines the exported library target of the project. A library is generated if the source directory or include directory is found in a project. The default source and include directories are ``src`` and ``include``; these can be modified in the *library* section using the *source-dir* and *include-dir* entries. Paths for the source and include directories are given relative to the project root and use ``/`` as path separator on all platforms.
de: Definiert das exportierte Bibliotheks-Ziel des Projekts. Eine Bibliothek wird generiert, wenn die Quell- oder Include-Verzeichnisse im Projekt gefunden werden. Die Standard-Quell- und Include-Verzeichnisse sind ``src`` und ``include``; diese können in der *library*-Sektion mit den *source-dir* und *include-dir* Einträgen angepasst werden. Pfade für die Quell- und Include-Verzeichnisse sind relativ zum Projekt-Wurzelverzeichnis und verwenden ``/`` als Pfad-Trenner auf allen Plattformen.
es: Define las bibliotecas objetivo exportadas del proyecto. Una biblioteca es generada si el directorio de origen o el directorio incluir es encontrado en un proyecto. Los directorios de origen e incluir predeterminados son ``src`` y ``include``; estos pueden ser modificados en la sección *library* usando las entradas *source-dir* y *include-dir*. Rutas para los directorios fuente e incluir son dados relativos al proyecto raiz y usa ``/`` como separador de rutas sobre todas las plataformas.
fr: Définit la cible de la bibliothèque exportée par le projet. Une bibliothèque est générée si le répertoire source ou un répertoire de fichiers inclus est trouvé dans un projet. Les répertoires source et de fichiers inclus sont par défaut ``src`` et ``include`` ; ils peuvent être modifiés dans la section *library* en utilisant les entrées *source-dir* et *include-dir*. Les chemins pour les répertoires source et de fichiers inclus sont donnés relativement à la racine du projet et utilisent ``/`` comme séparateur de chemin sur toutes les plateformes.
in: परियोजना के निर्यातित लाइब्रेरी लक्ष्य को परिभाषित करता है। एक लाइब्रेरी उत्पन्न होता है यदि किसी परियोजना में स्रोत निर्देशिका या निर्देशिका शामिल है। डिफ़ॉल्ट स्रोत और शामिल निर्देशिकाएं ``src`` और ``include`` हैं; इन्हें *स्रोत-डीआईआर* और *शामिल-डीआईआर* प्रविष्टियों का उपयोग करके *लाइब्रेरी* अनुभाग में संशोधित किया जा सकता है। स्रोत के लिए पथ और निर्देशिकाओं को प्रोजेक्ट रूट के सापेक्ष दिया गया है और सभी प्लेटफॉर्म पर पथ विभाजक के रूप में ``/`` का उपयोग करें।
ja: プロジェクト内で構築され，展開されるライブラリを定義します．プロジェクト内にソースディレクトリもしくはインクルードディレクトリが見つかれば，ライブラリが生成されます．ソースおよびインクルードディレクトリの標準の名前はそれぞれ ``src``および``include``であり，*library*設定項目の*source-dir*および*include-dir*で変更できます．ソースおよびインクルードディレクトリのパスはプロジェクト直下からの相対パスで与え，パスの区切りには``/``を用います．
nl: Definieer de target voor de te exporteren bibliotheek. Een bibliotheek wordt gegenereerd, als de brondirectory of de include-directory in het project aangetroffen wordt. De standaardnamen hiervoor zijn ``src`` und ``include``; deze namen kunnen in de *library*-sectie in het manifestbestand met de entries *source-dir* en *include-dir* aangepast worden. Paden voor deze directories zijn altijd relatief to.v. de hoofddirectory van het project en bevatten ``/`` als padscheiding voor alle plattforms.
pt: Define a biblioteca-alvo a ser exportada pelo projeto. Uma biblioteca é gerada se o diretório do código-fonte ou diretório include é encontrado em um projeto. Os diretórios padrão para o código-fonte o os includes são ``src`` e ``include``; estes podem ser modificadas na seção *library* usando o campo *source-dir* e *include-dir*. Os caminhos de arquivo são dados relativos a raiz do projeto e usam ``/`` como separador em todas as plataformas.
zh_cn: 定义项目的导出库目标。如果在项目中找到源目录或包含目录，则会生成库。默认的源目录和包含目录是``src``和``include``；这些可以在库（*library*）部分中使用源目录（*source-dir*）和包含目录（*include-dir*）条目进行修改。源目录和包含目录的目录相对于项目根目录给出，并在所有平台上使用``/``用作目录分隔符。

source: Include directory
de: Include-Verzeichnis
es: Directorio incluir
fr: Répertoire de fichiers inclus
in: निर्देशिका शामिल करें
ja: インクルードディレクトリ
pt: Incluir diretório
zh_cn: 包含目录

source: Supported in Fortran fpm only
de: Nur in Fortran fpm unterstützt
es: Compatible solo en Fortran fpm
fr: Supporté uniquement par fpm
in: केवल फोरट्रान fpm में समर्थित
ja: Fortran fpmのみ対応しています．
nl: Alleen in Fortran fpm ondersteund
pt: Disponível apenas na versão Fortran do fpm
zh_cn: 仅在Fortran fpm中受支持
