Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Test targets are Fortran programs defined as *test* sections. They follow similar rules as the executable targets. If no test section is specified the ``test`` directory is searched for program definitions. For explicitly specified tests the *name* entry must always be specified. The source directory for each test can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
de: Test-Programme sind in Fortran definiert als *test*-Sektionen. Sie folgen ähnlichen Regeln wie Ausführbare Programme. Wenn keine test-Sektion angegeben ist, wird das ``test``-Verzeichnis für Programmdefinitionen gesucht. Für explizit angegebene Tests muss immer das *name*-Eintrag angegeben werden. Das Quell-Verzeichnis für jedes Test kann in dem *source-dir*-Eintrag angepasst werden. Pfade für das Quell-Verzeichnis sind relativ zum Projekt-Wurzelverzeichnis und verwenden ``/`` als Pfad-Trenner auf allen Plattformen. Die Quell-Datei mit dem Programm-Körper kann in dem *main*-Eintrag angegeben werden.
es: Las pruebas objetivo son programas Fortran definidos como secciones *test*. Estos siguen reglas similarees a los ejecutables objetivo. Si ninguna sección prueba es especificada, el directorio ``test`` es buscado en las definiciones del programa. Para especificar explicitamente las pruebas, la entrada *name* debe ser siempre dada. El directorio fuente para prueba puede ser definido en la entrada *source-dir*. Rutas para el directorio fuente son dadas relativas al proyecto raiz y usan ``/`` como separador de ruta en todas las plataformas. El archivo fuente conteniendo el cuerpo del programa puede ser especificado en la entrada *main*.
fr: Les cibles de test sont des programmes Fortran déclarés dans des sections *test*. Elles suivent les mêmes règles que les cibles exécutables. Si aucune section *test* n'est spécifiée, le répertoire ``test`` est recherché et analysé. Pour les tests explicitement spécifiés, l'entrée *name* doit toujours être renseignée. Le répertoire source de chaque test peut être modifié dans l'entrée *source-dir*. Les chemins pour le répertoire source sont donnés relativement à la racine du projet et utilisent ``/`` comme séparateur de chemin sur toutes les plateformes. Le fichier source contenant le corps du programme peut être indiqué dans l'entrée *main*.
in: परीक्षण लक्ष्य फोरट्रान कार्यक्रम हैं जिन्हें *परीक्षण* अनुभागों के रूप में परिभाषित किया गया है। वे निष्पादन योग्य लक्ष्यों के समान नियमों का पालन करते हैं। यदि कोई परीक्षण अनुभाग निर्दिष्ट नहीं किया गया है तो प्रोग्राम परिभाषाओं के लिए ``परीक्षण`` निर्देशिका खोजी जाती है। स्पष्ट रूप से निर्दिष्ट परीक्षणों के लिए *नाम* प्रविष्टि हमेशा निर्दिष्ट होनी चाहिए। प्रत्येक परीक्षण के लिए स्रोत निर्देशिका को *source-dir* प्रविष्टि में समायोजित किया जा सकता है। स्रोत निर्देशिका के लिए पथ प्रोजेक्ट रूट के सापेक्ष दिए गए हैं और सभी प्लेटफॉर्म पर पथ विभाजक के रूप में ``/`` का उपयोग करते हैं। प्रोग्राम बॉडी वाली स्रोत फ़ाइल को * मुख्य * प्रविष्टि में निर्दिष्ट किया जा सकता है।
ja: テストは，*test*設定項目で定義されたFortranプログラムです．これらは実行ファイルと同様の規則に従います．もし*test*が指定されていない場合，``test``ディレクトリで``program``の定義が探索されます．明示的にテストを設定する場合，*name*が指定されている必要があります．各実行ファイルのソースディレクトリは，*source-dir*で設定できます．ソースディレクトリへのパスは，プロジェク直下からの相対パスで与え，パスの区切りには``/``を用います．プログラム本体を含むソースファイルの名前は，*main*で指定します．
nl: Testprogramma's in Fortran worden gedefinieerd in *test*-secties. Er gelden soortgelijke regels als voor alle executables. Als er geen sectie is opgegeven, wordt de directory ``test`` doorzocht voor programmadefinities. Voor expliciet opgegeven tests moet altijd de *name*-entry opgegeven worden. De brondirectory voor elke test kan in de *source-dir*-entry aangepast worden. Paden voor de brondirectory zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als padscheiding op alle plattforms. Het bronbestand met het hoofdprogramma kan in de *main*-entry aangegeven worden.
pt: Alvos de teste são programas Fortran definidos nas seções *test*. Eles seguem regras parecidas com as dos alvos executáveis. Se nenhuma seção de teste é especificada o diretório ``test`` é escaneado em busca de definições de programas. Para os testes explicitamente definidos o campo *name* precisa estar sempre definido. O diretório do código-fonte para cada teste pode ser ajustado com a opção *source-dir*. Caminhos para este diretório são dados a partir da raiz do projeto e usa ``/`` como separador em todas as plataformas. O ficheiro que contém o corpo do programa pode ser especificado no campo *main*.
zh_cn: 测试目标是定义为测试部分的Fortran程序。它们遵循与可执行目标类似的规则。如果未指定测试（*test*）部分，则会在``test``目录中搜索程序定义。对于显式指定的测试，必须始终指定名称（*name*）条目。每个测试的源目录都可以在源目录（*source-dir*）条目中进行调整。源目录的路径是相对于项目根目录给出的，并在所有平台上使用``/``用作路径分隔符。可以在主（*main*）条目中指定包含程序正文的源文件。

source: Tests can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
de: Test-Programme können ihre eigenen Abhängigkeiten haben. Siehe [spezifizieren von Abhängigkeiten](#spezifizieren-von-abhaengigkeiten) für weitere Details.
es: Programas de prueba tienen sus propias dependencias. Ver [specifying dependencies](#specifying-dependencies) para mas detalles.
fr: Les tests peuvent avoir leurs propres dépendances. Voir [specifying dependencies](#specifying-dependencies) pour plus de détails.
in: टेस्ट की अपनी निर्भरता हो सकती है। देखें [निर्भरता निर्दिष्ट करना](#निर्दिष्ट-निर्भरताएं) अधिक जानकारी के लिए।
ja: 複数のテストがある場合，テストごとに依存関係を持つことができます．[依存関係の指定](#specifying-dependencies)を参照してください．
nl: Testprogramma's kunnen hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.
pt: Testes podem ter suas próprias dependências. Veja [definindo dependências](#specifying-dependencies) para mais detalhes.
zh_cn: 可执行文件可以有自己的依赖项。有关更多详细信息，请参阅[指定依赖项](#specifying-dependencies)。

source: Tests can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
de: Test-Programme können auch ihre eigenen externen Bibliotheksabhängigkeiten spezifizieren. Siehe [externe Bibliotheken](#link-external-libraries) für weitere Details.
es: Programas de prueba también pueden especificar sus propias dependencias externas de biblioteca. Ver [bibliotecas externas](#link-external-libraries) para mas detalles.
fr: Les tests peuvent également spécifier leurs propres dépendances vis-à-vis de bibliothèques externes. Voir [external libraries](#link-external-libraries) pour plus de détails.
in: टेस्ट अपने स्वयं के बाहरी पुस्तकालय निर्भरता को भी निर्दिष्ट कर सकते हैं। अधिक विवरण के लिए [बाहरी पुस्तकालय](#link-external-पुस्तकालय) देखें।
ja: 複数のテストがある場合，テストごとに外部ライブラリを指定できます．[外部ライブラリのリンク](#link-external-libraries)を参照してください．
nl: Testprogramma's kunnen afzonderlijk van externe bibliotheken afhangen. Zie [externe bibliotheken](#link-externe-bibliotheken) "voor verdere details.
pt: Testes podem também definir suas próprias dependências externas. Veja [vínculo de bibliotecas externas](#link-external-libraries) para mais informações.
zh_cn: 可执行文件还可以指定自己的外部库依赖项。有关更多详细信息，请参阅[外部库](#link-external-libraries)。

source: Link external libraries
de: Externe Bibliotheken verlinken
es: Vincular bibliotecas externas
fr: Liaison à des bibliothèques externes
in: बाहरी लाइब्रेरी लिंक करें
ja: 外部ライブラリのリンク
nl: Linken met externe bibliotheken
pt: Vincular bibliotecas externas
zh_cn: 链接外部库

source: To declare link time dependencies on external libraries a list of native libraries can be specified in the *link* entry. Specify either one library as string or a list of strings in case several libraries should be linked. When possible the project should only link one native library. The list of library dependencies is exported to dependent packages.
de: Um Abhängigkeiten auf externe Bibliotheken zu deklarieren, kann eine Liste von nativen Bibliotheken in das *link*-Eintrag angegeben werden. Geben Sie eine Bibliothek als Zeichenkette oder eine Liste von Zeichenketten an, wenn mehrere Bibliotheken verlinkt werden sollen. Wenn möglich sollte das Projekt nur eine nativen Bibliothek verlinken. Die Liste der Bibliotheksabhängigkeiten wird in abhängigen Paketen exportiert.
es: Para declarar dependencias de tiempo de enlace en bibliotecas externas, una lista de las bibliotecas se pueden especificar en la entrada *link*. Especifique una biblioteca como cadena o una lista de cadenas en caso que varias bibliotecas deban estar vinculado. Cuando sea posible, el proyecto solo debe vincular una biblioteca nativa. La lista de dependencias de la biblioteca se exporta a paquetes dependientes.
fr: Pour déclarer des dépendances à des bibliothèques externes, gérées lors de l'édition de liens, une liste de bibliothèques natives peut être spécifiée dans l'entrée *link*. Spécifiez soit une bibliothèque à l'aide d'une chaîne, soit une liste de chaînes dans le cas où plusieurs bibliothèques doivent être liées. Quand c'est possible, le projet ne devrait être lié qu'à une seule bibliothèque native. La liste des bibliothèques nécessaires est exportée vers les paquets dépendants.
in: बाहरी पुस्तकालयों पर लिंक-टाइम निर्भरता घोषित करने के लिए मूल पुस्तकालयों की सूची को *लिंक* प्रविष्टि में निर्दिष्ट किया जा सकता है। या तो एक पुस्तकालय को एक स्ट्रिंग के रूप में निर्दिष्ट करें या कई पुस्तकालयों को लिंक करने की स्थिति में स्ट्रिंग्स की एक सूची। जब संभव हो तो परियोजना को केवल एक देशी पुस्तकालय को जोड़ना चाहिए। लाइब्रेरी निर्भरताओं की सूची आश्रित पैकेजों में निर्यात की जाती है।"
ja: 外部ライブラリリンク時の依存関係を宣言するために，*link*設定項目にネイティブライブラリの一覧を指定できます．一つのライブラリは文字列で指定し，複数のライブラリをリンクする場合は文字列のリストを用います．できることなら，プロジェクトは一つのネイティブライブラリのみをリンクするべきでしょう．依存ライブラリの一覧は，依存するパッケージにも展開されます．
nl: Om de afhankelijkheid van externe bibliotheken te specificeren, wordt een lijst van de betreffende bibliotheken in de *link*-entry opgegeven. Geef de naam van de bibliotheek of biblotheken op als een string of een lijst van strings. Indien mogelijk moet het project daarvoor een systeemspecifieke bibliotheek gebruiken. De lijst van dergelijke afhankelijkheden wordt doorgegeven aan pakketten die van dit pakket afhangen.
pt: Para declarar dependências externas em tempo de vinculação, uma lista de bibliotecas nativas pode ser definidas no campo *link*. Defina uma biblioteca como uma cadeia ou uma lista de cadeias no caso em que várias bibliotecas precisam ser vinculadas. Quando possível, o projeto deve vincular apenas uma biblioteca nativa. A lista de dependências da biblioteca é exportada aos pacotes dependentes.
zh_cn: 要声明外部库的链接时间依赖关系，可以在链接（*link*）条目中指定本机库的列表。将一个库指定为字符串，或指定一个字符串列表，以防应链接多个库。如果可能，项目应仅链接一个本机库。库依赖项列表将导出到从属包。

source: To link against the zlib compression library use
de: Um gegen die zlib-Kompressionsbibliothek zu linken, kann die folgende Eingabe genutzt werden
es: Para vincular con la biblioteca de compresión zlib use
fr: Pour établir un lien avec la bibliothèque de compression zlib, utilisez
in: Zlib कम्प्रेशन लाइब्रेरी के विरुद्ध लिंक करने के लिए उपयोग करें
ja: zlib圧縮ライブラリをリンクするには，次の設定を用います．
nl: Linken met de zlib-compressiebibllotheek, kan als volgt:
pt: Para vincular com a biblioteca de compressão zlib use
zh_cn: 使用 zlib 链接库

source: To dependent on LAPACK also BLAS should be linked. In this case the order of the libraries matters:
de: Um LAPACK zu nutzen, sollte auch gegen BLAS gelinkt werden. In diesem Fall ist die Reihenfolge der Bibliotheken wichtig:
es: Para depender de LAPACK también BLAS debe estar vinculado. En este caso la orden de las bibliotecas importa:
fr: Pour dépendre de LAPACK, il faut également lier BLAS. Dans ce cas, l'ordre des bibliothèques est important :
in: LAPACK पर निर्भर होने के लिए BLAS को भी जोड़ा जाना चाहिए। इस मामले में लाइब्रेरी का क्रम मायने रखता है:
ja: LAPACKに依存する場合，BLASもリンクする必要があります．この場合，ライブラリの順番に意味があります．
nl: Om LAPACK te gebruiken, moet ook BLAS meegelinkt worden. In dit geval is de volgorde van de bibliotheken van belang:
pt: Para depender do LAPACK, o BLAS deve estar vinculado. Neste caso, a ordem das bibliotecas importa:
zh_cn: 要依赖LAPACK，BLAS也应该被链接起来。在这种情况下，库的顺序很重要：

source: Use system-installed modules
de: System-installierte Module verwenden
es: Usar módulos instalados en el sistema
fr: Utiliser des modules installés au niveau du système
in: सिस्टम-स्थापित मॉड्यूल का उपयोग करें
ja: システムにインストールされたモジュールの利用
nl: Modules die op het systeem zijn geïnstalleerd
pt: Usar módulos instalados no sistema
zh_cn: 使用系统安装的模块

source: To use modules that are not defined within your fpm package or its dependencies, specify the module name using the *external-modules* key in the *build* table.
de: Um Module, die nicht in einem fpm-Paket oder Abhängigkeiten definiert sind, anzugeben, müssen diese im *build*-Tabellen-Eintrag unter *external-modules* angegeben werden.
es: Para usar módulos que no están definidos con su paquete fpm o sus dependencias, espeficique el nombre del módulo usando la clave *external-module* en la table de construcción.
fr: Pour utiliser des modules qui ne sont pas définis dans votre paquet fpm ou ses dépendances, indiquez le nom du module en utilisant la clé *external-modules* dans la table *build*.
in: उन मॉड्यूल का उपयोग करने के लिए जो आपके एफपीएम पैकेज या इसकी निर्भरताओं के भीतर परिभाषित नहीं हैं, *बिल्ड * तालिका में * बाहरी-मॉड्यूल * कुंजी का उपयोग करके मॉड्यूल नाम निर्दिष्ट करें।
ja: fpmパッケージやその依存関係の中で定義されていないモジュールを利用するには，*build*設定項目の*external-modules*を使用して，モジュールの名前を指定します．
nl: Om modules te gebruiken die niet in een fpm-pakket of via afhankelijkheden gedefinieerd zijn, moeten ze in een *build*-tabellenentry onder *external-modules* opgegeven worden.
pt: Para usar módulos que não estão definidos dentro do seu pacote fpm ou de suas dependências, especifique o nome do módulo usando a chave *external-module* dentro da tabela *build*.
zh_cn: 若要使用未在fpm包或其依赖项中定义的模块，请使用生成（*build*）表中的外部模块（*external-modules*）键指定模块名称。

source: *fpm* cannot automatically locate external module files; it is the responsibility of the user to specify the necessary include directories using compiler flags such that the compiler can locate external module files during compilation.
de: *fpm* kann nicht automatisch externe Modul-Dateien finden; es ist die Verantwortung der Benutzer*in, die benötigten Include-Verzeichnisse mittels Kompiler-Optionen anzugeben, damit der Kompiler externe Modul-Dateien finden kann, während der Kompilierung.
es: *fpm* no puede localizar automáticamente archivos de módulos externos; es responsabilidad del usuario especificar los directorios de inclusión necesarios utilizando indicadores del compilador de modo que este pueda localizar archivos de módulos externos durante la compilación.
fr: *fpm* ne peut pas localiser automatiquement les fichiers des modules externes ; il est de la responsabilité de l'utilisateur de spécifier les répertoires de fichiers inclus nécessaires en utilisant les drapeaux de compilation de sorte que le compilateur puisse localiser les fichiers des modules externes pendant la compilation.
in: *fpm* स्वचालित रूप से बाहरी मॉड्यूल फ़ाइलों का पता नहीं लगा सकता है; यह उपयोगकर्ता की जिम्मेदारी है कि वह संकलक झंडों का उपयोग करके आवश्यक निर्देशिकाओं को निर्दिष्ट करे ताकि संकलन के दौरान संकलक बाहरी मॉड्यूल फ़ाइलों का पता लगा सके।
ja: *fpm*は，外部モジュールファイルの位置を自動的に特定できません．ユーザは，コンパイラがコンパイル時に外部モジュールファイルを発見できるように，コンパイラフラグを利用してインクルードディレクトリを指定しなければなりません．
nl: *fpm* kan niet automatisch externe modulebestanden vinden; het is de verantwoordelijkheid van de gebruiker om de benodigde include-directories met compileropties aan te geven, zodat de compiler deze externe modulebestanden kan vinden.
pt: *fpm* não consegue localizar ficheiros de módulos externos; Sendo responsabilidade do usuário especificar os diretórios que precisam ser incluídos usando flags do compilador de forma que este possa localizar módulos externos durante a compilação.
zh_cn: *fpm*无法自动定位外部模块文件；用户有责任使用编译器标志指定必要的包含目录，以便编译器可以在编译期间找到外部模块文件。

source: Multiple external modules can be specified as a list.
de: Mehrere externe Module können als Liste angegeben werden.
es: Se pueden especificar varios módulos externos como una lista.
fr: Un tableau TOML peut être utilisé pour spécifier plusieurs modules externes.
in: एकाधिक बाहरी मॉड्यूल को सूची के रूप में निर्दिष्ट किया जा सकता है।
ja: 複数の外部モジュールをリストで指定できます．
nl: Meerdere externe modules kunnen aangegeven worden via een lijst.
pt: Múltiplos módulos externos podem ser especificados como uma lista.
zh_cn: 可以将多个外部模块指定为一个列表。

source: Automatic target discovery
de: Automatische Zielerkennung
es: Localización automática de objetivos
fr: Découverte automatique des cibles
in: स्वचालित लक्ष्य खोज
ja: 構築対象の自動検出
nl: Automatische bepaling targets
pt: Localização automática de alvos
zh_cn: 目标自动发现

source: Executables and test can be discovered automatically in their default directories. The automatic discovery recursively searches the ``app``, ``example``, and ``test`` directories for ``program`` definitions and declares them as executable, example, and test targets, respectively. The automatic discovery is enabled by default.
de: Ausführbare Programme und Tests können automatisch in ihren Standard- Verzeichnissen gefunden werden. Die automatische Erkennung rekursiv sucht die ``app``-, ``example``- und ``test``-Verzeichnisse nach ``program``-Definitionen und deklarieren diese als ausführbare, Beispiel- und Test-Ziele, entsprechend. Die automatische Erkennung wird standardmäßig aktiviert.
es: Los ejecutables y las pruebas se pueden localizar automáticamente en sus directorios predeterminados. La localización automático busca de forma recursiva los directorios ``app``, ``example`` y ``test`` para las definiciones de ``program`` y los declara como objetivos ejecutables, ejemplo y de prueba, respectivamente. La localización automática está habilitado de forma predeterminada.
fr: Les exécutables et les tests peuvent être découverts automatiquement dans leurs répertoires par défaut. La découverte automatique recherche récursivement dans les répertoires ``app``, ``example``, et ``test`` les déclarations ``program`` et les déclare respectivement comme cibles d'exécutables, d'exemples et de tests. La découverte automatique est activée par défaut.
in: निष्पादन योग्य और परीक्षण को उनकी डिफ़ॉल्ट निर्देशिकाओं में स्वचालित रूप से खोजा जा सकता है। स्वचालित खोज पुनरावर्ती रूप से ``app``, ``example``, और ``test`` निर्देशिकाओं को ``program`` परिभाषाओं के लिए खोजती है और उन्हें क्रमशः निष्पादन योग्य, उदाहरण और परीक्षण लक्ष्यों के रूप में घोषित करती है। स्वचालित खोज डिफ़ॉल्ट रूप से सक्षम है।
ja: 実行ファイルとテストは，標準のディレクトリ内であれば自動的に検出されます．自動検出では，``app``, ``example``, ``test``ディレクトリ内の``program``の定義を再帰的に検索し，実行ファイル，サンプル，テストをそれぞれ構築対象として宣言します．自動検出は，標準で有効にされています．
nl: Executables en testprogramma's kunnen automatisch in de standaarddirectories gevonden worden. De automatische procedure hiervoor doorzoekt recursief de ``app``-, ``example``- und ``test``-directories naar ``program``-definities en merken deze aan als respectievelijk executable-, voorbeeld- en test-targets. De automatische zoekprocedure wordt standaard aangezet.
pt: Executáveis e testes podem ser detectados automaticamente nos seus diretórios padrão. A descoberta automática recursivamente procura por definições ``program`` nos diretórios ``app``, ``example`` e ``test``, declarando-os como executável, exemplo e alvo de teste, respectivamente. A descoberta automática é habilitada por padrão.
zh_cn: 可执行文件和测试可以在其默认目录中自动发现。自动发现以递归方式在``app``、``example``和``test``目录中搜索定义，并分别将它们声明为可执行目标、示例目标和测试目标。默认情况下，自动发现处于启用状态。

source: To disable the automatic discovery of targets set the *auto-executables*, *auto-examples*, and *auto-tests* entry to *false*.
de: Um die automatische Erkennung von Zielen zu deaktivieren, setzen Sie die Einträge *auto-executables*, *auto-examples*, und *auto-tests* auf *false*.
es: Para deshabilitar la localización automática de objetivos, configure las entradas *auto-executables*, *auto-examples*, y *auto-tests* en *false*.
fr: Pour désactiver la découverte automatique des cibles, mettez *false* dans les entrées *auto-executables*, *auto-examples* et *auto-tests*.
in: लक्ष्यों की स्वत: खोज को अक्षम करने के लिए *ऑटो-एक्ज़ीक्यूटेबल्स*, *ऑटो-उदाहरण*, और *ऑटो-टेस्ट* प्रविष्टि को *गलत* पर सेट करें।
ja: 構築対象の自動検出を無効にするには，*auto-executables*, *auto-examples*, *auto-tests*を*false*に設定します．
nl: Om de automatische bepaling van targets uit te schakelen, zet je de entries *auto-executables*, *auto-examples*, en *auto-tests* op *false*.
pt: Para desabilitar a descoberta automática de alvos coloque as entradas *auto-executables*, *auto-examples* e *auto-tests* como *false*.
zh_cn: 要禁用目标的自动发现，请将自动可执行文件（*auto-executables*）、自动示例（*auto-examples*）和自动测试（*auto-tests*）条目设置为*false*。

source: Fortran features
fr: Fonctionnalités Fortran
pt: Recursos do Fortran
zh_cn: Fortran特性

source: Allows to enable and disable specific language features
fr: Permet d'activer et de désactiver des fonctions spécifiques du langage
zh_cn: 允许启用和禁用特定的语言功能

source: Implicit typing
fr: Typage implicite
pt: Tipagem Implícita
zh_cn: 隐性类型声明

source: Allows to toggle whether the default implicit typing should be used. The default option is ``false``.
fr: Permet d'indiquer si le typage implicite par défaut doit être utilisé. L'option par défaut est ``false``.
zh_cn: 允许切换是否应该使用默认的隐式类型声明。默认选项是``false``。

source: Implicit external
fr: Interfaces externes implicites
pt: Funções Externas Implícitas
zh_cn: 隐式外部接口

source: Allows to toggle whether external interfaces can be declared implicitly. The default option is ``false``.
fr: Permet d'indiquer si les interfaces externes peuvent être déclarées implicitement. L'option par défaut est ``false``.
zh_cn: 允许切换是否可以隐式声明外部接口。默认选项是``false``。

source: Source form
fr: Format de code source
pt: Formatação do Código-Fonte
zh_cn: 源文件格式

source: Allows to specifiy the source form to be used for all files in the project. Possible choices are ``"free"`` to assume all files are free form source, ``"fixed"`` to assume all files are fixed form source, and ``"default"`` to let the compiler decide based on its own heuristics. The default option is ``"free"``.
fr: Permet de spécifier le format de code source à utiliser pour tous les fichiers du projet. Les choix possibles sont ``"free"`` pour indiquer que tous les fichiers utilisent la forme libre, ``"fixed"`` pour indiquer que tous les fichiers utilisent la forme fixe, et ``"default"`` pour laisser le compilateur décider sur la base de sa propre heuristique. L'option par défaut est ``"free"``.
zh_cn: 允许指定项目中所有文件使用的源码形式。可能的选择是``"free"``假设所有文件都是自由形式的源代码，``"fixed"``假设所有文件都是固定形式的源代码，``"default"``让编译器根据自己的启发式方法来决定。默认选项是 ``"free"``。

source: Specifying dependencies
de: Abhängigkeiten spezifizieren
es: Especificando dependencias
fr: Spécifier les dépendances
in: निर्भरता निर्दिष्ट करना
ja: 依存関係の指定
nl: Afhankelijkheden specificeren
pt: Definição de dependências
zh_cn: 指定依赖项
