Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: Enable cpp preprocessor flag for dependencies by in <https://github.com/fortran-lang/fpm/pull/783>
fr: Activer le drapeau du préprocesseur cpp pour les dépendances (<https://github.com/fortran-lang/fpm/pull/783>)
in: निर्भरताओं के लिए cpp प्रीप्रोसेसर ध्वज को निम्नलिखित में सक्षम <https://github.com/fortran-lang/fpm/pull/783>
pt: Habilita a flag de preprocessador cpp para as dependências em <https://github.com/fortran-lang/fpm/pull/783>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/783> 中，为依赖项启用 cpp 预处理器标志

source: Bump version to 0.7.0 by in <https://github.com/fortran-lang/fpm/pull/785>
fr: Passage à la version 0.7.0 (<https://github.com/fortran-lang/fpm/pull/785>)
in: <https://github.com/fortran-lang/fpm/pull/785> में 0.7.0 के लिए बंप संस्करण
pt: Atualiza versão para o 0.7.0 em <https://github.com/fortran-lang/fpm/pull/785>
zh_cn: 在 <https://github.com/fortran-lang/fpm/pull/785> 中，将版本提升到 0.7.0

source: Fpm version 0.8.0 released
fr: Fpm 0.8.0 est sorti
pt: Lançada a versão 0.8.0 do fpm
zh_cn: Fpm 0.8.0 版本发布

source: This release introduces support for enabling and disabling language features in fpm, such as implicit typing or default source form. By default, fpm now tries to disable implicit typing rules, implicit external interfaces and assumes the source form is always free. The options can be overwritten in the manifest for each project.
fr: Cette version introduit la prise en charge de l'activation et de la désactivation des fonctionnalités du langage dans fpm, telles que le typage implicite ou le format de code source par défaut. Par défaut, fpm tente désormais de désactiver les règles de typage implicite, les interfaces externes implicites et considère que le format du code source est toujours la forme libre introduite par Fortran 90. Les options peuvent être modifiées dans le manifeste de chaque projet.
pt: Esta versão introduz suporte para habilitar e desabilitar recursos da linguagem através do fpm como, por exemplo, a tipagem implícita ou a formatação padrão do código-fonte. Por padrão, o fpm tenta desabilitar tipagem implícita, interfaces implícitas e assume que a formatação do código é a forma livre. As opções podem ser sobrescritas no manifesto para cada projeto.
zh_cn: 这个版本引入了对fpm中启用和禁用语言特性的支持，如隐式类型或默认源码形式。默认情况下，fpm现在会尝试禁用隐式类型规则和隐式外部接口，并假定源码形式总是自由格式的。这些选项可以在每个项目的清单中被覆盖。

source: Furthermore, first support for local and remote registries are integrated in fpm. The registry support can be configured in a new global configuration file. This development was sponsored by the [Sovereign Tech Fund](https://sovereigntechfund.de/en/projects/fortran/).
fr: En outre, une première prise en charge des registres locaux et distants est intégrée dans fpm. La prise en charge des registres peut être configurée dans un nouveau fichier de configuration global. Ce développement a été financé par le [Sovereign Tech Fund](https://sovereigntechfund.de/en/projects/fortran/).
pt: Além disso, o primeiro suporte a registros locais e remotos foi integrado ao fpm. O suporte aos registros pode ser configurado em um novo arquivo de configuração global. O desenvolvimento deste recurso foi possível graças ao patrocínio do [Sovereign Tech Fund](https://sovereigntechfund.de/en/projects/fortran/).
zh_cn: 此外，fpm中首次集成了对本地和远程注册表的支持。注册表的支持可以在一个新的全局配置文件中进行配置。这项开发由[主权技术基金](https://sovereigntechfund.de/en/projects/fortran/)赞助。

source: Bugfixes and improvements to the preprocessor support, C++ compilation, dependency updates and more are included in this release.
fr: Cette version comprend des corrections de bugs et des améliorations du support du préprocesseur, de la compilation C++, des mises à jour des dépendances, etc.
pt: Solução de bugs e melhora ao suporte de preprocessadores, compilação de arquivos C++, atualização de dependências e mais foram incluídos nesta versão.
zh_cn: 该版本包括对预处理程序支持、C++编译、依赖性更新等方面的错误修正和改进。

source: Find the full release notes [here](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0).
fr: Accédez aux notes de version complètes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0).
pt: Encontre as notas de lançamento completas [aqui](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0).
zh_cn: 在 [此处](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0) 找到完整的发行说明。

source: Many thanks to Aarush Bhat ([@sloorush](https://github.com/sloorush)), Minh Dao ([@minhqdao](https://github.com/minhqdao)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Sergey Fedorov ([@barracuda156](https://github.com/barracuda156)), Sebastien Marie ([@semarie](https://github.com/semarie)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Federico Perini ([@perazz](https://github.com/perazz)), Ivan Pribec ([@ivan-pi](https://github.com/ivan-pi)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)) for contributing patches to this release.
fr: Un grand merci à Aarush Bhat ([@sloorush](https://github.com/sloorush)), Minh Dao ([@minhqdao](https://github.com/minhqdao)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Sergey Fedorov ([@barracuda156](https://github.com/barracuda156)), Sebastien Marie ([@semarie](https://github.com/semarie)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Federico Perini ([@perazz](https://github.com/perazz)), Ivan Pribec ([@ivan-pi](https://github.com/ivan-pi)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)) pour avoir contribué aux correctifs de cette version.
pt: Muito obrigado a Aarush Bhat ([@sloorush](https://github.com/sloorush)), Minh Dao ([@minhqdao](https://github.com/minhqdao)), Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Sergey Fedorov ([@barracuda156](https://github.com/barracuda156)), Sebastien Marie ([@semarie](https://github.com/semarie)), Giannis Nikiteas ([@gnikit](https://github.com/gnikit)), Federico Perini ([@perazz](https://github.com/perazz)), Ivan Pribec ([@ivan-pi](https://github.com/ivan-pi)), John Urban ([@urbanjost](https://github.com/urbanjost)), Zuo Zhihua ([@zoziha](https://github.com/zoziha)) por contribuírem para esta versão.
zh_cn: 非常感谢Aarush Bhat（[@sloorush](https://github.com/sloorush)），Minh Dao（[@minhqdao](https://github.com/minhqdao)），Sebastian Ehlert（[@awvwgk](https://github.com/awvwgk)），Sergey Fedorov（[@barracuda156](https://github.com/barracuda156)），Sebastien Marie（[@semarie](https://github.com/semarie)），Giannis Nikiteas（[@gnikit](https://github.com/gnikit)），Federico Perini（[@perazz](https://github.com/perazz)），Ivan Pribec（[@ivan-pi](https://github.com/ivan-pi)），John Urban（[@urbanjost](https://github.com/urbanjost)），Zuo Zhihua（[@zoziha](https://github.com/zoziha)）为这个版本提供了补丁。

source: Set C++ compiler to clang++ in [fpm#787](https://github.com/fortran-lang/fpm/pull/787)
fr: Définit le compilateur C++ comme clang++ dans [fpm#787](https://github.com/fortran-lang/fpm/pull/787)
pt: Configura o clang++ como compilador de C++ [fpm#787](https://github.com/fortran-lang/fpm/pull/787)
zh_cn: 在[fpm#787](https://github.com/fortran-lang/fpm/pull/787)中设置C++编译器为clang++

source: Document ``FPM_CXX``, ``FPM_CXXFLAGS`` and options in [fpm#788](https://github.com/fortran-lang/fpm/pull/788)
fr: Document ``FPM_CXX``, ``FPM_CXXFLAGS`` et options dans [fpm#788](https://github.com/fortran-lang/fpm/pull/788)
pt: As variáveis ``FPM_CXX``, ``FPM_CXXFLAGS`` e suas opções correspondentes foram adicionadas no [fpm#788](https://github.com/fortran-lang/fpm/pull/788)
zh_cn: ``FPM_CXX``，``FPM_CXXFLAGS``和[fpm#788](https://github.com/fortran-lang/fpm/pull/788)中的选项写入文档

source: Simplify and update README in [fpm#778](https://github.com/fortran-lang/fpm/pull/778)
fr: Simplifie et met à jour le README dans [fpm#778](https://github.com/fortran-lang/fpm/pull/778)
pt: Simplifica e atualiza o README em [fpm#778](https://github.com/fortran-lang/fpm/pull/778)
zh_cn: 在[fpm#778](https://github.com/fortran-lang/fpm/pull/778)中简化并更新README

source: Add C++ flags to profiles in [fpm#786](https://github.com/fortran-lang/fpm/pull/786)
fr: Ajouter des drapeaux C++ aux profils dans [fpm#786](https://github.com/fortran-lang/fpm/pull/786)
pt: Adiciona flags de C++ flags aos profiles em [fpm#786](https://github.com/fortran-lang/fpm/pull/786)
zh_cn: 在[fpm#786](https://github.com/fortran-lang/fpm/pull/786)中为配置文件添加C++标志

source: fix 32-bit platform issues with M\_CLI2 in [fpm#796](https://github.com/fortran-lang/fpm/pull/796)
fr: Correction des problèmes liés aux plates-formes 32 bits avec M\_CLI2 dans [fpm#796](https://github.com/fortran-lang/fpm/pull/796)
pt: Corrige problemas com plataformas de 32-bit gerada pelo M\_CLI2 em [fpm#796](https://github.com/fortran-lang/fpm/pull/796)
zh_cn: 修复[fpm#796](https://github.com/fortran-lang/fpm/pull/796)中M_CLI2的32位平台问题

source: Fix missing space before -D option for preprocessor in [fpm#804](https://github.com/fortran-lang/fpm/pull/804)
fr: Corrige l'espace manquant avant l'option -D pour le préprocesseur dans [fpm#804](https://github.com/fortran-lang/fpm/pull/804)
pt: Corrige a falta de espaço antes da opção do preprocessador em [fpm#804](https://github.com/fortran-lang/fpm/pull/804)
zh_cn: 在[fpm#804](https://github.com/fortran-lang/fpm/pull/804)中修复预处理器-D选项前缺失的空格

source: Do not pass in quotes in manifest tests in [fpm#806](https://github.com/fortran-lang/fpm/pull/806)
fr: Pas de passage entre guillemets dans les tests du manifeste dans [fpm#806](https://github.com/fortran-lang/fpm/pull/806)
pt: Não passe aspas nos testes do manifesto em [fpm#806](https://github.com/fortran-lang/fpm/pull/806)
zh_cn: 在[fpm#806](https://github.com/fortran-lang/fpm/pull/806)中的清单测试中不要传入引号

source: Improve error handling for invalid ``git`` dependencies in [fpm#797](https://github.com/fortran-lang/fpm/pull/797)
fr: Améliore la gestion des erreurs pour les dépendances ``git`` invalides dans [fpm#797](https://github.com/fortran-lang/fpm/pull/797)
pt: Melhora o gerenciamento de erros para dependências ``git`` inválidas em [fpm#797](https://github.com/fortran-lang/fpm/pull/797)
zh_cn: 改进对[fpm#797](https://github.com/fortran-lang/fpm/pull/797)中无效的``git``依赖关系的错误处理

source: Lower windows check precedence in ``get_os_type`` function in [fpm#802](https://github.com/fortran-lang/fpm/pull/802)
fr: Abaisse la vérification de priorité dans Windows dans la fonction ``get_os_type`` dans [fpm#802](https://github.com/fortran-lang/fpm/pull/802)
pt: Menor precedência para o Windows na função ``get_os_type`` em [fpm#802](https://github.com/fortran-lang/fpm/pull/802)
zh_cn: 在[fpm#802](https://github.com/fortran-lang/fpm/pull/802)的``get_os_type``函数中降低窗口检查的优先级

source: Fix broken links to webpage in [fpm#826](https://github.com/fortran-lang/fpm/pull/826)
fr: Corrige les liens brisés vers la page web dans [fpm#826](https://github.com/fortran-lang/fpm/pull/826)
pt: Corrige links quebrados para a página principal em [fpm#826](https://github.com/fortran-lang/fpm/pull/826)
zh_cn: 修复[fpm#826](https://github.com/fortran-lang/fpm/pull/826)中的失效的网页链接

source: Consistently call ``execute_command_line`` from the ``run`` wrapper in [fpm#832](https://github.com/fortran-lang/fpm/pull/832)
fr: Appelle systématiquement ``execute_command_line`` à partir de ``run`` wrapper dans [fpm#832](https://github.com/fortran-lang/fpm/pull/832).
pt: Chamada consistente do comando ``execute_command_line`` dentro do wrapper ``run`` em [fpm#832](https://github.com/fortran-lang/fpm/pull/832)
zh_cn: 在[fpm#832](https://github.com/fortran-lang/fpm/pull/832)中从``run``包装器中一致地调用``execute_command_line``

source: Fix the build on macOS PPC in [fpm#824](https://github.com/fortran-lang/fpm/pull/824)
fr: Corrige la compilation sur macOS PPC dans [fpm#824](https://github.com/fortran-lang/fpm/pull/824)
pt: Corrige a build on macOS PPC em [fpm#824](https://github.com/fortran-lang/fpm/pull/824)
zh_cn: 修复[fpm#824](https://github.com/fortran-lang/fpm/pull/824)中的macOS PPC上的构建

source: Query latest release from GitHub in [fpm#818](https://github.com/fortran-lang/fpm/pull/818)
fr: Interroge la dernière version de GitHub dans [fpm#818](https://github.com/fortran-lang/fpm/pull/818)
pt: Último lançamento do Query do GitHub em [fpm#818](https://github.com/fortran-lang/fpm/pull/818)
zh_cn: 在[fpm#818](https://github.com/fortran-lang/fpm/pull/818)中查询GitHub上的最新版本

source: Add missing dollar sign in OpenMP directive in [fpm#841](https://github.com/fortran-lang/fpm/pull/841)
fr: Ajoute le signe dollar manquant dans la directive OpenMP dans [fpm#841](https://github.com/fortran-lang/fpm/pull/841)
pt: Adiciona símbolo de dólar faltante na diretiva OpenMP em [fpm#841](https://github.com/fortran-lang/fpm/pull/841)
zh_cn: 在[fpm#841](https://github.com/fortran-lang/fpm/pull/841)的OpenMP指令中添加缺失的美元符号

source: Fix query for latest release from GitHub on missing curl in [fpm#839](https://github.com/fortran-lang/fpm/pull/839) and [fpm#842](https://github.com/fortran-lang/fpm/pull/842)
fr: Correction de la requête pour la dernière version de GitHub sur l'absence de curl dans [fpm#839](https://github.com/fortran-lang/fpm/pull/839) et [fpm#842](https://github.com/fortran-lang/fpm/pull/842)
pt: Corrige query para o último lançamento do GitHub no curl faltante em [fpm#839](https://github.com/fortran-lang/fpm/pull/839) e [fpm#842](https://github.com/fortran-lang/fpm/pull/842)
zh_cn: 在[fpm#839](https://github.com/fortran-lang/fpm/pull/839)和[fpm#842](https://github.com/fortran-lang/fpm/pull/842)中修正对GitHub最新发布版本中缺少curl的查询

source: Fix unallocated model variables in the testsuite (#844) in [fpm#845](https://github.com/fortran-lang/fpm/pull/845)
fr: Corrige les variables de modèle non allouées dans la suite de tests (#844) dans [fpm#845](https://github.com/fortran-lang/fpm/pull/845)
pt: Corrige variáveis modelo não alocadas na suíte de teste (#844) em [fpm#845](https://github.com/fortran-lang/fpm/pull/845)
zh_cn: 在[fpm#845](https://github.com/fortran-lang/fpm/pull/845)中修复测试套件中未分配的模型变量（#844）

source: Add wait when linking library with \*.resp file in [fpm#808](https://github.com/fortran-lang/fpm/pull/808)
fr: Ajout d'un délai d'attente lors de l'édition de liens avec le fichier \*.resp dans [fpm#808](https://github.com/fortran-lang/fpm/pull/808)
pt: Adiciona "wait" quando conectando biblioteca com arquivo \*.resp em [fpm#808](https://github.com/fortran-lang/fpm/pull/808)
zh_cn: 在[fpm#808](https://github.com/fortran-lang/fpm/pull/808)中，使用``*.resp``文件库链接时增加等待

source: Add option to enforce module naming in [fpm#828](https://github.com/fortran-lang/fpm/pull/828)
fr: Ajout d'une option pour imposer le nommage des modules dans [fpm#828](https://github.com/fortran-lang/fpm/pull/828)
pt: Adiciona opção para forçar nomeação do módulo em [fpm#828](https://github.com/fortran-lang/fpm/pull/828)
zh_cn: 在[fpm#828](https://github.com/fortran-lang/fpm/pull/828)中增加强制模块命名的选项

source: Fix unhandled error branch in [fpm#849](https://github.com/fortran-lang/fpm/pull/849)
fr: Corrige la branche d'erreur non gérée dans [fpm#849](https://github.com/fortran-lang/fpm/pull/849)
pt: Corrige caminho de erro não processado em [fpm#849](https://github.com/fortran-lang/fpm/pull/849)
zh_cn: 修复[fpm#849](https://github.com/fortran-lang/fpm/pull/849)中未处理的错误分支

source: Automated dependency tree update in [fpm#843](https://github.com/fortran-lang/fpm/pull/843)
fr: Mise à jour automatisée de l'arbre des dépendances dans [fpm#843](https://github.com/fortran-lang/fpm/pull/843)
pt: Atualização de árvore de dependências automática em [fpm#843](https://github.com/fortran-lang/fpm/pull/843)
zh_cn: 在[fpm#843](https://github.com/fortran-lang/fpm/pull/843)中自动更新依赖关系树

source: Return program's exit code from fpm run in [fpm#852](https://github.com/fortran-lang/fpm/pull/852) and [fpm#](https://github.com/fortran-lang/fpm/pull/858)
fr: Renvoi du code de sortie du programme par fpm run dans [fpm#852](https://github.com/fortran-lang/fpm/pull/852) et [fpm#858](https://github.com/fortran-lang/fpm/pull/858)
pt: Retorna o código de saída do programa vindo do "fpm run" em [fpm#852](https://github.com/fortran-lang/fpm/pull/852) and [fpm#](https://github.com/fortran-lang/fpm/pull/858)
zh_cn: 返回在[fpm#852](https://github.com/fortran-lang/fpm/pull/852)和[fpm#](https://github.com/fortran-lang/fpm/pull/858)中运行的fpm的程序退出代码

source: Update gcc version to 10 for CI in [fpm#857](https://github.com/fortran-lang/fpm/pull/857)
fr: Met à jour la version de gcc à 10 pour l'intégration continue dans [fpm#857](https://github.com/fortran-lang/fpm/pull/857)
pt: Atualiza versão gcc para 10 para CI em [fpm#857](https://github.com/fortran-lang/fpm/pull/857)
zh_cn: 在[fpm#857](https://github.com/fortran-lang/fpm/pull/857)中为CI更新gcc版本至10

source: Fix macOS CI for fpm-bootstrap executables built with gcc-9 in [fpm#861](https://github.com/fortran-lang/fpm/pull/861)
fr: Corrige l'intégration continue macOS pour les exécutables fpm-bootstrap construits avec gcc-9 dans [fpm#861](https://github.com/fortran-lang/fpm/pull/861)
pt: Corrige macOS CI para construção dos executáveis fpm-bootstrap com gcc-9 em [fpm#861](https://github.com/fortran-lang/fpm/pull/861)
zh_cn: 在[fpm#861](https://github.com/fortran-lang/fpm/pull/861)中为用gcc-9构建的fpm-bootstrap可执行文件修复macOS CI

source: Update TOML Fortran to version 0.4.0 in [fpm#862](https://github.com/fortran-lang/fpm/pull/862)
fr: Mise à jour de TOML Fortran vers la version 0.4.0 dans [fpm#862](https://github.com/fortran-lang/fpm/pull/862)
pt: Atualiza TOML Fortran para versão 0.4.0 em [fpm#862](https://github.com/fortran-lang/fpm/pull/862)
zh_cn: 在[fpm#862](https://github.com/fortran-lang/fpm/pull/862)中更新TOML Fortran到0.4.0版本

source: Add support for toggling Fortran features in [fpm#864](https://github.com/fortran-lang/fpm/pull/864)
fr: Ajout de la prise en charge du basculement des fonctionnalités Fortran dans [fpm#864](https://github.com/fortran-lang/fpm/pull/864)
pt: Adiciona suporte para alternar funcionalidades do Fortran em [fpm#864](https://github.com/fortran-lang/fpm/pull/864)
zh_cn: 在[fpm#864](https://github.com/fortran-lang/fpm/pull/864)中增加对切换Fortran功能的支持

source: Add global configuration file and support local and remote registry [fpm#817](https://github.com/fortran-lang/fpm/pull/817)
fr: Ajout d'un fichier de configuration globale et prise en charge du registre local et distant [fpm#817](https://github.com/fortran-lang/fpm/pull/817)
pt: Adiciona arquivo de configuração global e registro de suporte local e remoto [fpm#817](https://github.com/fortran-lang/fpm/pull/817)
zh_cn: 增加全局配置文件，支持本地和远程注册表[fpm#817](https://github.com/fortran-lang/fpm/pull/817)

source: Fpm version 0.8.1 released
fr: Fpm 0.8.1 est sorti
pt: Lançada versão 0.8.1 do fpm
zh_cn: Fpm 0.8.1版发布

source: This release introduces a hotfix for the automated dependency tree feature introduced in [v0.8.0](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0). Fpm now restored backward-compatible dependency priority, which ensures that, whenever different versions of the same dependency are found down the dependency tree, the first and foremost is used. Unnecessary dependency updates are also shed from the build process.
fr: Cette version introduit un correctif pour la fonctionnalité d'arbre de dépendance automatisé introduite dans la [version 0.8.0](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0). Fpm a maintenant restauré la priorité des dépendances rétrocompatibles, ce qui garantit que, lorsque différentes versions d'une même dépendance sont trouvées dans l'arbre des dépendances, c'est la première et principale qui est utilisée. Les mises à jour inutiles sont également éliminées du processus de construction.
pt: Esse lançamento introduz um "hotfix" para a funcionalidade de árvore de dependência automatizada introduzida em [v0.8.0](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0). Fpm agora restaura prioridade de dependência retrocompatível, o que garante que, sempre que versões diferentes da mesma dependência são encontradas na árvore de dependências, a primeira é usada. Atualizações de dependência desnecessárias são removidas do processo de build.
zh_cn: 这个版本为[v0.8.0](https://github.com/fortran-lang/fpm/releases/tag/v0.8.0)中引入的自动依赖树功能引入了一个热修复。Fpm现在恢复了向后兼容的依赖性优先级，这确保了当同一依赖性的不同版本在依赖树中被发现时，首先使用的是最重要的版本。不必要的依赖性更新也从构建过程中剔除了。

source: Find the full release notes [here](https://github.com/fortran-lang/fpm/releases/tag/v0.8.1).
fr: Accédez aux notes de version complètes [ici](https://github.com/fortran-lang/fpm/releases/tag/v0.8.1).
pt: Encontre as notas de lançamento completas [aqui](https://github.com/fortran-lang/fpm/releases/tag/v0.8.1).
zh_cn: 查看[这里](https://github.com/fortran-lang/fpm/releases/tag/v0.8.1)完整的发行说明。

source: Many thanks to Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Brad Richardson ([@everythingfunctional](https://github.com/everythingfunctional)), John Urban ([@urbanjost](https://github.com/urbanjost)), for testing the new release and allowing this hotfix to be deployed quickly.
fr: Un grand merci à Sebastian Ehlert ([@awvwgk](https://github.com/awvwgk)), Brad Richardson ([@everythingfunctional](https://github.com/everythingfunctional)), John Urban ([@urbanjost](https://github.com/urbanjost)), pour avoir testé la nouvelle version et permis le déploiement rapide de ce correctif.
zh_cn: 非常感谢Sebastian Ehlert（[@awvwgk](https://github.com/awvwgk)），Brad Richardson（[@everythingfunctional](https://github.com/everythingfunctional)），John Urban ([@urbanjost](https://github.com/urbanjost)），测试新版本并允许快速部署这个热修复。

source: Only update dependencies between cached build and manifest (fix) by @perazz in [fpm#871](https://github.com/fortran-lang/fpm/pull/871)
fr: Mise à jour des dépendances uniquement entre la version mise en cache et le manifeste (correction) par @perazz dans [fpm#871](https://github.com/fortran-lang/fpm/pull/871)
zh_cn: 由@perazz 在[fpm#871](https://github.com/fortran-lang/fpm/pull/871)中只更新缓存构建和清单之间的依赖关系（修复）

source: Print dependency update messages on verbosity>0 (fix) by @perazz in [fpm#873](https://github.com/fortran-lang/fpm/pull/873)
fr: Imprimer les messages de mise à jour des dépendances lorsque la verbosité>0 (correction) par @perazz dans [fpm#873](https://github.com/fortran-lang/fpm/pull/873)
zh_cn: 由@perazz在[fpm#873](https://github.com/fortran-lang/fpm/pull/873)中：在verbosity>0时打印依赖性更新信息（修复）

source: Automated dependency update: restore deterministic behavior by @perazz in [fpm#875](https://github.com/fortran-lang/fpm/pull/875)
fr: Mise à jour automatisée des dépendances : restaurer le comportement déterministe par @perazz dans [fpm#875](https://github.com/fortran-lang/fpm/pull/875)
zh_cn: 由@perazz在[fpm#875](https://github.com/fortran-lang/fpm/pull/875)中自动依赖性更新：恢复确定性行为

source: Fpm version 0.8.2 released
fr: Fpm 0.8.2 est sorti
pt: Lançada a versão 0.8.2 do fpm
zh_cn: Fpm 0.8.2版发布

source: Registry preview release.
fr: Version expérimentale du registre.
zh_cn: 登记处预览版。

source: This release introduces fpm support for uploading packages to the fpm-registry server directly from the command-line interface, via
fr: Cette version introduit la prise en charge par fpm du téléversement de paquets vers le serveur du registre fpm directement à partir de l'interface en ligne de commande, via la commande
zh_cn: 这个版本引入了fpm支持，可以直接从命令行界面上传软件包到fpm-registry服务器，通过

source: fpm will now interact with a web interface that will help to manage the namespaces & packages. The release includes furhter bugfixes and extensions for C/C++ support as detailed in the changelog.
fr: fpm interagit désormais avec une interface web qui permet de gérer les espaces de noms et les paquets. Cette version inclut d'autres corrections de bogues et des extensions pour le support de C/C++ comme détaillé dans le changelog.
zh_cn: fpm现在将与一个网络界面互动，这将有助于管理命名空间和软件包。该版本包括更多的错误修正和对C/C++支持的扩展，详见更新日志。
