Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: This is everything we need to start our new project. First, we inspect the package manifest, ``fpm.toml``, which is populated with stub entries for us:
de: Das ist alles, was wir brauchen, um unser neues Projekt zu starten. Zuerst inspizieren wir das Paketmanifest ``fpm.toml``, das mit Platzhaltern für uns gefüllt ist:
es: Esto es todo lo que necesitamos para comenzar nuestro nuevo proyecto. Primero, inspeccionamos el manifiesto del paquete, ``fpm.toml``, que se completa con entradas de código auxiliar para nosotros:
fr: C'est tout ce dont nous avons besoin pour démarrer notre nouveau projet. D'abord, inspectons le manifeste du paquet, ``fpm.toml``, qui contient des entrées par défaut :
in: यह सब कुछ है जिसकी हमें अपनी नई परियोजना शुरू करने के लिए आवश्यकता है। सबसे पहले, हम पैकेज मेनिफ़ेस्ट ``fpm.toml`` का निरीक्षण करते हैं, जो हमारे लिए स्टब प्रविष्टियों से भरा हुआ है:
ja: これが，新しいプロジェクトを開始するために必要な全てです．最初に，パッケージマニフェストである``fpm.toml``を見てみましょう．``fpm.toml``には，仮データが記入されています．
nl: Meer hebben we niet nodig om een begin te maken met ons nieuwe project. Eerst inspecteren we het manifestbestand ``fpm.toml``, dat met dummygegevens is gevuld
pt: Isso é tudo que é necessário para começarmos o nosso novo projeto. Primeiro, inspecionamos o manifesto do pacote, ``fpm.toml``, que vem preenchido com alguns valores para a gente:
zh_cn: 这就是我们开始新项目所需的一切。首先，我们检查包清单``fpm.toml``，它为我们填充了存根条目：

source: The package manifest contains all the required meta data for the new project. Next we checkout the main executable, ``app/main.f90``, fpm has generated for us:
de: Das Paketmanifest enthält alle erforderlichen Metadaten für das neue Projekt. Als nächstes überprüfen wir die ausführbare Hauptdatei ``app/main.f90``, die fpm für uns erzeugt hat:
es: El manifiesto del paquete contiene todos los metadatos necesarios para el nuevo proyecto. A continuación, verificamos el ejecutable principal ``app/main.f90`` que fpm ha generado para nosotros:
fr: Le manifeste du paquet contient toutes les méta-données requises pour le nouveau projet. Ensuite, regardons l'exécutable principal, ``app/main.f90``, généré par fpm :
in: पैकेज मेनिफेस्ट में नए प्रोजेक्ट के लिए सभी आवश्यक मेटाडेटा शामिल हैं। अगला हम मुख्य एक्जीक्यूटेबल्स, ``app/main.f90`` चेकआउट करते हैं, fpm हमारे लिए उत्पन्न हुआ है:
ja: パッケージマニフェストには，新規プロジェクトに必要な全てのメタデータが含まれています．次に，fpmが生成した実行ファイル``app/main.f90``を確かめます．
nl: Het manifestbestand bevat alle benodigde metagegevens voor het nieuwe project. Vervolgens controleren we het hoofdprogramma in het bestand ``app/main.f90``, dat fpm voor ons heeft gegenereerd:
pt: O manifesto do pacote contém todos os metadados para o novo projeto. A seguir, conferimos o executável principal, ``app/main.f90``, que o fpm nos gerou:
zh_cn: 包清单包含新项目所需的所有元数据。接下来，我们检查主可执行文件``app/main.f90``，fpm已经为我们生成：

source: The program already uses a module from our library, which we can find in ``src/first_steps.f90``:
de: Das Programm verwendet bereits ein Modul aus unserer Bibliothek, das wir unter ``src/first_steps.f90`` finden:
es: El programa ya usa un módulo desde nuestra biblioteca, que podemos encontrar en ``src/first_steps.f90``:
fr: Le programme utilise déjà un module de notre bibliothèque, que nous pouvons trouver dans ``src/first_steps.f90`` :
in: प्रोग्राम पहले से ही हमारी लाइब्रेरी के एक मॉड्यूल का उपयोग करता है, जिसे हम ``src/first_steps.f90`` में पा सकते हैं:
ja: このプログラムは，既にライブラリからモジュールを`use`しています．当該のモジュールは，``src/first_steps.f90``で確認できます．
nl: Het programma gebruikt al een module uit onze bibliotheek, die we in het bestand ``src/first_steps.f90`` vinden:
pt: O programa já usa um módulo de nossa biblioteca, que podemos encontrar em ``src/first_steps.f90``:
zh_cn: 该程序已经使用了我们库中的一个模块，我们可以在以下位置``src/first_steps.f90``找到该模块：

source: We can run the executable directly with the command ``fpm run``:
de: Wir können die ausführbare Datei direkt mit dem Befehl ``fpm run`` ausführen:
es: Podemos usar directamente el ejecutable con el comando ``fpm run``:
fr: Nous pouvons lancer l'exécutable directement avec la commande ``fpm run`` :
in: हम एक्जीक्यूटेबल्स को सीधे ``fpm run`` कमांड के साथ चला सकते हैं:
ja: ``fpm run``コマンドによって，実行ファイルを直接実行できます．
nl: We kunnen de executable direct draaien met de opdracht ``fpm run``:
pt: Podemos rodar o executável diretamente com o comando ``fpm run``:
zh_cn: 我们可以直接使用以下命令``fpm run``运行可执行文件：

source: Similarly, fpm has already created a stub for testing, which can be invoked with ``fpm test``:
de: In ähnlicher Weise hat fpm bereits einen Platzhalter zum Testen erstellt, der mit ``fpm test`` aufgerufen werden kann:
es: Del mismo modo, fpm ya ha creado un código auxiliar para realizar pruebas, que puede ser usado con ``fpm test``:
fr: De même, fpm a déjà créé un fichier par défaut pour les tests, qui peut être appelé avec ``fpm test`` :
ja: 同様に，fpmはテストのための仮ソースを作成済みであり，``fpm test``で呼び出せます．
nl: Op dezelfde manier heeft fpm al een opzetje gemaakt voor het testen, dat met ``fpm test`` uitgevoerd wordt:
pt: Além disso, fpm já criou uma rotina sobressalente para os testes, que pode ser chamada com ``fpm test``:
zh_cn: 类似地，fpm会创建了一个用于测试的存根，可以使用命令``fpm test``调用：

source: Fpm will automatically track changes in your project when running your project using the *run* and *test* commands.
de: Fpm verfolgt automatisch die Änderungen in Ihrem Projekt, wenn die Befehle *run* and *test* ausführt werden.
es: Fpm rastreará automáticamente los cambios en su proyecto cuando ejecute este usando los comandos *run* y *test*.
fr: Fpm suivra automatiquement les modifications apportées à votre projet lors de l'exécution des commandes *run* et *test*.
in: जब आपका प्रोजेक्ट *run* और *test* कमांड का उपयोग करके चल रहा हो तो एफपीएमस्वचालित रूप से आपके प्रोजेक्ट में परिवर्तनों को ट्रैक करेगा।
ja: Fpmは，*run*や*test*サブコマンドによってプロジェクトを実行する際に，自動的にプロジェクトの変更を追跡します．
nl: Fpm gaat automatisch alle veranderingen in het projekt na, wanneer de opdrachten *run* en *test* uitgevoerd worden.
pt: O fpm automaticamente detecta mudanças em seu projeto ao rodá-lo usando os comandos *run* e *test*.
zh_cn: fpm将在使用运行命令（*run*）和测试命令（*test*）运行项目时自动跟踪项目中的更改。

source: create a new project from the fpm command line
de: ein neues Projekt über die fpm-Befehlszeile erstellt
es: crear un nuevo proyecto desde la línea de comando de fpm
fr: créer un nouveau projet à partir de la ligne de commandes fpm
in: एफपीएम कमांड लाइन से एक नया प्रोजेक्ट बनाएं
ja: fpmコマンドラインから新規プロジェクトを作成する方法
nl: een nieuw project met fpm-opdrachten opzet
pt: criar um novo projeto com o fpm usando linha de comando
zh_cn: 从fpm命令行创建新项目；

source: build and run your project executables with fpm
de: Projekt-Programme mit fpm erstellt und ausführt
es: construir y usar los ejecutables de su proyecto con fpm
fr: construire et exécuter les exécutables de votre projet avec fpm
in: एफपीएम के साथ अपने प्रोजेक्ट एक्जीक्यूटेबल्स बनाएं और चलाएं
ja: fpmを用いてプロジェクトをビルドし，実行する方法
nl: programma's op basis van projectdefinities met fpm bouwt en uitvoert
pt: compilar e rodar os executáveis do seu projeto com o fpm
zh_cn: 使用fpm构建和运行项目可执行文件；

source: run tests with fpm
de: Tests mit fpm startet
es: ejecutar pruebas con fpm
fr: exécuter des tests avec fpm
in: एफपीएम के साथ परीक्षण चलाएं
ja: fpmを用いてテストを実行する方法
nl: testen met fpm start
pt: executar testes com o fpm
zh_cn: 使用 fpm 运行测试。

source: Tutorials
es: Tutoriales
fr: Tutoriels
in: ट्यूटोरियल
ja: 実践手引
pt: Tutoriais
zh_cn: 教程

source: This section contains courses for learning about the usage and fpm at specific examples.
de: In diesem Abschnitt befinden sich Kurse zum Erlernen der Verwendung von fpm an ausgewählten Beispielen.
es: Esta sección contiene cursos para aprender sobre el uso de fpm en ejemplos específicos.
fr: Cette section contient des tutos pour apprendre à utiliser fpm dans des cas concrets.
in: इस खंड में विशिष्ट उदाहरणों पर उपयोग और एफपीएम के बारे में सीखने के पाठ्यक्रम शामिल हैं।
ja: ここには，使用方法やfpmの具体的な事例を学ぶための教程を掲載しています．
nl: In dit deel vind je tutorials om te leren omgaan met fm aan de hand van specifieke voorbeelden.
pt: Esta seção contém alguns cursos para aprender sobre o uso do fpm em exemplos específicos.
zh_cn: 本节包含用于了解特定示例的用法和fpm的教程。

source: Extending fpm with plugins
de: FPM mit Plugins erweitern
es: Extendiendo fpm con complementos
fr: Etendre fpm avec des greffons
in: प्लगइन्स के साथ एफपीएम का विस्तार
ja: プラグインによるfpmの拡張
nl: Uitbreiden van fpm met plugins
pt: Estendendo fpm com complementos
zh_cn: 使用插件扩展fpm

source: The Fortran package manager has a plugin system which allows to easily extend its functionality. This tutorial will show how to install a plugin with fpm and use it.
de: Der Fortran-Paketmanager verfügt über ein Plugin-System, mit dem sich seine Funktionalität leicht erweitern lässt. In diesem Tutorial wird gezeigt, wie man ein Plugin mit fpm installiert und verwendet.
es: El administrador de paquetes de Fortran tiene un sistema de complementos que permite ampliar fácilmente su funcionalidad. Este tutorial mostrará cómo instalar un complemento con fpm y usarlo.
fr: Le gestionnaire de paquets Fortran possède un système de greffons qui permet d'étendre facilement ses fonctionnalités. Ce tutoriel montre comment installer un greffon fpm et l'utiliser.
in: फोरट्रान पैकेज मैनेजर में एक प्लगइन सिस्टम है जो इसकी कार्यक्षमता को आसानी से बढ़ाने की अनुमति देता है। यह ट्यूटोरियल दिखाएगा कि एफपीएम के साथ एक प्लगइन कैसे स्थापित करें और इसका उपयोग कैसे करें।
ja: Fortranパッケージマネージャにはプラグインシステムが備わっており，機能を容易に拡張できます．ここでは，プラグインをインストールし，使用する方法を示します．
nl: The Fortran-packagemanager heeft een pluginsysteem dat je in staat stelt om de functionaliteit eenvoudig uit te breiden. Deze tutorial illustreert de werkwijze.
pt: O Gerenciador de Pacotes Fortran possui um sistema de plugins que permite estender sua funcionalidade. Este tutorial mostrará como instalar um plugin com fpm e usá-lo.
zh_cn: Fortran包管理器有一个插件系统，可以轻松扩展其功能。本教程将展示如何使用fpm安装插件并使用它。

source: Registry search tool
de: Registry-Suchtool
es: Herramienta de búsqueda del registro
fr: Outil de recherche de paquets fpm
in: रजिस्ट्री खोज उपकरण
ja: レジストリ検索ツール
nl: Registreer een zoekopdracht
pt: Ferramenta de busca de pacotes
zh_cn: 注册表搜索工具

source: The [fpm-search](https://github.com/urbanjost/fpm-search) project is a plugin to query the package registry. Since it is built with fpm we can easily install it on our system with
de: Das [fpm-search](https://github.com/urbanjost/fpm-search) Projekt ist ein Plugin zur Abfrage der Paketregistrierung. Da es mit fpm erstellt wurde, können wir es einfach auf unserem System installieren mit
es: El proyecto [fpm-search](https://github.com/urbanjost/fpm-search) es un complemento para consultar el registro del paquete. Dado que está construido con fpm, podemos instalarlo fácilmente en nuestro sistema con
fr: Le projet [fpm-search](https://github.com/brocolis/fpm-search) est un greffon permettant d'interroger le catalogue des paquets fpm. Comme il est construit avec fpm, nous pouvons facilement l'installer sur notre système avec
in: [एफपीएम-सर्च](https://github.com/urbanjost/fpm-search) प्रोजेक्ट पैकेज रजिस्ट्री को क्वेरी करने के लिए एक प्लगइन है। चूंकि यह एफपीएम के साथ बनाया गया है, इसलिए हम इसे अपने सिस्टम पर आसानी से इंस्टॉल कर सकते हैं
ja: [fpm-search](https://github.com/urbanjost/fpm-search)プロジェクトはパッケージが登録されているfpmレジストリを照会するためのプラグインです．fpmとともにビルドされているので，以下のように簡単にシステムにインストールできます．
pt: O projeto [fpm-search](https://github.com/urbanjost/fpm-search) é um plugin que consulta o registro de pacotes. Dado que ele também é um pacote fpm podemos facilmente instalá-lo em nosso sistema usando
zh_cn: [fpm-search](https://github.com/urbanjost/fpm-search) 项目是一个用于查询包注册表的插件。由于它是使用 fpm 构建的，因此我们可以轻松地将其安装在我们的系统上：

source: This will install the ``fpm-search`` binary to ``~/.local/bin`` (or ``%APPDATA%\local\bin`` on Windows).
de: Dadurch wird die Binärdatei ``fpm-search`` nach ``~/.local/bin`` (oder ``%APPDATA%\local\bin`` unter Windows) installiert.
es: Esto instalará el binario ``fpm-search`` para ``~/.local/bin`` (or ``%APPDATA%\local\bin`` on Windows).
fr: Ceci installera l'exécutable ``fpm-search`` dans ``~/.local/bin`` (ou ``%APPDATA%\local\bin`` sur Windows).
in: यह ``fpm-search`` बाइनरी को ``~/.local/bin`` (या ``%APPDATA%\local\bin`` विंडोज़ पर) में स्थापित करेगा।
ja: ``fpm-search``のバイナリが``~/.local/bin``（Windowsでは``%APPDATA%\local\bin``）にインストールされます．
nl: Hiermee installeer je de ``fpm-search`` executable in ``~/local/bin`` (of ``%APPDATA%\local\bin`` op Windows).
pt: Isso instalará o binário do ``fpm-search`` no ``~/.local/bin`` (ou em ``%APPDATA%\local\bin`` no Windows).
zh_cn: 这会将二进制文件``fpm-search``安装到``~/.local/bin``（或在Windows上的``%APPDATA%\local\bin``）。

source: Ensure that the installed binary is in the ``PATH``, *i.e.* run
de: Stellen Sie sicher, dass die installierte Binärdatei im ``PATH`` ist, *bzw.* benutze
es: Asegúrese que el binario instalado esté en el ``PATH``, *i.e.* run
fr: Vérifiez que l'exécutable est dans la variable ``PATH`` en tapant
in: सुनिश्चित करें कि स्थापित बाइनरी ``PATH`` में है, *यानी* रन
ja: インストールされたバイナリが``PATH``内にあることを確認します．すなわち，次のコマンドを実行します．
nl: Zorg ervoor dat de geïnstalleerde executable in het ``PATH`` staat, *i.e.* run
pt: Se assegure de que o binário instalado está no ``PATH``, *Ex:* rode
zh_cn: 确保安装的二进制文件位于环境路径（``PATH``）中，即运行：

source: If no binary is found, add the directory to your path using
de: Wenn keine Binärdatei gefunden wird, füge das Verzeichnis zum Pfad hinzu mit
es: Si no se encuentra ningún binario, agregue el directorio a su ruta usando
fr: Si l'exécutable n'est pas affiché, ajoutez le répertoire à votre PATH en tapant
in: यदि कोई बाइनरी नहीं मिलती है, तो निर्देशिका का उपयोग करके अपने पथ में जोड़ें
ja: バイナリが見つからない場合は，インストールされたディレクトリをパスに追加します．
nl: Als de executable niet wordt gevonden, voeg de directory toe aan het pad met
pt: Se nenhum binário foi encontrado, adicione o diretório ao seu PATH usando
zh_cn: 如果未找到二进制文件，请使用：

source: Default settings for the bash shell can be found in the ``.bashrc`` file in the home directory, to append to the ``PATH`` following the instructions below.
de: Die Standardeinstellungen für die Bash-Shell finden sich in der Datei ``.bashrc`` im Home-Verzeichnis, um zum ``PATH`` anhängen folge den Schritten unten.
es: La configuración predeterminada para bash shell se puede encontrar en el archivo ``.bashrc`` en el directorio de inicio, para agregar a ``PATH`` siguiendo las instrucciones a continuación.
fr: Les paramètres par défaut de l'interpréteur de commandes bash se trouvent dans le fichier ``.bashrc`` du répertoire personnel. Ajoutons l'exécutable au ``PATH`` en tapant
in: नीचे दिए गए निर्देशों का पालन करते हुए ``PATH`` में संलग्न करने के लिए, बैश शेल के लिए डिफ़ॉल्ट सेटिंग्स होम निर्देशिका में ``.bashrc`` फ़ाइल में पाई जा सकती हैं।
ja: bashシェルの標準設定は，ホームディレクトリにある``.bashrc``で確認できます．以下の手順で``PATH``に追加してください．
nl: Standaardinstellingen voor de bash shell zijn te vinden in het ``.bashrc`` bestand in de home-directory, om een nieuwe directory toe te voegen, zie onder.
pt: Configurações padrão para o shell bash podem ser encontradas no ficheiro ``.bashrc`` em sua pasta pessoal, para adicionar ao ``PATH`` siga as instruções abaixo.
zh_cn: bash shell 的默认设置可以在主目录的 ``.bashrc`` 中找到，根据以下说明以附加到环境路径（``PATH``）：

source: Make sure to source your ``.bashrc`` after changing it, otherwise the change will not be applied to the current shell.
de: Stelle sicher, dass die ``.bashrc`` nach dem Ändern als Quelle verwendet wird, da die Änderung sonst nicht auf die aktuelle Shell angewendet wird.
es: Asegúrese de obtener su ``.bashrc`` después de cambiarlo, de lo contrario, el cambio no se aplicará al shell actual.
fr: Utilisez ``source`` (abrégé ici par un point) pour prendre en compte la mise à jour de votre ``.bashrc``, sinon le changement ne sera pas appliqué au shell actuel.
in: अपने ``.bashrc`` को बदलने के बाद उसका स्रोत सुनिश्चित करें, अन्यथा परिवर्तन वर्तमान शेल पर लागू नहीं होगा।
ja: ``.bashrc``を変更した後，``.bashrc``を再読込してください．そうしないと，変更が現在のシェルに適用されません．
nl: Draai het ``.bashrc`` bestand handmatig na de wijzigingen, anders worden de veranderingen niet opgepikt in de huidige shell.
pt: Tenha certeza de usar o comando source em seu ``.bashrc`` após alterá-lo, caso contrário as mudanças não afetarão o shell atual.
zh_cn: 确保在更改 ``.bashrc`` 后载入它，否则更改将不会应用于当前 shell。

source: Default settings for the zsh shell can be found in the ``.zshrc`` file in the home directory, to append to the ``PATH`` use
de: Die Standardeinstellungen für die Zsh-Shell finden sich in der Datei ``.zshrc`` im Home-Verzeichnis, um zum ``PATH`` anhängen folge den Schritten unten
es: La configuración predeterminada para el shell zsh se puede encontrar en el archivo ``.zshrc`` en el directorio de inicio, para agregar al uso de ``PATH``
fr: Les paramètres par défaut de l'interpréteur de commandes zsh se trouvent dans le fichier ``.zshrc`` du répertoire personnel. Ajoutons l'exécutable au ``PATH`` en tapant
in: zsh शेल के लिए डिफ़ॉल्ट सेटिंग्स होम निर्देशिका में '.zshrc' फ़ाइल में पाई जा सकती हैं, ताकि 'PATH' उपयोग को जोड़ा जा सके
ja: zshシェルの標準設定はホームディレクトリの``.zshrc``で確認できます．下記コマンドを用いて``PATH``に追加してください．
nl: Standaardinstellingen voor de zsh shell zijn te vinden in het ``.zshrc`` bestand "in de home-directory, om een nieuwe directory toe te voegen, zie onder.
pt: Confirgurações padrões podem ser encontradas no ficheiro ``.zshrc`` em sua pasta pessoal, para adicionar ao ``PATH`` use
zh_cn: zsh shell 的默认设置可以在主目录的 ``.zshrc`` 文件中找到，以附加到环境路径（``PATH``）使用：

source: Make sure to restart zsh after changing the ``.zshrc`` it, otherwise the change will not be applied to the current shell.
de: Stelle sicher, dass die zsh neugestartet nachdem ``.zshrc`` geändert wurde, da die Änderung sonst nicht auf die aktuelle Shell angewendet wird.
es: Asegúrese de reiniciar zsh después de cambiar ``.zshrc``, de lo contrario, el cambio no se aplicará al shell actual.
fr: Redémarrez zsh après avoir modifié le ``.zshrc``, sinon le changement ne sera pas appliqué au shell actuel.
in: ``.zshrc`` को बदलने के बाद zsh को फिर से शुरू करना सुनिश्चित करें, अन्यथा परिवर्तन वर्तमान शेल पर लागू नहीं होगा।
ja: ``.zshrc``を変更した後，zshを再起動してください．そうしないと，変更が現在のシェルに適用されません．
nl: Start de zsh shell opnieuw op na het veranderen van het ``.zshrc`` bestand, anders worden de veranderingen niet opgepikt.
pt: Tenha certeza de reiniciar o zsh após mudar o ``.zshrc``, caso contrário a mudança não afetará o shell atual.
zh_cn: 确保在更改``.zshrc``后重新启动zsh，否则更改将不会应用于当前shell。

source: The ``PATH`` variable can be modified using the pathman program from the cmd prompt
de: Die Variable ``PATH`` kann mit dem pathman-Programm über die cmd-Eingabeaufforderung geändert werden
es: La variable ``PATH`` se puede modificar usando el programa pathman desde el indicador cmd
fr: La variable ``PATH`` peut être modifiée en utilisant le programme pathman à partir de l'invite de commandes cmd
in: ``PATH`` वेरिएबल को cmd प्रॉम्प्ट से पाथमैन प्रोग्राम का उपयोग करके संशोधित किया जा सकता है
ja: ``PATH``変数は，コマンドプロンプトからpathmanプログラムを利用して変更できます．
nl: De ``PATH`` variabele kan gewijzigd worden met het programma pathman op de cmd prompt
pt: A variável de ambiente ``PATH`` pode ser modificada usando o programa pathman a partir da linha de comando
zh_cn: 可以使用 cmd 提示符中的路径程序修改变量 ``PATH``：

source: Now with a working installation we can invoke our new plugin from fpm.
de: Jetzt mit einer funktionierenden Installation können wir unser neues Plugin von fpm aufrufen.
es: Ahora, con una instalación en funcionamiento, podemos invocar nuestro nuevo complemento desde fpm.
fr: Maintenant que l'installation fonctionne, nous pouvons utiliser notre nouveau greffon avec fpm.
in: अब एक कार्यशील स्थापना के साथ हम एफपीएम से हमारे नए प्लगइन का आह्वान कर सकते हैं।
ja: インストールできたので，fpmから新しいプラグインを呼び出すことができます．
nl: Met een geslaagde installatie kunnen we onze nieuwe plugin gebruiken via fpm:
pt: Agora, com uma instalação funcional, podemos chamar nosso novo plugin a partir do fpm.
zh_cn: 现在，通过之前的安装工作，我们可以从fpm调用我们的新插件。

source: Note that we use ``fpm search`` rather than ``fpm-search`` in the command. To find a package for building a command-line interface we can now type
de: Nun können wir ``fpm search`` statt ``fpm-search`` als Befehl verwenden. Um ein Paket für die Erstellung einer Befehlszeilenschnittstelle zu finden, können wir nun Folgendes eingeben
es: Tenga en cuenta que usamos ``fpm search`` en lugar de ``fpm-search`` en el comando. Para encontrar un paquete para crear una interfaz de línea de comandos, ahora podemos escribir
fr: Notez que nous utilisons ``fpm search`` plutôt que ``fpm-search`` dans la commande. Pour trouver un paquet pour construire une interface en ligne de commandes, nous pouvons maintenant taper
in: ध्यान दें कि हम कमांड में 'एफपीएम-सर्च' के बजाय 'एफपीएम सर्च' का उपयोग करते हैं। कमांड-लाइन इंटरफ़ेस बनाने के लिए एक पैकेज खोजने के लिए हम अब टाइप कर सकते हैं
ja: コマンドには，``fpm-search``ではなく``fpm search``を用いていることに注意してください．コマンドラインインタフェースを構築するためのパッケージを見つけるには，次のように入力します．
nl: Merk op dat we nu ``fpm search`` gebruiken in plaats van ``fpm-search`` in de opdracht. Om een pakket te vinden voor het ontwikkelen van opdrachtinterfaces typen we:
pt: Note que usamos ``fpm search`` em vez de ``fpm-search`` no comando. Agora, para encontrarmos um pacote que cria interfaces por linhas de comando podemos escrever
zh_cn: 请注意，我们使用 ``fpm search`` 而不是在命令中使用 ``fpm-search`` 。要查找用于构建命令行界面的包，我们现在可以键入：

source: To use one of the packages in our manifest we can generate the necessary dependency line by running
de: Um eines der Pakete in unserem Manifest zu verwenden, können wir die notwendige Abhängigkeitszeile erzeugen, indem wir
es: Para usar uno de los paquetes en nuestro manifiesto podemos generar la línea de dependencia necesaria ejecutando
fr: Pour ajouter un paquet à notre manifeste, nous pouvons générer la ligne de dépendance nécessaire en exécutant
in: हमारे मैनिफेस्ट में पैकेजों में से एक का उपयोग करने के लिए हम चलाकर आवश्यक निर्भरता रेखा उत्पन्न कर सकते हैं|
ja: パッケージを用いるために必要なマニフェストの依存関係の設定内容を，次のコマンドを実行して生成します．
nl: Om een van de pakketten in het manifest te gebruiken kunnen we de regel voor de afhankelijkheid toevoegen met:
pt: Para utilizar um dos pacotes no nosso manifesto podemos gerar a dependência necessária rodando
zh_cn: 要使用清单中的某个包，我们可以通过以下方式生成必要的依赖关系行：

source: Adding this line to a package manifest allows to depend on the respective project.
de: Das Hinzufügen dieser Zeile zu einem Paketmanifest ermöglicht die Abhängigkeit von dem jeweiligen Projekt.
es: Agregar esta línea a un manifiesto de paquete permite depender del proyecto respectivo.
fr: L'ajout de cette ligne à un manifeste permet de dépendre du projet correspondant.
in: इस लाइन को पैकेज मेनिफ़ेस्ट में जोड़ने से संबंधित प्रोजेक्ट पर निर्भर रहने की अनुमति मिलती है।
ja: この一行をパッケージマニフェストに追加することで，当該のプロジェクトを参照できます．
nl: De regel in het manifestbestand zorgt voor de juiste afhankelijkheid.
pt: Adicionar esta linha ao manifesto do pacote permite depender do respectivo projeto.
zh_cn: 将此行添加到包清单以允许依赖于相应的项目。

source: installing an fpm plugin
de: Installieren eines fpm-Plugins
es: instalar un complemento fpm
fr: installer un greffon fpm
in: एफपीएम प्लगइन स्थापित करना
ja: fpmプラグインをインストールする方法
nl: een fpm plugin installeert
pt: instalar um complemento no fpm
zh_cn: 安装fpm插件；

source: use the fpm-search plugin to query the registry
de: Verwendung des fpm-search-Plugins zur Abfrage der Registrierung
es: use el complemento fpm-search para consultar el registro
fr: utiliser le plugin fpm-search pour interroger le catalogue fpm
ja: レジストリを照会するためにfpm-searchプラグインを使用する方法
nl: de plugin fpm-search gebruikt om het register te doorzoeken
pt: usar o complemento fpm-search para consultar o registro
zh_cn: 使用fpm搜索插件查询注册表；
