Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, es, fr, in, ja, nl, pt, zh_cn

source: generate a dependency entry from a query result
de: einen Abhängigkeitseintrag aus einem Abfrageergebnis erzeugen
es: generar una entrada de dependencia a partir de un resultado de consulta
fr: générer une dépendance à partir du résultat d'une requête
in: क्वेरी परिणाम से निर्भरता प्रविष्टि जनरेट करें
ja: 照会結果から依存関係の設定を生成する方法
nl: een afhankelijkheid aanmaakt op basis van een zoekresultaat
pt: gerar uma dependência a partir do resultado de uma consulta
zh_cn: 根据查询结果生成依赖项条目。

source: [![OpenBSD port](https://repology.org/badge/version-for-repo/openbsd/fpm-fortran-package-manager.svg)](https://openports.pl/path/devel/fpm)
pt: [![Versão para o OpenBSD](https://repology.org/badge/version-for-repo/openbsd/fpm-fortran-package-manager.svg)](https://openports.pl/path/devel/fpm)

source: [1] Metcalf, Reid, Cohen, "[Modern Fortran Explained](https://dl.acm.org/doi/book/10.5555/2090092)", Oxford University Press.
in: [1] मेटकाफ, रीड, कोहेन, "[आधुनिक फोरट्रान व्याख्या](https://dl.acm.org/doi/book/10.5555/2090092)", ऑक्सफोर्ड यूनिवर्सिटी प्रेस।

source: Bash (Linux)
in: Bash (लिनक्स)

source: Zsh (MacOS)
in: Zsh (मैकओएस)

source: CMD (Windows)
in: CMD (विंडोज़)

source: This documentation is divided into four parts. Select one of the topics below to continue.
de: Diese Dokumentation ist in vier Hauptteile unterteilt. Wähle eines der folgenden Themen aus, um fortzufahren.
ja: この資料集は，下記の四つの内容から構成されています．読み進めるには，いずれか一つを選択してください．

source: {octicon}`milestone` Design Documents
de: {octicon}`milestone` Design Dokumente
ja: {octicon}`milestone` 設計文書
nl: {octicon}`milestone` Ontwerpdocumenten

source: Resources about the design of the command line interface, the package manifest, and the general user experience
de: Ressourcen für die Gestaltung der Befehlszeilenschnittstelle, des Paketmanifests und der allgemeinen Benutzererfahrung
ja: コマンドラインインタフェース，パッケージマニフェスト，一般的な使用感の設計に関する情報
nl: Informatie over de opzet van de opdracht-interface, het packagemanifest en algemene gebruikerservaring

source: Browse documents
de: Dokumente durchstöbern

source: The Fortran Package Manager is supported for the the *UCRT64*, *MinGW64*, or *MinGW32* terminal.
nl: Voor alledrie terminals, *UCRT64*, *MinGW64* en *MinGW32* wordt fpm ondersteund.

source: There are already many packages available for use with fpm, providing an easily accessible and rich ecosystem of general purpose and high-performance code. For a full list of packages checkout the [fpm registry](https://fortran-lang.org/packages/fpm). New packages can be submitted to the registry [here](https://github.com/fortran-lang/fpm-registry).
nl: Er zijn al een groot aantal pakketten beschikbaar voor fpm, waardoor zich een eenvoudig te gebruiken en rijk ecosysteem van broncode heeft gevormd voor algemeen gebruik en voor snelle rekenmethoden. Zie voor een compleet overzicht de [catalogus van pakketten](https://fortran-lang.org/packages/fpm). Nieuwe pakketten kunnen [hier](https://github.com/fortran-lang/fpm-registry)worden aangemeld.

source: Local dependency paths are given relative to the project root and use ``/`` as path separator on all platforms.
nl: Lokale paden voor afhankelijkheden zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als padscheider voor alle plattforms.

source: Before we continue implementing new features, we want to add some tests to verify that our implementation keeps worked as we modify it. A minimalist testing framework is available with [test-drive]. Since the testing framework is only required when developing the package itself, but not for other packages which might in the future make use of our modules, we add a local dependency. The *test-drive* package is added in the *dev-dependencies* table as shown below
nl: Voor we verder gaan met het implementeren van nieuwe functies, willen we graag een paar testen toevoegen, om te controleren, dat onze implementatie blijft werken, als we iets veranderen. Een minimaal test-framework is beschikbaar via [test-drive]. Omdat het test-framework alleen nodig is voor het pakket dat we zelf ontwikkelen, maar niet voor eventuele andere pakketten, die onze module gaan gebruiken, voegen we een lokale afhankelijkheid toe. Voeg dit *test-drive* pakket toe in de tabel *dev-dependencies*, zoals hieronder aangegeven:
