Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/spec.po
Languages: nl

source: API documentation
nl: API-Dokumentation

source: Specifications and Reference
nl: Specificaties en referentie

source: This section contains the specifications the components of the Fortran Package Manager.
nl: Dit onderdeel detailleert de specificiaties van de componenten van de Fortran-packagemanager.

source: The generated API documentation of the fpm internals can be found [here](https://fortran-lang.github.io/fpm).
nl: De API-documentatie van de interne functies van fpm kan op https://fpm.fortran-lang.org gevonden worden.

source: Manifest reference
nl: Referentie voor manifestbestanden

source: The ``fpm.toml`` file for each project is called its *manifest*. It is written using the [TOML] format. Every manifest file consists of the following sections:
nl: Het ``fpm.toml`` bestand voor elk project wordt het manifestbestand genoemd. Het staat in het [TOML] format. Ieder manifestbestand bevat de volgende secties:

source: [*name*](#project-name): The name of the project
nl: [*name*](#project-name): De naam van het project

source: [*version*](#project-version): The version of the project
nl: [*version*](#project-version): De versie van het project

source: [*license*](#project-license): The project license
nl: [*license*](#project-license): De licentie voor het project

source: [*maintainer*](#project-maintainer): Maintainer of the project
nl: [*maintainer*](#project-maintainer): De beheerder van het project

source: [*author*](#project-author): Author of the project
nl: [*author*](#project-author): De auteur van het project

source: [*copyright*](#project-copyright): Copyright of the project
nl: [*copyright*](#project-copyright): Copyright voor het project

source: [*description*](#project-description): Description of the project
nl: [*description*](#project-description): De omschrijving van het project

source: [*categories*](#project-categories): Categories associated with the project
nl: [*categories*](#project-categories): Categorieën, waaronder het project valt

source: [*keywords*](#project-keywords): Keywords describing the project
nl: [*keywords*](#project-keywords): Sleutelwoorden waarmee het project wordt gekenmerkt

source: [*homepage*](#project-homepage): The project's homepage
nl: [*homepage*](#project-homepage): De homepage van het project

source: Build configuration:
nl: Build-configuratie:

source: [*auto-tests*](#automatic-target-discovery): Toggle automatic discovery of test executables
nl: [*auto-tests*](#automatic-target-descovery): Automatische herkenning van testprogramma's

source: [*auto-examples*](#automatic-target-discovery): Toggle automatic discovery of example programs
nl: [*auto-examples*](#automatic-target-discovery): Automatische herkenning van voorbeeldprogramma's

source: [*auto-executables*](#automatic-target-discovery): Toggle automatic discovery of executables
nl: [*auto-executables*](#automatic-target-discovery): Schakel automatische herkenning van programma's aan/uit

source: [*link*](#link-external-libraries): Link with external dependencies
nl: [*link*](#link-external-dependencies): Link met externe afhankelijkheden

source: [*external-modules*](#use-system-installed-modules): Specify modules used that are not within your fpm package
nl: [*external-modules*](#use-system-installed-moduled): Modules, die niet binnen het fpm pakkeet zelf gedefinieerd worden

source: Target sections:
nl: Target-secties:

source: [*library*](#library-configuration) Configuration of the library target
nl: [*library*](#library-configuration) Configuratie van de bibliotheek-targets

source: [*executable*](#executable-targets) Configuration of the executable targets
nl: [*executable*](#executable-targets) Configuratie van de targets voor executables

source: [*test*](#test-targets) Configuration of the test targets
nl: [*test*](#test-targets) Konfiguration der Test-Targets

source: Dependency sections:
nl: Secties voor afhankelijkheden:

source: [*dependencies*](#specifying-dependencies): Project library dependencies
nl: [*dependencies*](#specifying-dependencies): Bibliotheken gebruikt in het project

source: [*dev-dependencies*](#development-dependencies): Dependencies only needed for tests
nl: [*dev-dependencies*](#development-dependencies): Afhankelijkheden die alleen nodig zijn voor de testen

source: [*install*](#installation-configuration): Installation configuration
nl: [*install*](#installation-configuration): Installatieconfiguratie

source: [*extra*](#additional-free-data-field): Additional free data field
nl: [*extra*](#additional-free-data-field): Veld voor aanvullende gegevens

source: Project name
nl: Projectnaam

source: The project name identifies the package and is used to refer to it. It is used when listing the project as dependency for another package and the default name of the library and executable target. Therefore, the project name must always be present.
nl: De projectnaam geeft het pakket aan en wordt gebruikt, um eraan te refereren. Het wordt ook gebruikt als afhankelijkheid bij andere projecten en als standardnaam voor de targets voor de bibliotheek en de executable. Daarom moet er altijd een projectnaam zijn.

source: *Example:*
nl: *Voorbeeld:*

source: Project version
nl: Projectversie

source: The version number of the project is specified as string. A standardized way to manage and specify versions is the [Semantic Versioning] scheme.
nl: Het versienummer van het project wordt als een string behandeld. Een standaardmethode om versies aan te geven is het zogeheten [Semantic Versioning] schema.

source: The version entry can also contain a filename relative to the project root, which contains the version number of the project
nl: Het veld voor het versienummer kan ook een bestandsnaam zijn relatief t.o.v. de hoofddirectory van het project. Dit bestand bevat dan het versienummer.

source: Project license
nl: Licentie voor het project

source: The project license field contains the license identifier. A standardized way to specify licensing information are [SPDX] identifiers.
nl: Het veld voor de licentie geeft aan welke licentie er voor het project geldt. Een standaardmethode is de [SPDX] Identicatie.

source: *Examples:*
nl: *Voorbeelden:*

source: Projects licensed under the [GNU Lesser General Public License](https://www.gnu.org/licenses/lgpl-3.0-standalone.html), either version 3 or any later version, is specified as
nl: Projecten, die onder de [GNU Lesser General Public License] (https://www.gnu.org/licenses/lgpl-3.0-standalone.html), versie 3 of elke latere versie vallen, worden aangegeven als

source: Dual licensed project under the [Apache license, version 2.0](http://www.apache.org/licenses/LICENSE-2.0) or the [MIT license](https://opensource.org/licenses/MIT) are specified as
nl: Projecten, die onder de [Apache-licentie, versie 2.0] (http://www.apache.org/licenses/LICENSE-2.0) of de [MIT-licentie] (https://opensource.org/licenses/MIT) vallen, worden aangegeven als

source: Project maintainer
nl: Projectbeheerder

source: Information on the project maintainer and means to reach out to them.
nl: Informatie over de projectbeheerder en de mogelijkheden tot contact.

source: Project author
nl: Auteur van het project

source: Information on the project author.
nl: Informationen Ã¼ber den Projekt-Autor.

source: Project copyright
nl: Projekt-Copyright

source: A statement clarifying the copyright status of the project.
nl: Verklaring van de copyrightstatus van het project.

source: Project description
nl: Projectbeschrijving

source: The description provides a short summary on the project. It should be plain text and not using any markup formatting.
nl: De beschrijving hoort een korte samenvatting van het project te zijn zonder enige opmaakcodes.

source: Project categories
nl: Projectcategorieën

source: The project can be associated with different categories.
nl: Het project kan onder meerdere categorieën vallen.

source: Project keywords
nl: Projectsleutelwoorden

source: The keywords field is an array of strings describing the project.
nl: Het veld voor sleutelwoorden bevat een of meer strings die het project beschrijven.

source: Project homepage
nl: Homepage van het project

source: URL to the webpage of the project.
nl: URL voor de website van het project.

source: Project targets
nl: Projekt-Ziele

source: Every fpm project can define library, executable and test targets. Library targets are exported and useable for other projects.
nl: Elk fpm-project kan bibliotheken, executables en testen definiëren. Bibliotheken worden geëxporteerd voor gebruik in andere projecten.

source: Library configuration
nl: Configuratie voor bibliotheken

source: Defines the exported library target of the project. A library is generated if the source directory or include directory is found in a project. The default source and include directories are ``src`` and ``include``; these can be modified in the *library* section using the *source-dir* and *include-dir* entries. Paths for the source and include directories are given relative to the project root and use ``/`` as path separator on all platforms.
nl: Definieert de target voor de te exporteren bibliotheek. Een bibliotheek wordt gegenereerd, als de brondirectory of de include-directory in het project aangetroffen wordt. De standardnamen hiervoor zijn ``src`` und ``include``; deze namen kunnen in de *library*-sectie in het manifestbestand met de entries *source-dir* en *include-dir* aangepast worden. Paden voor deze directories zijn altijd relatief to.v. de hoofddirectory van het project en bevatten ``/`` als padscheiding voor alle plattforms.

source: Supported in Fortran fpm only
nl: Alleen in Fortran fpm ondersteund

source: Projects which use the Fortran `include` statement or C preprocessor `#include` statement, can use the *include-dir* key to specify search directories for the included files. *include-dir* can contain one or more directories, where multiple directories are specified using a list of strings. Include directories from all project dependencies are passed to the compiler using the appropriate compiler flag.
nl: Projecten, die het Fortran include-statement of het `#include` statement van de C-preprocessor gebruiken, kunnen via het sleutelwoord *include-dir* aangeven welke directories de mee te nemen source bestanden bevatten. *include-dir* bestaat uit een of meer directorynamen als een lijst van strings. De include-directories van alle project-afhnakelijkheden worden aan de compiler door middel van de juiste opties doorgegeven.

source: *include-dir* does not currently allow using pre-built module `.mod` files
nl: Op dit moment kan *include-dir* niet gebruikt worden voor voorgecompileerde modules files `.mod`

source: Executable targets
nl: Targets voor executables

source: Executable targets are Fortran programs defined as *executable* sections. If no executable section is specified the ``app`` directory is searched for program definitions. For explicitly specified executables the *name* entry must always be specified. The source directory for each executable can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
nl: Targets die uitvoerbare programma's definiëren staan in de secties *executable*. Als er geen *executable* secties zijn gegeven, wordt in plaats daarvan de directory ``app`` onderzocht. Voor expliciet aangegeven executables moet altijd de *name*-entry opgegeven worden. De brondirectory voor elek executable kan in de entry *source-dir* aangepast worden. Paden voor de source-directory zijn relatief t.o.v. de hoofddirectory van het projecten en gebruiken``/`` als padscheiding op alle plattforms. Het bronbestanden met het hoofdprogramma is aan te geven met de entry *main*.

source: Executables can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
nl: Executables kunnen elk hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.

source: Executables can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
nl: Executables kunnen afzonderlijk afhangen van specifieke bibliotheken. Zie [externe bibliotheken](#link-externe-bibliotheken) "voor verdere details.

source: Linking against libraries is supported in Fortran fpm only
nl: Linking met bibliotheken wordt binnen fpm alleen voor Fortran ondersteund

source: Specifying many separate executables can be done by using inline tables for brevity instead
nl: Als je veel aparte executables hebt, kun je deze specificeren via inline-tabellen.

source: Example targets
nl: Voorbeeld-targets

source: Example applications for a project are defined as *example* sections. If no example section is specified the ``example`` directory is searched for program definitions. For explicitly specified examples the *name* entry must always be specified. The source directory for each example can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
nl: Vorobeeldprogramma's voor een project worden gedefinieerd via *example*-secties. Als er geen example-sectie opgegeven wordt, wordt de directory ``example`` onderzocht voor definities van programma's. Voor expliciet opgegeven voorbeelden is altijd de *name*-entry nodig. De brondirectory voor elk voorbeeld kan in de *source-dir*-entry aangepast worden. Paden voor de brondirectory zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als pPadscheiding op alle plattforms. Het bronbestand met het hoofdprogramma kan in de *main*-entry aangegeven worden.

source: Examples can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
nl: Voorbeeldprogramma's kunnen hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.

source: Examples can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
nl: Voorbeeldprogramma's kunnen afzonderlijk van externe bibliotheken afhangen. Zie [externe bibliotheken](#link-externe-bibliotheken) "voor verdere details.

source: Test targets
nl: Targets voor testen

source: Test targets are Fortran programs defined as *test* sections. They follow similar rules as the executable targets. If no test section is specified the ``test`` directory is searched for program definitions. For explicitly specified tests the *name* entry must always be specified. The source directory for each test can be adjusted in the *source-dir* entry. Paths for the source directory are given relative to the project root and use ``/`` as path separator on all platforms. The source file containing the program body can be specified in the *main* entry.
nl: Testprogramma's in Fortran worden gedefinieerd in *test*-secties. Er gelden soortgelijke regels als voor alle executables. Als er geen sectie is opgegeven, wordt de directory ``test`` doorzocht voor programmadefinities. Voor expliciet opgegeven tests moet altijd de *name*-entry opgegeven worden. De brondirectory voor elke test kan in de *source-dir*-entry aangepast worden. Paden voor de brondirectory zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als padscheiding op alle plattforms. Het bronbestand met het hoofdprogramma kan in de *main*-entry aangegeven worden.

source: Tests can have their own dependencies. See [specifying dependencies](#specifying-dependencies) for more details.
nl: Testprogramma's kunnen hun eigen afhankelijkheden hebben. Zie [specificeren van afhankelijkheden](#specificeren-van-afhankelijkheden) voor meer details.

source: Tests can also specify their own external library dependencies. See [external libraries](#link-external-libraries) for more details.
nl: Testprogramma's kunnen afzonderlijk van externe bibliotheken afhangen. Zie [externe bibliotheken](#link-externe-bibliotheken) "voor verdere details.

source: Link external libraries
nl: Linken met externe bibliotheken

source: To declare link time dependencies on external libraries a list of native libraries can be specified in the *link* entry. Specify either one library as string or a list of strings in case several libraries should be linked. When possible the project should only link one native library. The list of library dependencies is exported to dependent packages.
nl: Om de afhankelijkheid van externe bibliotheken te specificeren, wordt een lijst van de betreffende bibliotheken in de *link*-entry opgegeven. Geef de naam van de bibliotheek of biblotheken op als een string of een lijst van strings. Indien mogelijk moet het project daarvoor een systeemspecifieke bibliotheek gebruiken. De lijst van dergelijke afhankelijkheden wordt doorgegeven aan pakketten die van dit pakket afhangen.

source: To link against the zlib compression library use
nl: Linken met de zlib-compressiebibllotheek, kan als volgt:

source: To dependent on LAPACK also BLAS should be linked. In this case the order of the libraries matters:
nl: Om LAPACK te gebruiken, moet ook BLAS meegelinkt worden. In dit geval is de volgorde van de bibliotheken van belang:

source: Use system-installed modules
nl: Gebruik modules die op het systeem zijn geïnstalleerd

source: To use modules that are not defined within your fpm package or its dependencies, specify the module name using the *external-modules* key in the *build* table.
nl: Om modules te gebruiken die niet in een fpm-pakket of via afhankelijkheden gedefinieerd zijn, moeten ze in een *build*-tabellenentry onder *external-modules* opgegeven worden.

source: *fpm* cannot automatically locate external module files; it is the responsibility of the user to specify the necessary include directories using compiler flags such that the compiler can locate external module files during compilation.
nl: *fpm* kan niet automatisch externe modulebestanden vinden; het is de verantwoordelijkheid van de gebruiker om de benoldigde include-directories met compilerotpies aan te geven, zodat de compiler deze externe moduleberstanden kan vinden.

source: Multiple external modules can be specified as a list.
nl: Meerdere externe modules kunnen aangegeven worden via een lijst.

source: Automatic target discovery
nl: Automatische bepaling targets

source: Executables and test can be discovered automatically in their default directories. The automatic discovery recursively searches the ``app``, ``example``, and ``test`` directories for ``program`` definitions and declares them as executable, example, and test targets, respectively. The automatic discovery is enabled by default.
nl: Executables en testprogramma's kunnen automatisch in de standaarddirectories gevonden worden. De automatische procedure hiervoor doorzoekt recursief de ``app``-, ``example``- und ``test``-directories naar ``program``-definities en merken deze aan als respectievelijk executable-, voorbeeld- en test-targets. De automatische zoekprocedure wordt standaard aangezet.

source: To disable the automatic discovery of targets set the *auto-executables*, *auto-examples*, and *auto-tests* entry to *false*.
nl: Om de automatische bepaling van targets uit te schakelen, zet je de entries*auto-executables*, *auto-examples*, en *auto-tests* op *false*.

source: Specifying dependencies
nl: Afhankelijkheden specificeren

source: Dependencies can be declared in the *dependencies* table in the manifest root or the [*executable*](#executable-targets) or [*test*](#test-targets) sections. When declared in the manifest root the dependencies are exported with the project.
nl: Afhankelijkheden kunnen in de *dependencies*-tabel in het hoofdentry van het manifestbestand of in de [*executable*](#executable-targets) of [*test*](#test-targets)-secties aangegeven worden. Als ze in de hoofdentry worden aangegeven, worden ze met het project geëxporteerd.

source: Local dependencies
nl: Lokale afhankelijkheden

source: To declare local dependencies use the *path* entry.
nl: Om lokale afhankelijkheden aan te geven, moet dr *path*-entry gebruikt worden.

source: Local dependency paths are given relative to the project root and use ``/`` as path separator on all platforms.
nl: Lokale paden voor afhankelijkheden zijn relatief t.o.v. de hoofddirectory van het project en gebruiken ``/`` als padscheider voor alle plattforms.

source: Dependencies from version control systems
nl: Afhankelijkheden van versiebeheersystemen

source: Dependencies can be specified by the projects git repository.
nl: Afhankelijkheden kunnen via een Git-repository van het project aangegeven worden.

source: To use a specific upstream branch declare the *branch* name with
nl: Om een bepaalde branch van de upstream repository aan te geven, moet de *branch*-naam gespecificeerd werden.

source: Alternatively, reference tags by using the *tag* entry
nl: Als alternatief kunnen referentie-tags via een entry *tag* gebruikt worden.

source: To pin a specific revision specify the commit hash in the *rev* entry
nl: Om een bepaalde revisie vast te leggen, moet de hash van de betreffende commit in een *rev*-entry aangegeven worden.

source: For more verbose layout use normal tables rather than inline tables to specify dependencies
nl: Voor een uitgebreide layout kunnen normale tabellen gebruikt worden in plaats van inline-tabellen om afhankelijkheden te specificeren."

source: Development dependencies
nl: Afhankelijkheden voor ontwikkeling

source: Development dependencies allow to declare *dev-dependencies* in the manifest root, which are available to all tests but not exported with the project.
nl: Afhankelijkheden die een rol spelen bij de ontwikkeling zijn aan te geven via de entry *dev-dependencies* in het hoofdentry van het manifest. Ze zijn beschikbaar voor alle testen, maar worden niet geëxporteerd.

source: Installation configuration
nl: Installatieconfiguratie

source: In the *install* section components for the installation can be selected. By default only executables are installed, library projects can set the *library* boolean to also installatation the module files and the archive.
nl: In de *install*-sectie kunnen componenten voor de installatie geselecteerd worden. Standaard worden alleen de executables geïnstalleerd. Bij bibliotheekprojecten kan het *library*-kenmerk op *true* gezet worden, om de bibliotheek en de modulebestanden ook te installeren.

source: *Example*
nl: *Voorbeeld*

source: Additional free data field
nl: Veld voor aanvullende gegevens

source: Third-party tools can store their configuration inside the *extra* section. This section will never be evaluated by fpm itself, the only constraint imposed is that it has to be valid TOML.
nl: Externe tools kunnen configuratiegegevens in de sectie *extra* opslaan. Deze sectie wordt door fpm nooit geëvalueerd. De enige voorwaarde is dat het voldoet aan het TOML-format.

source: Since the format of this section is free, only recommendations are provided here for adding data to the *extra* section.
nl: Aangezien het format van deze sectie verder vrij is, worden hier enkele aanbevelingen gegeven.
