Repository: fortran-lang/fpm-docs
Catalog: locale/*/LC_MESSAGES/spec.po
Languages: nl

source: Only use subtables, never add configuration data to the top level of the *extra* section. Reasoning: different tools can avoid collisions of key names by placing their data in separate subtables.
nl: Gebruik alleen deeltabellen, nooit configuratiegegevens op het hoogste niveau binnen de sectie *extra*. De reden: veschillende tools kunnen dan conflicten met de sleutelwoorden vermijden, doordat ze verschillende deeltabellen gebruiken.

source: Use the concrete name of the tool rather than a generic name for the subtable. Reasoning: different formatter or linter tools might use conflicting keywords in a *format* or *lint* subtable. Also, users can tell from the table name which tool is preferred to use with the project.
nl: Gebruik steeds de concrete naam van het tool in plaats van een generieke naam voor de deeltabellen. De reden: verschillende formatterings- of opschoon-tools kunnen in einer *format*- oder *lint*-deeltabel conflicterende sleutelwoorden gebruiken. Gebruikers kunnen ook met de tabelnaam kiezen voor de juiste tool voor het project.

source: Fpm plugins should use a subtable with their plugin name in the *extra.fpm* section to store their data. Reasoning: following this convention provides the user of fpm plugins with one section to configure their used plugins.
nl: Fpm-Plugins moeten een deeltabel met de pluginnaam in de sectie *extra.fpm* opslaan. Reden: met deze conventie kan de gebruiker van fpm-plugins met een enkele sectie de te gebruiken plugins configureren,

source: Use the fpm preferred style for keywords which is lowercase with dashes. Reasoning: while there is no style check in this section, a consistent style in the whole manifest will make it easier for the user to understand the whole package manifest.
nl: Gebruik bij voorkeur de fpm-stijl voor sleutelwoorden, kleine letters en streepjes om onderdelen te scheiden. Reden: er vind weliswaar geen controle plaats in deze sectie, maar een consistente stijl in het hele manifestbestand maakt het gemakkelijker voor de gebruiker om de inhoud t begrijpen.

source: Feedback for the recommendations above is very much welcome. If you have a tool that uses the *extra* section in the package manifest, feel free to post it in at the [fpm discussion board](https://github.com/fortran-lang/fpm/discussions).
nl: Terugmeldungen en suggesties voor de genoemde aanbevelingen zijn van harte welkom. Dit geldt zeker voor tools die via de sectie *extra* in het manifestbestand geconfigureerd kunnen worden. Meld dit in het [fpm discussieforum](https://github.com/fortran-lang/fpm/discussions).
